#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_popup_1

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "E_SASKind_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.ExecuteUbergraph_WB_ui_SasLink_popup_1
// 0x0168 (0x0168 - 0x0000)
struct WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B19[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1A[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1B[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1C[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1D[0x1];                                     // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_index;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1E[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_5;                      // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_SasLink_skill_parts_2_C*         K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_4;                      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_3;                      // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_SasLink_skill_parts_2_C*         K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_1; // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B20[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_SasLink_skill_parts_2_C*         K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_2; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B21[0x2];                                     // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B22[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_isMouseScroll_1;                // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_2;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B23[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B24[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_SasLink_skill_parts_2_C*         K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_3; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B25[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_isMouseScroll;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_1;                       // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B26[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor;                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B27[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_SasLink_skill_parts_2_C*         K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_4; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B28[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B29[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2A[0x3];                                     // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1) == 0x000168, "Wrong size on WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, EntryPoint) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000024, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00003C, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate_3) == 0x000040, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000050, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_Event_State) == 0x000054, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_Event_SubState) == 0x000058, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_SwitchInteger_CmpSuccess) == 0x000060, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000061, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000064, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000078, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00007C, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CreateDelegate_OutputDelegate_5) == 0x000080, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_GetPlatformType_ReturnValue) == 0x000090, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000091, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000092, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000094, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_index) == 0x000098, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget_5) == 0x0000A0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget_5' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2) == 0x0000A8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget_4) == 0x0000B8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget_3) == 0x0000C0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_1) == 0x0000C8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_2) == 0x0000D8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000E1, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x0000E4, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0000E8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_isMouseScroll_1) == 0x0000EC, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_cursor_2) == 0x0000F0, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_cursor_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget_2) == 0x0000F8, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000100, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_3) == 0x000108, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_bSuccess_3) == 0x000110, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_isMouseScroll) == 0x000114, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_cursor_1) == 0x000118, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_cursor_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget_1) == 0x000120, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_cursor) == 0x000128, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_CustomEvent_pWidget) == 0x000130, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_4) == 0x000138, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_AsWB_Ui_Sas_Link_Skill_Parts_2_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, K2Node_DynamicCast_bSuccess_4) == 0x000140, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_PlaySE_ReturnValue) == 0x000148, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000150, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_PlaySE_ReturnValue_1) == 0x000158, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000160, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000164, "Member 'WB_ui_SasLink_popup_1_C_ExecuteUbergraph_WB_ui_SasLink_popup_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_LeftDown_Mouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse) == 0x000010, "Wrong size on WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse, Param_Cursor) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse, PWidget) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_Event_LeftDown_Mouse::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_UnFocus_Mouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse) == 0x000010, "Wrong size on WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse, Param_Cursor) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse, PWidget) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_Event_UnFocus_Mouse::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_Focus_Mouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_Focus_Mouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_Focus_Mouse) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_Focus_Mouse");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_Focus_Mouse) == 0x000010, "Wrong size on WB_ui_SasLink_popup_1_C_Event_Focus_Mouse");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_Focus_Mouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_Focus_Mouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_Focus_Mouse, Param_Cursor) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_Event_Focus_Mouse::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_Focus_Mouse, PWidget) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_Event_Focus_Mouse::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_UnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_UnFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_UnFocus) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_UnFocus");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_UnFocus) == 0x000008, "Wrong size on WB_ui_SasLink_popup_1_C_Event_UnFocus");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UnFocus, PWidget) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_UnFocus::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_Focus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_Focus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_Focus) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_Focus");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_Focus) == 0x000008, "Wrong size on WB_ui_SasLink_popup_1_C_Event_Focus");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_Focus, PWidget) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_Focus::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.Event_UpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_SasLink_popup_1_C_Event_UpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_Event_UpdateElement) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_Event_UpdateElement");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_Event_UpdateElement) == 0x000010, "Wrong size on WB_ui_SasLink_popup_1_C_Event_UpdateElement");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_Event_UpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_Event_UpdateElement, PWidget) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_Event_UpdateElement::PWidget' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_SasLink_popup_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_SasLink_popup_1_C_UpdateState");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_SasLink_popup_1_C_UpdateState");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_SasLink_popup_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2D[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B2E[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_SasLink_popup_1_C_StateNone");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_StateNone) == 0x000014, "Wrong size on WB_ui_SasLink_popup_1_C_StateNone");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateNone, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_StateNone::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000C, "Member 'WB_ui_SasLink_popup_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_SasLink_popup_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.StateOpen
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_SasLink_popup_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B2F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBondMax_IsMax;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B30[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B31[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_StateOpen");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_StateOpen) == 0x000028, "Wrong size on WB_ui_SasLink_popup_1_C_StateOpen");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_GetPlatformType_ReturnValue) == 0x000014, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_IsBondMax_IsMax) == 0x000015, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_IsBondMax_IsMax' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000016, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000017, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000020, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000024, "Member 'WB_ui_SasLink_popup_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.StateLoop
// 0x001C (0x001C - 0x0000)
struct WB_ui_SasLink_popup_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B32[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBondMax_IsMax;                          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B33[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B34[0x1];                                     // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_SasLink_popup_1_C_StateLoop");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_StateLoop) == 0x00001C, "Wrong size on WB_ui_SasLink_popup_1_C_StateLoop");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_CheckInput_IsInput) == 0x000006, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_IsBondMax_IsMax) == 0x00000C, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_IsBondMax_IsMax' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_CheckInput_IsInput_1) == 0x000014, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000016, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000018, "Member 'WB_ui_SasLink_popup_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.StateClose
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_SasLink_popup_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B35[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B36[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBondMax_IsMax;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B37[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B38[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_popup_1_C_StateClose) == 0x000008, "Wrong alignment on WB_ui_SasLink_popup_1_C_StateClose");
static_assert(sizeof(WB_ui_SasLink_popup_1_C_StateClose) == 0x000028, "Wrong size on WB_ui_SasLink_popup_1_C_StateClose");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_SasLink_popup_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasLink_popup_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_IsBondMax_IsMax) == 0x000019, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_IsBondMax_IsMax' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000020, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_BooleanOR_ReturnValue) == 0x000021, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000022, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_popup_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000024, "Member 'WB_ui_SasLink_popup_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C.SetCharacter
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_SasLink_popup_1_C_SetCharacter final
{
public:
	EPlayerID                                     Param_CharaID;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableDLC1;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableDLC2;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B39[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerManager*                         CallFunc_GetPlayerManager_PlayerManager;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetBattleMemberPlayerID_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B3A[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBondsLevel_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
