#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_WorldMap_ListWindow_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1
// 0x0120 (0x0120 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E50[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E51[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E52[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E53[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E54[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E55[0x1];                                     // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x007C(0x000C)(NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E56[0x3];                                     // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E57[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E58[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item_2;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E59[0x3];                                     // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_IsEnable;                        // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E5A[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_ui_WorldMap_Parts_1_C*>      K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E5B[0x6];                                     // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item_3;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_2;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5C[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E5D[0x1];                                     // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1) == 0x000120, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, EntryPoint) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000014, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000030, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000038, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Loop_Counter_Variable_3) == 0x00003C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Add_IntInt_ReturnValue_3) == 0x000044, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, Temp_int_Array_Index_Variable_3) == 0x000048, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_Event_IsDesignTime) == 0x00004C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00004D, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000050, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_Event_State) == 0x000054, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_Event_SubState) == 0x000058, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_Event_DeltaSeconds) == 0x00005C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_SwitchInteger_CmpSuccess) == 0x000060, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000061, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000064, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_GetPlatformType_ReturnValue) == 0x000068, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000069, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00006A, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00006C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Get_Item) == 0x000070, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_CustomEvent_argument) == 0x00007C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_CustomEvent_pWidget) == 0x000088, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_PlaySE_ReturnValue) == 0x0000B0, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000B9, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Get_Item_2) == 0x0000C0, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x0000C8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x0000CC, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x0000D0, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_IsEnable_IsEnable) == 0x0000D4, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_IsEnable_IsEnable' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Not_PreBool_ReturnValue) == 0x0000E8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_BooleanAND_ReturnValue) == 0x0000E9, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Get_Item_3) == 0x0000F0, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_PlaySE_ReturnValue_1) == 0x0000F8, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_PlaySE_ReturnValue_2) == 0x000100, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000108, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x00010C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Length_ReturnValue_2) == 0x000110, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Less_IntInt_ReturnValue_2) == 0x000114, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Not_PreBool_ReturnValue_1) == 0x000115, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_BooleanAND_ReturnValue_1) == 0x000116, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Array_Length_ReturnValue_3) == 0x000118, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1, CallFunc_Less_IntInt_ReturnValue_3) == 0x00011C, "Member 'WB_ui_WorldMap_ListWindow_1_C_ExecuteUbergraph_WB_ui_WorldMap_ListWindow_1::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.ﬁ¶πµ÷Íπ»
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_________ final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_4E5E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_________) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_________");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_________) == 0x000018, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_________");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_________, Argument) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_________::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_________, PWidget) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_________::PWidget' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_UpdateState");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_UpdateState");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_PreConstruct");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_PreConstruct");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.StateNone
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E5F[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_playerID;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     CallFunc_GetIsProgressBondsEpisode_targetID;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsProgressBondsEpisode_ReturnValue;    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E60[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BattleManager_C*                    CallFunc_GetBattleManager_BattleManager;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBattleMode_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_StateNone");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_StateNone) == 0x000030, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_StateNone");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_GetLevelManager_LevelManager) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_GetLevelManager_LevelManager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_GetIsProgressBondsEpisode_playerID) == 0x000018, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_GetIsProgressBondsEpisode_playerID' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_GetIsProgressBondsEpisode_targetID) == 0x000019, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_GetIsProgressBondsEpisode_targetID' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_GetIsProgressBondsEpisode_ReturnValue) == 0x00001A, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_GetIsProgressBondsEpisode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue) == 0x00001B, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_GetBattleManager_BattleManager) == 0x000020, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_GetBattleManager_BattleManager' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateNone, CallFunc_IsBattleMode_ReturnValue) == 0x000028, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateNone::CallFunc_IsBattleMode_ReturnValue' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.StateOpen
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E61[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_StateOpen");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_StateOpen) == 0x000020, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_StateOpen");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_PlaySE_ReturnValue) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.StateLoop
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E62[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E63[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_2;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E64[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDecideAnimation_IsDecide;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E65[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item_1;                         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E66[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_StateLoop");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_StateLoop) == 0x000050, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_StateLoop");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_PlaySE_ReturnValue_1) == 0x000018, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_PlaySE_ReturnValue_2) == 0x000020, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x000028, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000029, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_Array_Get_Item) == 0x000030, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_IsDecideAnimation_IsDecide) == 0x000038, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_IsDecideAnimation_IsDecide' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_CheckInput_IsInput) == 0x000048, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000049, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_CheckInput_IsInput_1) == 0x00004A, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00004C, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.StateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E67[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_StateClose");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_StateClose) == 0x000014, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_StateClose");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_WorldMap_ListWindow_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.SetAreaList
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_SetAreaList final
{
public:
	TArray<struct FWorldmapOpenAreaParam>         List;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_WorldMap_ListWindow_1_C_SetAreaList) == 0x000008, "Wrong alignment on WB_ui_WorldMap_ListWindow_1_C_SetAreaList");
static_assert(sizeof(WB_ui_WorldMap_ListWindow_1_C_SetAreaList) == 0x000010, "Wrong size on WB_ui_WorldMap_ListWindow_1_C_SetAreaList");
static_assert(offsetof(WB_ui_WorldMap_ListWindow_1_C_SetAreaList, List) == 0x000000, "Member 'WB_ui_WorldMap_ListWindow_1_C_SetAreaList::List' has a wrong offset!");

// Function WB_ui_WorldMap_ListWindow_1.WB_ui_WorldMap_ListWindow_1_C.SetList
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_WorldMap_ListWindow_1_C_SetList final
{
public:
	int32                                         _Length;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E68[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_WorldMap_Parts_1_C*              CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E69[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
