#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ShopContents_Parts_5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_ShopContents_Parts_5.WB_ui_ShopContents_Parts_5_C
// 0x0058 (0x03E0 - 0x0388)
class UWB_ui_ShopContents_Parts_5_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_out;                                        // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Arrow_R2;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow_R2_add;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_font_R2;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set;                                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_Button_R_;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_ShopContents_Parts_5(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void PressButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_ShopContents_Parts_5_C">();
	}
	static class UWB_ui_ShopContents_Parts_5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_ShopContents_Parts_5_C>();
	}
};
static_assert(alignof(UWB_ui_ShopContents_Parts_5_C) == 0x000008, "Wrong alignment on UWB_ui_ShopContents_Parts_5_C");
static_assert(sizeof(UWB_ui_ShopContents_Parts_5_C) == 0x0003E0, "Wrong size on UWB_ui_ShopContents_Parts_5_C");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_ShopContents_Parts_5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Select_out) == 0x000390, "Member 'UWB_ui_ShopContents_Parts_5_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Select_in) == 0x000398, "Member 'UWB_ui_ShopContents_Parts_5_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Select) == 0x0003A0, "Member 'UWB_ui_ShopContents_Parts_5_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Decision) == 0x0003A8, "Member 'UWB_ui_ShopContents_Parts_5_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Default) == 0x0003B0, "Member 'UWB_ui_ShopContents_Parts_5_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Arrow_R2) == 0x0003B8, "Member 'UWB_ui_ShopContents_Parts_5_C::Arrow_R2' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Arrow_R2_add) == 0x0003C0, "Member 'UWB_ui_ShopContents_Parts_5_C::Arrow_R2_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Icon_font_R2) == 0x0003C8, "Member 'UWB_ui_ShopContents_Parts_5_C::Icon_font_R2' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Set) == 0x0003D0, "Member 'UWB_ui_ShopContents_Parts_5_C::Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_ShopContents_Parts_5_C, Text_shop_Button_R_) == 0x0003D8, "Member 'UWB_ui_ShopContents_Parts_5_C::Text_shop_Button_R_' has a wrong offset!");

}

