#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Quest_Parts_1.WB_ui_Quest_Parts_1_C
// 0x0098 (0x05C0 - 0x0528)
class UWB_ui_Quest_Parts_1_C final : public UUIQuestListIndex
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_lock_in;                                    // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_lock;                                       // 0x0538(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_lock;                                      // 0x0540(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 black_pattern_1;                                   // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 black_pattern_2;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a_1;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a_2;                                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_challenge;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_quest;                                        // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Kasane;                                            // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_list_1;                                 // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Yuito;                                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Quest_Parts_1(int32 EntryPoint);
	void SetClearGetterInfo(const class FString& StrTitle, int32 Progress, bool IsNew, bool IsGetReward);
	void Construct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void SetInfo(EQuestDataType QuestType, const class FName& ID, int32 Progress, int32 Param_Index, bool IsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Quest_Parts_1_C">();
	}
	static class UWB_ui_Quest_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Quest_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_Quest_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_Quest_Parts_1_C");
static_assert(sizeof(UWB_ui_Quest_Parts_1_C) == 0x0005C0, "Wrong size on UWB_ui_Quest_Parts_1_C");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, UberGraphFrame) == 0x000528, "Member 'UWB_ui_Quest_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Select_lock_in) == 0x000530, "Member 'UWB_ui_Quest_Parts_1_C::Select_lock_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Select_lock) == 0x000538, "Member 'UWB_ui_Quest_Parts_1_C::Select_lock' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Default_lock) == 0x000540, "Member 'UWB_ui_Quest_Parts_1_C::Default_lock' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Select_in) == 0x000548, "Member 'UWB_ui_Quest_Parts_1_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Select) == 0x000550, "Member 'UWB_ui_Quest_Parts_1_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Default) == 0x000558, "Member 'UWB_ui_Quest_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, black_pattern_1) == 0x000560, "Member 'UWB_ui_Quest_Parts_1_C::black_pattern_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, black_pattern_2) == 0x000568, "Member 'UWB_ui_Quest_Parts_1_C::black_pattern_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Face_a_1) == 0x000570, "Member 'UWB_ui_Quest_Parts_1_C::Face_a_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Face_a_2) == 0x000578, "Member 'UWB_ui_Quest_Parts_1_C::Face_a_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Icon_challenge) == 0x000580, "Member 'UWB_ui_Quest_Parts_1_C::Icon_challenge' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Icon_new) == 0x000588, "Member 'UWB_ui_Quest_Parts_1_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Icon_quest) == 0x000590, "Member 'UWB_ui_Quest_Parts_1_C::Icon_quest' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Image_1) == 0x000598, "Member 'UWB_ui_Quest_Parts_1_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Image_2) == 0x0005A0, "Member 'UWB_ui_Quest_Parts_1_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Kasane) == 0x0005A8, "Member 'UWB_ui_Quest_Parts_1_C::Kasane' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Text_quest_list_1) == 0x0005B0, "Member 'UWB_ui_Quest_Parts_1_C::Text_quest_list_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_1_C, Yuito) == 0x0005B8, "Member 'UWB_ui_Quest_Parts_1_C::Yuito' has a wrong offset!");

}

