#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_menu_control

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Sas_menu_control.WB_ui_Sas_menu_control_C
// 0x0200 (0x05A0 - 0x03A0)
class UWB_ui_Sas_menu_control_C final : public UUISASMenuControl
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Chenge_page_2;                                     // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Chenge_page_1;                                     // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_4;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_button_4_1;                                 // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_button_1_4;                                 // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Button_0;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_1;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_2;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_3;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Sas_frame_01_C*                  Icon_0;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Sas_frame_01_C*                  Icon_1;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Sas_frame_01_C*                  Icon_2;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Sas_frame_01_C*                  Icon_3;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Name_0;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Name_1;                                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Name_2;                                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Name_3;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_FixGInvBug;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SAS_Base_0;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SAS_Base_1;                                        // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SAS_Base_2;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SAS_Base_3;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon_font_0;                                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon_font_1;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon_font_2;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon_font_3;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_SasName_0;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_SasName_1;                                    // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_SasName_2;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_SasName_3;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_Sas_frame_01_C*>          FrameList;                                         // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         ButtonList;                                        // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UTextBlock*>                     TextNameList;                                      // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UREDTextBlock*>                  TextKeyList;                                       // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         BaseList;                                          // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         KeyIconList;                                       // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         Page;                                              // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewPage;                                           // 0x051C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugActiveFlag;                                   // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ActiveSasFlag;                                     // 0x0521(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ActiveCvFlag;                                      // 0x0522(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugHideLockIconFlag;                             // 0x0523(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98DA[0x4];                                     // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Sas_page_01_C*                   PageObject;                                        // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Sas_button_02_C*                 SasButtonObject;                                   // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Sas_button_03_C*                 CvButtonObject;                                    // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 TextColorBackupList;                               // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         BgFadeSpeed;                                       // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98DB[0x4];                                     // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_SASButton>                           SasButtonList;                                     // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UOverlay*>                       NameList;                                          // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         CvUnAcquiredList;                                  // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          EnableCvFlag;                                      // 0x0588(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WorkActiveSasFlag;                                 // 0x0589(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          WorkActiveCvFlag;                                  // 0x058A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeFlag;                                        // 0x058B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_98DC[0x4];                                     // 0x058C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  PageEnableFlag;                                    // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Sas_menu_control(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetupIconList();
	void Setup_Skill_Name(bool IsCv);
	void ChangePage(int32 Param_Page);
	void SetIconScale(const struct FVector2D& Scale);
	void DebugSetActiveFlag(bool ActiveFlag);
	void DebugIsPlay(bool* IsPlay);
	void UpdateActiveFlag();
	void DebugSetHideLockIconFlag(bool HideFlag);
	void UpdateActiveIconVisible();
	void SetActiveVisible(bool Param_IsVisible);
	void IsActive(bool* Param_IsActive);
	void SetObject(class UWB_ui_Sas_frame_02_C* Frame0, class UWB_ui_Sas_frame_02_C* Frame1, class UWB_ui_Sas_frame_02_C* Frame2, class UWB_ui_Sas_frame_02_C* Frame3, class UImage* None0, class UImage* None1, class UImage* None2, class UImage* None3, class UWB_ui_Sas_page_01_C* Param_Page, class UWB_ui_Sas_button_02_C* SASButton, class UWB_ui_Sas_button_03_C* CvButton, class UImage* CvUnAcquired0, class UImage* CvUnAcquired1, class UImage* CvUnAcquired2, class UImage* CvUnAcquired3, class UWB_ui_NexusDrive_Sas_C* NexusDriveSas0, class UWB_ui_NexusDrive_Sas_C* NexusDriveSas1, class UWB_ui_NexusDrive_Sas_C* NexusDriveSas2, class UWB_ui_NexusDrive_Sas_C* NexusDriveSas3, class UImage* NexusDriveBase0, class UImage* NexusDriveBase1, class UImage* NexusDriveBase2, class UImage* NexusDriveBase3, class UImage* NexusDriveCorner0, class UImage* NexusDriveCorner1, class UImage* NexusDriveCorner2, class UImage* NexusDriveCorner3, class UImage* NexusDriveCenter0, class UImage* NexusDriveCenter1, class UImage* NexusDriveCenter2, class UImage* NexusDriveCenter3);
	void ChangePageReal();
	void SetIconVisible(bool Param_IsVisible);
	void UpdateMessageColor();
	void UpdateSasButton();
	void UpdateButtonIcon();
	void SetupDisableCombinationVision(bool IsReset);
	void SetupCombinationVisionIcon();
	void CheckDecide();
	void Set_Change_Page_Ready(bool ReadyFlagL, bool ReadyFlagR);
	void SetFrameActiveFlag();
	void SetupPage();
	void GetEnablePageNum(int32* Num);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Sas_menu_control_C">();
	}
	static class UWB_ui_Sas_menu_control_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Sas_menu_control_C>();
	}
};
static_assert(alignof(UWB_ui_Sas_menu_control_C) == 0x000008, "Wrong alignment on UWB_ui_Sas_menu_control_C");
static_assert(sizeof(UWB_ui_Sas_menu_control_C) == 0x0005A0, "Wrong size on UWB_ui_Sas_menu_control_C");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, UberGraphFrame) == 0x0003A0, "Member 'UWB_ui_Sas_menu_control_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Chenge_page_2) == 0x0003A8, "Member 'UWB_ui_Sas_menu_control_C::Chenge_page_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Chenge_page_1) == 0x0003B0, "Member 'UWB_ui_Sas_menu_control_C::Chenge_page_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Default_4) == 0x0003B8, "Member 'UWB_ui_Sas_menu_control_C::Default_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Change_button_4_1) == 0x0003C0, "Member 'UWB_ui_Sas_menu_control_C::Change_button_4_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Change_button_1_4) == 0x0003C8, "Member 'UWB_ui_Sas_menu_control_C::Change_button_1_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Out) == 0x0003D0, "Member 'UWB_ui_Sas_menu_control_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, In) == 0x0003D8, "Member 'UWB_ui_Sas_menu_control_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Default_none) == 0x0003E0, "Member 'UWB_ui_Sas_menu_control_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Default_1) == 0x0003E8, "Member 'UWB_ui_Sas_menu_control_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Button_0) == 0x0003F0, "Member 'UWB_ui_Sas_menu_control_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Button_1) == 0x0003F8, "Member 'UWB_ui_Sas_menu_control_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Button_2) == 0x000400, "Member 'UWB_ui_Sas_menu_control_C::Button_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Button_3) == 0x000408, "Member 'UWB_ui_Sas_menu_control_C::Button_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Icon_0) == 0x000410, "Member 'UWB_ui_Sas_menu_control_C::Icon_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Icon_1) == 0x000418, "Member 'UWB_ui_Sas_menu_control_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Icon_2) == 0x000420, "Member 'UWB_ui_Sas_menu_control_C::Icon_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Icon_3) == 0x000428, "Member 'UWB_ui_Sas_menu_control_C::Icon_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Name_0) == 0x000430, "Member 'UWB_ui_Sas_menu_control_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Name_1) == 0x000438, "Member 'UWB_ui_Sas_menu_control_C::Name_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Name_2) == 0x000440, "Member 'UWB_ui_Sas_menu_control_C::Name_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Name_3) == 0x000448, "Member 'UWB_ui_Sas_menu_control_C::Name_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, PG_FixGInvBug) == 0x000450, "Member 'UWB_ui_Sas_menu_control_C::PG_FixGInvBug' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SAS_Base_0) == 0x000458, "Member 'UWB_ui_Sas_menu_control_C::SAS_Base_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SAS_Base_1) == 0x000460, "Member 'UWB_ui_Sas_menu_control_C::SAS_Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SAS_Base_2) == 0x000468, "Member 'UWB_ui_Sas_menu_control_C::SAS_Base_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SAS_Base_3) == 0x000470, "Member 'UWB_ui_Sas_menu_control_C::SAS_Base_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Sas_icon_font_0) == 0x000478, "Member 'UWB_ui_Sas_menu_control_C::Sas_icon_font_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Sas_icon_font_1) == 0x000480, "Member 'UWB_ui_Sas_menu_control_C::Sas_icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Sas_icon_font_2) == 0x000488, "Member 'UWB_ui_Sas_menu_control_C::Sas_icon_font_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Sas_icon_font_3) == 0x000490, "Member 'UWB_ui_Sas_menu_control_C::Sas_icon_font_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Text_SasName_0) == 0x000498, "Member 'UWB_ui_Sas_menu_control_C::Text_SasName_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Text_SasName_1) == 0x0004A0, "Member 'UWB_ui_Sas_menu_control_C::Text_SasName_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Text_SasName_2) == 0x0004A8, "Member 'UWB_ui_Sas_menu_control_C::Text_SasName_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Text_SasName_3) == 0x0004B0, "Member 'UWB_ui_Sas_menu_control_C::Text_SasName_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, FrameList) == 0x0004B8, "Member 'UWB_ui_Sas_menu_control_C::FrameList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, ButtonList) == 0x0004C8, "Member 'UWB_ui_Sas_menu_control_C::ButtonList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, TextNameList) == 0x0004D8, "Member 'UWB_ui_Sas_menu_control_C::TextNameList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, TextKeyList) == 0x0004E8, "Member 'UWB_ui_Sas_menu_control_C::TextKeyList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, BaseList) == 0x0004F8, "Member 'UWB_ui_Sas_menu_control_C::BaseList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, KeyIconList) == 0x000508, "Member 'UWB_ui_Sas_menu_control_C::KeyIconList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, Page) == 0x000518, "Member 'UWB_ui_Sas_menu_control_C::Page' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, NewPage) == 0x00051C, "Member 'UWB_ui_Sas_menu_control_C::NewPage' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, DebugActiveFlag) == 0x000520, "Member 'UWB_ui_Sas_menu_control_C::DebugActiveFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, ActiveSasFlag) == 0x000521, "Member 'UWB_ui_Sas_menu_control_C::ActiveSasFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, ActiveCvFlag) == 0x000522, "Member 'UWB_ui_Sas_menu_control_C::ActiveCvFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, DebugHideLockIconFlag) == 0x000523, "Member 'UWB_ui_Sas_menu_control_C::DebugHideLockIconFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, PageObject) == 0x000528, "Member 'UWB_ui_Sas_menu_control_C::PageObject' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SasButtonObject) == 0x000530, "Member 'UWB_ui_Sas_menu_control_C::SasButtonObject' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, CvButtonObject) == 0x000538, "Member 'UWB_ui_Sas_menu_control_C::CvButtonObject' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, TextColorBackupList) == 0x000540, "Member 'UWB_ui_Sas_menu_control_C::TextColorBackupList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, BgFadeSpeed) == 0x000550, "Member 'UWB_ui_Sas_menu_control_C::BgFadeSpeed' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, SasButtonList) == 0x000558, "Member 'UWB_ui_Sas_menu_control_C::SasButtonList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, NameList) == 0x000568, "Member 'UWB_ui_Sas_menu_control_C::NameList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, CvUnAcquiredList) == 0x000578, "Member 'UWB_ui_Sas_menu_control_C::CvUnAcquiredList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, EnableCvFlag) == 0x000588, "Member 'UWB_ui_Sas_menu_control_C::EnableCvFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, WorkActiveSasFlag) == 0x000589, "Member 'UWB_ui_Sas_menu_control_C::WorkActiveSasFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, WorkActiveCvFlag) == 0x00058A, "Member 'UWB_ui_Sas_menu_control_C::WorkActiveCvFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, ChangeFlag) == 0x00058B, "Member 'UWB_ui_Sas_menu_control_C::ChangeFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_menu_control_C, PageEnableFlag) == 0x000590, "Member 'UWB_ui_Sas_menu_control_C::PageEnableFlag' has a wrong offset!");

}

