#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Item

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Item.WB_ui_Item_C.ExecuteUbergraph_WB_ui_Item
// 0x00A0 (0x00A0 - 0x0000)
struct WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_index_2;                              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F4[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_Event_Widget_2;                             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll_1;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59F5[0x3];                                     // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59F6[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_ui_MainContents_Parts_6_C*>  K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item) == 0x000008, "Wrong alignment on WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item");
static_assert(sizeof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item) == 0x0000A0, "Wrong size on WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, EntryPoint) == 0x000000, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, Temp_int_Loop_Num_Variable) == 0x000008, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_State) == 0x00000C, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_SubState) == 0x000010, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_index_2) == 0x000048, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_index_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_Widget_2) == 0x000050, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_Widget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_isMouseScroll_1) == 0x000058, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_index_1) == 0x00005C, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_Widget_1) == 0x000060, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_isMouseScroll) == 0x000068, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_index) == 0x00006C, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_Event_Widget) == 0x000070, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, CallFunc_GetPlatformType_ReturnValue) == 0x000088, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000089, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item, K2Node_MakeArray_Array) == 0x000090, "Member 'WB_ui_Item_C_ExecuteUbergraph_WB_ui_Item::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_Item.WB_ui_Item_C.ListUnFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Item_C_ListUnFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_C_ListUnFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Item_C_ListUnFocusMouse");
static_assert(sizeof(WB_ui_Item_C_ListUnFocusMouse) == 0x000010, "Wrong size on WB_ui_Item_C_ListUnFocusMouse");
static_assert(offsetof(WB_ui_Item_C_ListUnFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Item_C_ListUnFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ListUnFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Item_C_ListUnFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ListUnFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Item_C_ListUnFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Item.WB_ui_Item_C.ListFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Item_C_ListFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_C_ListFocusMouse) == 0x000008, "Wrong alignment on WB_ui_Item_C_ListFocusMouse");
static_assert(sizeof(WB_ui_Item_C_ListFocusMouse) == 0x000010, "Wrong size on WB_ui_Item_C_ListFocusMouse");
static_assert(offsetof(WB_ui_Item_C_ListFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_Item_C_ListFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ListFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_Item_C_ListFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ListFocusMouse, Widget) == 0x000008, "Member 'WB_ui_Item_C_ListFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_Item.WB_ui_Item_C.ListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Item_C_ListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_C_ListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_Item_C_ListUpdateElement");
static_assert(sizeof(WB_ui_Item_C_ListUpdateElement) == 0x000010, "Wrong size on WB_ui_Item_C_ListUpdateElement");
static_assert(offsetof(WB_ui_Item_C_ListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_Item_C_ListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_ListUpdateElement, Widget) == 0x000008, "Member 'WB_ui_Item_C_ListUpdateElement::Widget' has a wrong offset!");

// Function WB_ui_Item.WB_ui_Item_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Item_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Item_C_UpdateState");
static_assert(sizeof(WB_ui_Item_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Item_C_UpdateState");
static_assert(offsetof(WB_ui_Item_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Item_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Item_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Item_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

