#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Item_EStatus_Parts_2

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_2_C.ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     K2Node_Event_characterID;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5772[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipOrLoveIcon                              K2Node_Event_Type;                                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5773[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2) == 0x000004, "Wrong alignment on WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2");
static_assert(sizeof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2) == 0x000018, "Wrong size on WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, K2Node_Event_characterID) == 0x000004, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::K2Node_Event_characterID' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, K2Node_Event_Type) == 0x00000C, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'WB_ui_Item_EStatus_Parts_2_C_ExecuteUbergraph_WB_ui_Item_EStatus_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_2_C.SetEquipOrLoveIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon final
{
public:
	EEquipOrLoveIcon                              Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon) == 0x000001, "Wrong alignment on WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon");
static_assert(sizeof(WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon) == 0x000001, "Wrong size on WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon, Type) == 0x000000, "Member 'WB_ui_Item_EStatus_Parts_2_C_SetEquipOrLoveIcon::Type' has a wrong offset!");

// Function WB_ui_Item_EStatus_Parts_2.WB_ui_Item_EStatus_Parts_2_C.SetFaceIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon final
{
public:
	EPlayerID                                     CharacterId;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon) == 0x000001, "Wrong alignment on WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon");
static_assert(sizeof(WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon) == 0x000001, "Wrong size on WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon");
static_assert(offsetof(WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon, CharacterId) == 0x000000, "Member 'WB_ui_Item_EStatus_Parts_2_C_SetFaceIcon::CharacterId' has a wrong offset!");

}

