#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Loading_chapter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Loading_chapter.WB_ui_Loading_chapter_C
// 0x01D8 (0x05B8 - 0x03E0)
class UWB_ui_Loading_chapter_C final : public UUILoadingChapter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 All_noise_1;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_all;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Gradation_B;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Gradation_light;                              // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Gradation_R;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_1;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_2;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_3;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_1_particle;                              // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_2_particle;                              // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Line_3_particle;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_particle_1;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Shadow;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_L;                                       // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_R;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_Un;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_Up;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_1;                                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Eff_2;                                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Font_base_1;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost_1;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost_2;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_2;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_3;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_5;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_1;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_2;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_3;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_4;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_1_particle;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_2_particle;                             // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_3_particle;                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_chara_4_particle;                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Location_image;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_Base;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_2;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_3;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_4;                                       // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_5;                                       // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_2_particle;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_3_particle;                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_4_particle;                              // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_line_5_particle;                              // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_line;                                        // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_line_2;                                      // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_TV;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_TV_2;                                        // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_7;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu;                               // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_noise_1;                            // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_noise_2;                            // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_chapter_info;                                 // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_chapter_num;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_chapter_title;                                // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Loading_chapter(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Loading_chapter_C">();
	}
	static class UWB_ui_Loading_chapter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Loading_chapter_C>();
	}
};
static_assert(alignof(UWB_ui_Loading_chapter_C) == 0x000008, "Wrong alignment on UWB_ui_Loading_chapter_C");
static_assert(sizeof(UWB_ui_Loading_chapter_C) == 0x0005B8, "Wrong size on UWB_ui_Loading_chapter_C");
static_assert(offsetof(UWB_ui_Loading_chapter_C, UberGraphFrame) == 0x0003E0, "Member 'UWB_ui_Loading_chapter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Out) == 0x0003E8, "Member 'UWB_ui_Loading_chapter_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, In) == 0x0003F0, "Member 'UWB_ui_Loading_chapter_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Default_none) == 0x0003F8, "Member 'UWB_ui_Loading_chapter_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Default) == 0x000400, "Member 'UWB_ui_Loading_chapter_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, All_noise_1) == 0x000408, "Member 'UWB_ui_Loading_chapter_C::All_noise_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_all) == 0x000410, "Member 'UWB_ui_Loading_chapter_C::Base_all' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Gradation_B) == 0x000418, "Member 'UWB_ui_Loading_chapter_C::Base_Gradation_B' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Gradation_light) == 0x000420, "Member 'UWB_ui_Loading_chapter_C::Base_Gradation_light' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Gradation_R) == 0x000428, "Member 'UWB_ui_Loading_chapter_C::Base_Gradation_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_1) == 0x000430, "Member 'UWB_ui_Loading_chapter_C::Base_Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_2) == 0x000438, "Member 'UWB_ui_Loading_chapter_C::Base_Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_3) == 0x000440, "Member 'UWB_ui_Loading_chapter_C::Base_Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_1_particle) == 0x000448, "Member 'UWB_ui_Loading_chapter_C::Base_Line_1_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_2_particle) == 0x000450, "Member 'UWB_ui_Loading_chapter_C::Base_Line_2_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_Line_3_particle) == 0x000458, "Member 'UWB_ui_Loading_chapter_C::Base_Line_3_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Base_particle_1) == 0x000460, "Member 'UWB_ui_Loading_chapter_C::Base_particle_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, BG_Shadow) == 0x000468, "Member 'UWB_ui_Loading_chapter_C::BG_Shadow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, BlackBand_L) == 0x000470, "Member 'UWB_ui_Loading_chapter_C::BlackBand_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, BlackBand_R) == 0x000478, "Member 'UWB_ui_Loading_chapter_C::BlackBand_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, BlackBand_Un) == 0x000480, "Member 'UWB_ui_Loading_chapter_C::BlackBand_Un' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, BlackBand_Up) == 0x000488, "Member 'UWB_ui_Loading_chapter_C::BlackBand_Up' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Eff_1) == 0x000490, "Member 'UWB_ui_Loading_chapter_C::Eff_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Eff_2) == 0x000498, "Member 'UWB_ui_Loading_chapter_C::Eff_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Font_base_1) == 0x0004A0, "Member 'UWB_ui_Loading_chapter_C::Font_base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Ghost_1) == 0x0004A8, "Member 'UWB_ui_Loading_chapter_C::Ghost_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Ghost_2) == 0x0004B0, "Member 'UWB_ui_Loading_chapter_C::Ghost_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, InvalidationBox_2) == 0x0004B8, "Member 'UWB_ui_Loading_chapter_C::InvalidationBox_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, InvalidationBox_3) == 0x0004C0, "Member 'UWB_ui_Loading_chapter_C::InvalidationBox_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, InvalidationBox_5) == 0x0004C8, "Member 'UWB_ui_Loading_chapter_C::InvalidationBox_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_1) == 0x0004D0, "Member 'UWB_ui_Loading_chapter_C::Line_chara_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_2) == 0x0004D8, "Member 'UWB_ui_Loading_chapter_C::Line_chara_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_3) == 0x0004E0, "Member 'UWB_ui_Loading_chapter_C::Line_chara_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_4) == 0x0004E8, "Member 'UWB_ui_Loading_chapter_C::Line_chara_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_1_particle) == 0x0004F0, "Member 'UWB_ui_Loading_chapter_C::Line_chara_1_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_2_particle) == 0x0004F8, "Member 'UWB_ui_Loading_chapter_C::Line_chara_2_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_3_particle) == 0x000500, "Member 'UWB_ui_Loading_chapter_C::Line_chara_3_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Line_chara_4_particle) == 0x000508, "Member 'UWB_ui_Loading_chapter_C::Line_chara_4_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Location_image) == 0x000510, "Member 'UWB_ui_Loading_chapter_C::Location_image' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_Base) == 0x000518, "Member 'UWB_ui_Loading_chapter_C::Logo_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_2) == 0x000520, "Member 'UWB_ui_Loading_chapter_C::Logo_line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_3) == 0x000528, "Member 'UWB_ui_Loading_chapter_C::Logo_line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_4) == 0x000530, "Member 'UWB_ui_Loading_chapter_C::Logo_line_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_5) == 0x000538, "Member 'UWB_ui_Loading_chapter_C::Logo_line_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_2_particle) == 0x000540, "Member 'UWB_ui_Loading_chapter_C::Logo_line_2_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_3_particle) == 0x000548, "Member 'UWB_ui_Loading_chapter_C::Logo_line_3_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_4_particle) == 0x000550, "Member 'UWB_ui_Loading_chapter_C::Logo_line_4_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Logo_line_5_particle) == 0x000558, "Member 'UWB_ui_Loading_chapter_C::Logo_line_5_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Noise_line) == 0x000560, "Member 'UWB_ui_Loading_chapter_C::Noise_line' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Noise_line_2) == 0x000568, "Member 'UWB_ui_Loading_chapter_C::Noise_line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Noise_TV) == 0x000570, "Member 'UWB_ui_Loading_chapter_C::Noise_TV' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Noise_TV_2) == 0x000578, "Member 'UWB_ui_Loading_chapter_C::Noise_TV_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Overlay_7) == 0x000580, "Member 'UWB_ui_Loading_chapter_C::Overlay_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, REDRetainerBox_Menu) == 0x000588, "Member 'UWB_ui_Loading_chapter_C::REDRetainerBox_Menu' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, REDRetainerBox_noise_1) == 0x000590, "Member 'UWB_ui_Loading_chapter_C::REDRetainerBox_noise_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, REDRetainerBox_noise_2) == 0x000598, "Member 'UWB_ui_Loading_chapter_C::REDRetainerBox_noise_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Text_chapter_info) == 0x0005A0, "Member 'UWB_ui_Loading_chapter_C::Text_chapter_info' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Text_chapter_num) == 0x0005A8, "Member 'UWB_ui_Loading_chapter_C::Text_chapter_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chapter_C, Text_chapter_title) == 0x0005B0, "Member 'UWB_ui_Loading_chapter_C::Text_chapter_title' has a wrong offset!");

}

