#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_4

#include "Basic.hpp"

#include "Enum_ui_equip_parts_4_animation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.ExecuteUbergraph_WB_ui_Equip_Parts_4
// 0x0078 (0x0078 - 0x0000)
struct WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D2[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D3[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D4[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D5[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D6[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D7[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D8[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentState_State;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31DA[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31DB[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4) == 0x000078, "Wrong size on WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, EntryPoint) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000029, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000030, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, K2Node_Event_State) == 0x000034, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, K2Node_Event_SubState) == 0x000038, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, K2Node_Event_DeltaSeconds) == 0x00003C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000040, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000044, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000048, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00004C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000050, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000051, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000054, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000058, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x00005C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000060, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_GetCurrentState_State) == 0x000064, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_GetCurrentState_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, K2Node_SwitchInteger_CmpSuccess) == 0x000068, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x000069, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x00006C, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000070, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x000074, "Member 'WB_ui_Equip_Parts_4_C_ExecuteUbergraph_WB_ui_Equip_Parts_4::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Equip_Parts_4_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_UpdateState");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Equip_Parts_4_C_UpdateState");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Equip_Parts_4_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31DC[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAnimationIndex2_Index;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31DD[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_StateNone");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_StateNone) == 0x000014, "Wrong size on WB_ui_Equip_Parts_4_C_StateNone");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, CallFunc_GetPlatformType_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_StateNone::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_4_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'WB_ui_Equip_Parts_4_C_StateNone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, CallFunc_GetAnimationIndex2_Index) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_StateNone::CallFunc_GetAnimationIndex2_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_4_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_4_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.StateLoop
// 0x002C (0x002C - 0x0000)
struct WB_ui_Equip_Parts_4_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31DE[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAnimationIndex2_Index;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31DF[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetAnimationIndex2_Index_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAnimationIndex2_Index_2;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E0[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAnimationIndex2_Index_3;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_StateLoop");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_StateLoop) == 0x00002C, "Wrong size on WB_ui_Equip_Parts_4_C_StateLoop");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_GetAnimationIndex2_Index) == 0x00000C, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_GetAnimationIndex2_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000011, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_GetAnimationIndex2_Index_1) == 0x000014, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_GetAnimationIndex2_Index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_GetAnimationIndex2_Index_2) == 0x000018, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_GetAnimationIndex2_Index_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00001C, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x00001D, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x00001E, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_GetAnimationIndex2_Index_3) == 0x000024, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_GetAnimationIndex2_Index_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000028, "Member 'WB_ui_Equip_Parts_4_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetSelect");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetSelect) == 0x000001, "Wrong size on WB_ui_Equip_Parts_4_C_SetSelect");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetElement
// 0x0100 (0x0100 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetElement final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Num;                                               // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IconIndex;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemRarity                                   Rarity;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkin;                                            // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E1[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_2;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemData*                              CallFunc_GetItemData_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemDataCell                          CallFunc_GetData_ItemData;                         // 0x0058(0x0080)()
	bool                                          CallFunc_GetData_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31E2[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetElement) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetElement");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetElement) == 0x000100, "Wrong size on WB_ui_Equip_Parts_4_C_SetElement");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, Param_Name) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetElement::Param_Name' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, Num) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_SetElement::Num' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, IconIndex) == 0x00000C, "Member 'WB_ui_Equip_Parts_4_C_SetElement::IconIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, Rarity) == 0x000010, "Member 'WB_ui_Equip_Parts_4_C_SetElement::Rarity' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, IsSkin) == 0x000011, "Member 'WB_ui_Equip_Parts_4_C_SetElement::IsSkin' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_NotEqual_NameName_ReturnValue) == 0x000012, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetDataBaseManager_Manager) == 0x000018, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetDataBaseManager_Manager_1) == 0x000020, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetDataBaseManager_Manager_2) == 0x000048, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetDataBaseManager_Manager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetItemData_ReturnValue) == 0x000050, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetData_ItemData) == 0x000058, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetData_ItemData' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetData_ReturnValue) == 0x0000D8, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_GetText_ReturnValue_1) == 0x0000E0, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetElement, CallFunc_Conv_IntToString_ReturnValue) == 0x0000F0, "Member 'WB_ui_Equip_Parts_4_C_SetElement::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetNewFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetNewFlag final
{
public:
	bool                                          NewFlag;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetNewFlag) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetNewFlag");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetNewFlag) == 0x000001, "Wrong size on WB_ui_Equip_Parts_4_C_SetNewFlag");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetNewFlag, NewFlag) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetNewFlag::NewFlag' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetEquipFlag
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetEquipFlag final
{
public:
	bool                                          EquipFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseSkinFlag;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetEquipFlag) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetEquipFlag");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetEquipFlag) == 0x000002, "Wrong size on WB_ui_Equip_Parts_4_C_SetEquipFlag");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetEquipFlag, EquipFlag) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetEquipFlag::EquipFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetEquipFlag, UseSkinFlag) == 0x000001, "Member 'WB_ui_Equip_Parts_4_C_SetEquipFlag::UseSkinFlag' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetRarity
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetRarity final
{
public:
	EItemRarity                                   Rarity;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E3[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _index;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetRarity) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetRarity");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetRarity) == 0x000020, "Wrong size on WB_ui_Equip_Parts_4_C_SetRarity");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetRarity, Rarity) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetRarity::Rarity' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetRarity, _index) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_SetRarity::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetRarity, CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_SetRarity::CallFunc_UI_GetArrayColor_Shop_Frame_1_UI_ColorArray_Shop_Frame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetRarity, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_4_C_SetRarity::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.CheckMouse
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Equip_Parts_4_C_CheckMouse final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E4[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAnimationIndex2_Index;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAnimationIndex2_Index_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_CheckMouse) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_CheckMouse");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_CheckMouse) == 0x000014, "Wrong size on WB_ui_Equip_Parts_4_C_CheckMouse");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000001, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_GetAnimationIndex2_Index) == 0x00000C, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_GetAnimationIndex2_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_CheckMouse, CallFunc_GetAnimationIndex2_Index_1) == 0x000010, "Member 'WB_ui_Equip_Parts_4_C_CheckMouse::CallFunc_GetAnimationIndex2_Index_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetFirstFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetFirstFlag final
{
public:
	bool                                          Param_IsFirst;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetFirstFlag) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetFirstFlag");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetFirstFlag) == 0x000001, "Wrong size on WB_ui_Equip_Parts_4_C_SetFirstFlag");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetFirstFlag, Param_IsFirst) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetFirstFlag::Param_IsFirst' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.SetEnableFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_4_C_SetEnableFlag final
{
public:
	bool                                          Param_IsEnable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_SetEnableFlag) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_4_C_SetEnableFlag");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_SetEnableFlag) == 0x000001, "Wrong size on WB_ui_Equip_Parts_4_C_SetEnableFlag");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_SetEnableFlag, Param_IsEnable) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_SetEnableFlag::Param_IsEnable' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.DoOnceInitializeAnimation
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation final
{
public:
	int32                                         CallFunc_GetAnimationIndex2_Index;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation) == 0x000004, "Wrong size on WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation, CallFunc_GetAnimationIndex2_Index) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_DoOnceInitializeAnimation::CallFunc_GetAnimationIndex2_Index' has a wrong offset!");

// Function WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C.GetAnimationIndex2
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Equip_Parts_4_C_GetAnimationIndex2 final
{
public:
	Enum_ui_equip_parts_4_animation               Animation;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E5[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _Work;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31E6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_equip_parts_4_animation>       _AnimList;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<Enum_ui_equip_parts_4_animation>       K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_4_C_GetAnimationIndex2) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_4_C_GetAnimationIndex2");
static_assert(sizeof(WB_ui_Equip_Parts_4_C_GetAnimationIndex2) == 0x000040, "Wrong size on WB_ui_Equip_Parts_4_C_GetAnimationIndex2");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_GetAnimationIndex2, Animation) == 0x000000, "Member 'WB_ui_Equip_Parts_4_C_GetAnimationIndex2::Animation' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_GetAnimationIndex2, Param_Index) == 0x000004, "Member 'WB_ui_Equip_Parts_4_C_GetAnimationIndex2::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_4_C_GetAnimationIndex2, _Work) == 0x000008, "Member 'WB_ui_Equip_Parts_4_C_GetAnimationIndex2::_Work' has a wrong offset!");
