#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Target_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Target_1.WB_ui_Target_1_C
// 0x0068 (0x0440 - 0x03D8)
class UWB_ui_Target_1_C final : public UUITarget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_2;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Ghost_frame;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost_size;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_add;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_add;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlagChange;                                        // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Target_1(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Target_1_C">();
	}
	static class UWB_ui_Target_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Target_1_C>();
	}
};
static_assert(alignof(UWB_ui_Target_1_C) == 0x000008, "Wrong alignment on UWB_ui_Target_1_C");
static_assert(sizeof(UWB_ui_Target_1_C) == 0x000440, "Wrong size on UWB_ui_Target_1_C");
static_assert(offsetof(UWB_ui_Target_1_C, UberGraphFrame) == 0x0003D8, "Member 'UWB_ui_Target_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Out_2) == 0x0003E0, "Member 'UWB_ui_Target_1_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Change) == 0x0003E8, "Member 'UWB_ui_Target_1_C::Change' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Out) == 0x0003F0, "Member 'UWB_ui_Target_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Default_none) == 0x0003F8, "Member 'UWB_ui_Target_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Default) == 0x000400, "Member 'UWB_ui_Target_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, In) == 0x000408, "Member 'UWB_ui_Target_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Ghost_frame) == 0x000410, "Member 'UWB_ui_Target_1_C::Ghost_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Ghost_size) == 0x000418, "Member 'UWB_ui_Target_1_C::Ghost_size' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, Line_add) == 0x000420, "Member 'UWB_ui_Target_1_C::Line_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, SizeBox_0) == 0x000428, "Member 'UWB_ui_Target_1_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, SizeBox_add) == 0x000430, "Member 'UWB_ui_Target_1_C::SizeBox_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Target_1_C, FlagChange) == 0x000438, "Member 'UWB_ui_Target_1_C::FlagChange' has a wrong offset!");

}

