#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Resurrection_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Resurrection_1.WB_ui_Resurrection_1_C
// 0x0080 (0x04A0 - 0x0420)
class UWB_ui_Resurrection_1_C final : public UUIResurrectionGauge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_2;                                             // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_out;                                        // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0450(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Guage_Bar;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_1;                                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_98;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Resurrection_1;                               // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Resurrection_1(int32 EntryPoint);
	void SetGauge(float Guage);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Resurrection_1_C">();
	}
	static class UWB_ui_Resurrection_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Resurrection_1_C>();
	}
};
static_assert(alignof(UWB_ui_Resurrection_1_C) == 0x000008, "Wrong alignment on UWB_ui_Resurrection_1_C");
static_assert(sizeof(UWB_ui_Resurrection_1_C) == 0x0004A0, "Wrong size on UWB_ui_Resurrection_1_C");
static_assert(offsetof(UWB_ui_Resurrection_1_C, UberGraphFrame) == 0x000420, "Member 'UWB_ui_Resurrection_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Out_2) == 0x000428, "Member 'UWB_ui_Resurrection_1_C::Out_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, In_2) == 0x000430, "Member 'UWB_ui_Resurrection_1_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Decision) == 0x000438, "Member 'UWB_ui_Resurrection_1_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Select_out) == 0x000440, "Member 'UWB_ui_Resurrection_1_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Select_in) == 0x000448, "Member 'UWB_ui_Resurrection_1_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Select) == 0x000450, "Member 'UWB_ui_Resurrection_1_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Out) == 0x000458, "Member 'UWB_ui_Resurrection_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, In) == 0x000460, "Member 'UWB_ui_Resurrection_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Default_none) == 0x000468, "Member 'UWB_ui_Resurrection_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Default) == 0x000470, "Member 'UWB_ui_Resurrection_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Guage_Bar) == 0x000478, "Member 'UWB_ui_Resurrection_1_C::Guage_Bar' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Icon_1) == 0x000480, "Member 'UWB_ui_Resurrection_1_C::Icon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Icon_font) == 0x000488, "Member 'UWB_ui_Resurrection_1_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Spacer_98) == 0x000490, "Member 'UWB_ui_Resurrection_1_C::Spacer_98' has a wrong offset!");
static_assert(offsetof(UWB_ui_Resurrection_1_C, Text_Resurrection_1) == 0x000498, "Member 'UWB_ui_Resurrection_1_C::Text_Resurrection_1' has a wrong offset!");

}

