#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_action_icon_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_2_C
// 0x0028 (0x03B0 - 0x0388)
class UWB_ui_PK_action_icon_2_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Rush_eff01;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rush_eff02;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDecidion;                                        // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_PK_action_icon_2(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateDecision(int32 SubState);
	void StartDecision();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_PK_action_icon_2_C">();
	}
	static class UWB_ui_PK_action_icon_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_PK_action_icon_2_C>();
	}
};
static_assert(alignof(UWB_ui_PK_action_icon_2_C) == 0x000008, "Wrong alignment on UWB_ui_PK_action_icon_2_C");
static_assert(sizeof(UWB_ui_PK_action_icon_2_C) == 0x0003B0, "Wrong size on UWB_ui_PK_action_icon_2_C");
static_assert(offsetof(UWB_ui_PK_action_icon_2_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_PK_action_icon_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_action_icon_2_C, Decision) == 0x000390, "Member 'UWB_ui_PK_action_icon_2_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_action_icon_2_C, Rush_eff01) == 0x000398, "Member 'UWB_ui_PK_action_icon_2_C::Rush_eff01' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_action_icon_2_C, Rush_eff02) == 0x0003A0, "Member 'UWB_ui_PK_action_icon_2_C::Rush_eff02' has a wrong offset!");
static_assert(offsetof(UWB_ui_PK_action_icon_2_C, IsDecidion) == 0x0003A8, "Member 'UWB_ui_PK_action_icon_2_C::IsDecidion' has a wrong offset!");

}

