#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMes_Parts_3

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.ExecuteUbergraph_WB_ui_BrainMes_Parts_3
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C1[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C2[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C3[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C4[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C5[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C6[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3) == 0x000050, "Wrong size on WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, EntryPoint) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000018, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, K2Node_Event_State) == 0x000024, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, K2Node_Event_SubState) == 0x000028, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, K2Node_Event_DeltaSeconds) == 0x00002C, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000031, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000040, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000044, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000048, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00004C, "Member 'WB_ui_BrainMes_Parts_3_C_ExecuteUbergraph_WB_ui_BrainMes_Parts_3::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_UpdateState");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_BrainMes_Parts_3_C_UpdateState");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_UpdateState, State) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C7[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_StateNone");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_StateNone) == 0x000010, "Wrong size on WB_ui_BrainMes_Parts_3_C_StateNone");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.StateOpen
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C8[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_StateOpen");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_StateOpen) == 0x00000C, "Wrong size on WB_ui_BrainMes_Parts_3_C_StateOpen");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.StateLoop
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C9[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CA[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_StateLoop");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_StateLoop) == 0x000018, "Wrong size on WB_ui_BrainMes_Parts_3_C_StateLoop");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.StateClose
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CB[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_StateClose");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_StateClose) == 0x00000C, "Wrong size on WB_ui_BrainMes_Parts_3_C_StateClose");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_SetSelect");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_SetSelect) == 0x000001, "Wrong size on WB_ui_BrainMes_Parts_3_C_SetSelect");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.StateLoopSelect
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_StateLoopSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CC[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CD[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CE[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CF[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect) == 0x000004, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_StateLoopSelect");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect) == 0x000030, "Wrong size on WB_ui_BrainMes_Parts_3_C_StateLoopSelect");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, SubState) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001A, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000024, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x00002C, "Member 'WB_ui_BrainMes_Parts_3_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");

// Function WB_ui_BrainMes_Parts_3.WB_ui_BrainMes_Parts_3_C.SetDefaultMessage
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_BrainMes_Parts_3_C_SetDefaultMessage final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WB_ui_BrainMes_Parts_3_C_SetDefaultMessage) == 0x000008, "Wrong alignment on WB_ui_BrainMes_Parts_3_C_SetDefaultMessage");
static_assert(sizeof(WB_ui_BrainMes_Parts_3_C_SetDefaultMessage) == 0x000030, "Wrong size on WB_ui_BrainMes_Parts_3_C_SetDefaultMessage");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_SetDefaultMessage, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_BrainMes_Parts_3_C_SetDefaultMessage::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_SetDefaultMessage, CallFunc_GetText_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMes_Parts_3_C_SetDefaultMessage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMes_Parts_3_C_SetDefaultMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WB_ui_BrainMes_Parts_3_C_SetDefaultMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

