#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_gauge_en

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.ExecuteUbergraph_WB_ui_Brain_gauge_en
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CB[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CC[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en) == 0x000030, "Wrong size on WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, EntryPoint) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, K2Node_Event_State) == 0x00000C, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, K2Node_Event_SubState) == 0x000010, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, K2Node_SwitchInteger_CmpSuccess) == 0x000018, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000019, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001A, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000024, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000025, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000028, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Brain_gauge_en_C_ExecuteUbergraph_WB_ui_Brain_gauge_en::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_gauge_en_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge_en_C_UpdateState");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Brain_gauge_en_C_UpdateState");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Brain_gauge_en_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_gauge_en_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CD[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge_en_C_StateNone");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_StateNone) == 0x00000C, "Wrong size on WB_ui_Brain_gauge_en_C_StateNone");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Brain_gauge_en_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Brain_gauge_en_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.StateLoopNormal
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Brain_gauge_en_C_StateLoopNormal final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CE[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_StateLoopNormal) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge_en_C_StateLoopNormal");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_StateLoopNormal) == 0x000010, "Wrong size on WB_ui_Brain_gauge_en_C_StateLoopNormal");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, SubState) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopNormal, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_gauge_en_C_StateLoopNormal::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.StateLoopUsing
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Brain_gauge_en_C_StateLoopUsing final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59CF[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D0[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D1[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D2[0x1];                                     // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_StateLoopUsing) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge_en_C_StateLoopUsing");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_StateLoopUsing) == 0x000028, "Wrong size on WB_ui_Brain_gauge_en_C_StateLoopUsing");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, SubState) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000011, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000018, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000019, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000020, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_StateLoopUsing, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_Brain_gauge_en_C_StateLoopUsing::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_Brain_gauge_en.WB_ui_Brain_gauge_en_C.UpdateGaugePercent
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Brain_gauge_en_C_UpdateGaugePercent final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D3[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge_en_C_UpdateGaugePercent) == 0x000008, "Wrong alignment on WB_ui_Brain_gauge_en_C_UpdateGaugePercent");
static_assert(sizeof(WB_ui_Brain_gauge_en_C_UpdateGaugePercent) == 0x000018, "Wrong size on WB_ui_Brain_gauge_en_C_UpdateGaugePercent");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateGaugePercent, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'WB_ui_Brain_gauge_en_C_UpdateGaugePercent::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateGaugePercent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge_en_C_UpdateGaugePercent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge_en_C_UpdateGaugePercent, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_gauge_en_C_UpdateGaugePercent::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

}

