#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TutoTips_Parts_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.ExecuteUbergraph_WB_ui_TutoTips_Parts_1
// 0x00C8 (0x00C8 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4066[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoMode_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4067[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4068[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4069[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_2;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_3;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue_1;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406A[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_4;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue_2;       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406B[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406C[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_5;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_6;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_IsPlaying_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406D[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_7;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_8;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue_3;       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue_4;       // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406E[0x6];                                     // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_9;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase_1;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoMode_ReturnValue_1;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_406F[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase_2;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoMode_ReturnValue_2;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1) == 0x0000C8, "Wrong size on WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetHUDBase_HUDBase) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetHUDBase_HUDBase' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_IsPhotoMode_ReturnValue) == 0x000010, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_IsPhotoMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000018, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_IsPlaying_IsPlaying) == 0x000021, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_IsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_1) == 0x000028, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_SetIndividualSetting_ReturnValue) == 0x000030, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_SetIndividualSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_2) == 0x000038, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_3) == 0x000040, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_3' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_SetIndividualSetting_ReturnValue_1) == 0x000048, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_SetIndividualSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_4) == 0x000050, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_4' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_SetIndividualSetting_ReturnValue_2) == 0x000058, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_SetIndividualSetting_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, K2Node_Event_State) == 0x00005C, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, K2Node_Event_SubState) == 0x000060, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, K2Node_Event_DeltaSeconds) == 0x000064, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000068, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_5) == 0x000070, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_5' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_6) == 0x000078, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_6' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_IsPlaying_IsPlaying_1) == 0x000080, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_IsPlaying_IsPlaying_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_7) == 0x000088, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_7' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_8) == 0x000090, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_8' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_SetIndividualSetting_ReturnValue_3) == 0x000098, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_SetIndividualSetting_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_SetIndividualSetting_ReturnValue_4) == 0x000099, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_SetIndividualSetting_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetMovieManager_AsBP_Movie_Manager_9) == 0x0000A0, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetMovieManager_AsBP_Movie_Manager_9' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetHUDBase_HUDBase_1) == 0x0000A8, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetHUDBase_HUDBase_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_IsPhotoMode_ReturnValue_1) == 0x0000B0, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_IsPhotoMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_GetHUDBase_HUDBase_2) == 0x0000B8, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_GetHUDBase_HUDBase_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1, CallFunc_IsPhotoMode_ReturnValue_2) == 0x0000C0, "Member 'WB_ui_TutoTips_Parts_1_C_ExecuteUbergraph_WB_ui_TutoTips_Parts_1::CallFunc_IsPhotoMode_ReturnValue_2' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_TutoTips_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_TutoTips_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.isMovieStop
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_IsMovieStop final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4070[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isMovieStop_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isStop_isStop;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_IsMovieStop) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_IsMovieStop");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_IsMovieStop) == 0x000018, "Wrong size on WB_ui_TutoTips_Parts_1_C_IsMovieStop");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsMovieStop, ReturnValue) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_IsMovieStop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsMovieStop, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_IsMovieStop::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsMovieStop, CallFunc_isMovieStop_ReturnValue) == 0x000010, "Member 'WB_ui_TutoTips_Parts_1_C_IsMovieStop::CallFunc_isMovieStop_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsMovieStop, CallFunc_isStop_isStop) == 0x000011, "Member 'WB_ui_TutoTips_Parts_1_C_IsMovieStop::CallFunc_isStop_isStop' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.StateMovie
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_StateMovie final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4071[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4072[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReady_IsReady;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4073[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_2;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMoviePrepareSetting_ReturnValue;       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LoadMovieTexture_ReturnValue;             // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isStop_isStop;                            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4074[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager_3;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_StateMovie) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_StateMovie");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_StateMovie) == 0x000050, "Wrong size on WB_ui_TutoTips_Parts_1_C_StateMovie");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, SubState) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_Concat_StrStr_ReturnValue) == 0x000010, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_SetIndividualSetting_ReturnValue) == 0x000020, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_SetIndividualSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager_1) == 0x000028, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_IsReady_IsReady) == 0x000030, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_IsReady_IsReady' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager_2) == 0x000038, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager_2' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_SetMoviePrepareSetting_ReturnValue) == 0x000040, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_SetMoviePrepareSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_LoadMovieTexture_ReturnValue) == 0x000041, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_LoadMovieTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_isStop_isStop) == 0x000042, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_isStop_isStop' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StateMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager_3) == 0x000048, "Member 'WB_ui_TutoTips_Parts_1_C_StateMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager_3' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.StatePicture
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_StatePicture final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4075[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_LoadTipsTexture_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_StatePicture) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_StatePicture");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_StatePicture) == 0x000028, "Wrong size on WB_ui_TutoTips_Parts_1_C_StatePicture");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StatePicture, SubState) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_StatePicture::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StatePicture, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_TutoTips_Parts_1_C_StatePicture::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StatePicture, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_StatePicture::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StatePicture, CallFunc_LoadTipsTexture_ReturnValue) == 0x000018, "Member 'WB_ui_TutoTips_Parts_1_C_StatePicture::CallFunc_LoadTipsTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_StatePicture, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WB_ui_TutoTips_Parts_1_C_StatePicture::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.initializeMovie
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_InitializeMovie final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4076[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPhotoMode_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMovieImageTexture_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetIndividualSetting_ReturnValue;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_initializeMovie_ReturnValue;              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_InitializeMovie) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_InitializeMovie");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_InitializeMovie) == 0x000020, "Wrong size on WB_ui_TutoTips_Parts_1_C_InitializeMovie");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, ReturnValue) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_GetHUDBase_HUDBase) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_GetHUDBase_HUDBase' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000010, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_IsPhotoMode_ReturnValue) == 0x000018, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_IsPhotoMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_SetMovieImageTexture_ReturnValue) == 0x000019, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_SetMovieImageTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_SetIndividualSetting_ReturnValue) == 0x00001A, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_SetIndividualSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_InitializeMovie, CallFunc_initializeMovie_ReturnValue) == 0x00001B, "Member 'WB_ui_TutoTips_Parts_1_C_InitializeMovie::CallFunc_initializeMovie_ReturnValue' has a wrong offset!");

// Function WB_ui_TutoTips_Parts_1.WB_ui_TutoTips_Parts_1_C.isPlayMovie
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_TutoTips_Parts_1_C_IsPlayMovie final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4077[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     CallFunc_GetMovieManager_AsBP_Movie_Manager;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPlayMovie_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_TutoTips_Parts_1_C_IsPlayMovie) == 0x000008, "Wrong alignment on WB_ui_TutoTips_Parts_1_C_IsPlayMovie");
static_assert(sizeof(WB_ui_TutoTips_Parts_1_C_IsPlayMovie) == 0x000018, "Wrong size on WB_ui_TutoTips_Parts_1_C_IsPlayMovie");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsPlayMovie, ReturnValue) == 0x000000, "Member 'WB_ui_TutoTips_Parts_1_C_IsPlayMovie::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsPlayMovie, CallFunc_GetMovieManager_AsBP_Movie_Manager) == 0x000008, "Member 'WB_ui_TutoTips_Parts_1_C_IsPlayMovie::CallFunc_GetMovieManager_AsBP_Movie_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_TutoTips_Parts_1_C_IsPlayMovie, CallFunc_isPlayMovie_ReturnValue) == 0x000010, "Member 'WB_ui_TutoTips_Parts_1_C_IsPlayMovie::CallFunc_isPlayMovie_ReturnValue' has a wrong offset!");
