#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Start_Logo_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Start_Logo_1.WB_ui_Start_Logo_1_C
// 0x0040 (0x0420 - 0x03E0)
class UWB_ui_Start_Logo_1_C final : public UUIScarletLogo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_title;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_title;                                     // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_title;                                          // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Logo_1;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Start_Logo_1(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Start_Logo_1_C">();
	}
	static class UWB_ui_Start_Logo_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Start_Logo_1_C>();
	}
};
static_assert(alignof(UWB_ui_Start_Logo_1_C) == 0x000008, "Wrong alignment on UWB_ui_Start_Logo_1_C");
static_assert(sizeof(UWB_ui_Start_Logo_1_C) == 0x000420, "Wrong size on UWB_ui_Start_Logo_1_C");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, UberGraphFrame) == 0x0003E0, "Member 'UWB_ui_Start_Logo_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, Out_title) == 0x0003E8, "Member 'UWB_ui_Start_Logo_1_C::Out_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, Default_title) == 0x0003F0, "Member 'UWB_ui_Start_Logo_1_C::Default_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, In_title) == 0x0003F8, "Member 'UWB_ui_Start_Logo_1_C::In_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, Out) == 0x000400, "Member 'UWB_ui_Start_Logo_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, Default) == 0x000408, "Member 'UWB_ui_Start_Logo_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, In) == 0x000410, "Member 'UWB_ui_Start_Logo_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Start_Logo_1_C, Logo_1) == 0x000418, "Member 'UWB_ui_Start_Logo_1_C::Logo_1' has a wrong offset!");

}

