#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.ExecuteUbergraph_WB_ui_Equip_Parts_1
// 0x0094 (0x0094 - 0x0000)
struct WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5924[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5925[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5926[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5927[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5928[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5929[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592A[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592B[0x2];                                     // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592C[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592D[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592E[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_16;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_17;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_18;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_592F[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_18;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_19;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5930[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_19;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1) == 0x000094, "Wrong size on WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000029, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000030, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000034, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000035, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000038, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00003C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000040, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000041, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000044, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000048, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, K2Node_Event_State) == 0x00004C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, K2Node_Event_SubState) == 0x000050, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x000058, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x00005C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000060, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x000061, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x000064, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000068, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x00006C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_15) == 0x000070, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_15) == 0x000074, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_16) == 0x000078, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_17) == 0x000079, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_16) == 0x00007C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_17) == 0x000080, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_18) == 0x000084, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_18) == 0x000088, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_19) == 0x00008C, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_19) == 0x000090, "Member 'WB_ui_Equip_Parts_1_C_ExecuteUbergraph_WB_ui_Equip_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_19' has a wrong offset!");

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Equip_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Equip_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.StateNone
// 0x0024 (0x0024 - 0x0000)
struct WB_ui_Equip_Parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5931[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5932[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5933[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_StateNone");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_StateNone) == 0x000024, "Wrong size on WB_ui_Equip_Parts_1_C_StateNone");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_BooleanAND_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000011, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000012, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001D, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Equip_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.StateLoop
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_Equip_Parts_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5934[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5935[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5936[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5937[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5938[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5939[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593A[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_StateLoop");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_StateLoop) == 0x000040, "Wrong size on WB_ui_Equip_Parts_1_C_StateLoop");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000010, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000019, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000020, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000029, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x000030, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000031, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_Equip_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.StateLoopSelect
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_Equip_Parts_1_C_StateLoopSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593C[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593D[0x1];                                     // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593E[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_StateLoopSelect) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_StateLoopSelect");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_StateLoopSelect) == 0x000030, "Wrong size on WB_ui_Equip_Parts_1_C_StateLoopSelect");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001A, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000024, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x00002C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_1.WB_ui_Equip_Parts_1_C.StateLoopLock
// 0x0058 (0x0058 - 0x0000)
struct WB_ui_Equip_Parts_1_C_StateLoopLock final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593F[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5940[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5941[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5942[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5943[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5944[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5945[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_2;        // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5946[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_3;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5947[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_1_C_StateLoopLock) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_1_C_StateLoopLock");
static_assert(sizeof(WB_ui_Equip_Parts_1_C_StateLoopLock) == 0x000058, "Wrong size on WB_ui_Equip_Parts_1_C_StateLoopLock");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, _WorkSubState) == 0x000004, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000010, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000011, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000018, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000020, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000024, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000025, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000028, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000034, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, K2Node_SwitchInteger_CmpSuccess) == 0x000035, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000038, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_1_C_StateLoopLock, CallFunc_BooleanAND_ReturnValue) == 0x00003C, "Member 'WB_ui_Equip_Parts_1_C_StateLoopLock::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
