#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_WorldMap_Window_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_WorldMap_Window_1.WB_ui_WorldMap_Window_1_C
// 0x0070 (0x03F8 - 0x0388)
class UWB_ui_WorldMap_Window_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_pattern;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_6;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Map_Info_set;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_worldmap_mapinfo_1;                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsInitializeString;                                // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_WorldMap_Window_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetMessage(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_WorldMap_Window_1_C">();
	}
	static class UWB_ui_WorldMap_Window_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_WorldMap_Window_1_C>();
	}
};
static_assert(alignof(UWB_ui_WorldMap_Window_1_C) == 0x000008, "Wrong alignment on UWB_ui_WorldMap_Window_1_C");
static_assert(sizeof(UWB_ui_WorldMap_Window_1_C) == 0x0003F8, "Wrong size on UWB_ui_WorldMap_Window_1_C");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_WorldMap_Window_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Out) == 0x000390, "Member 'UWB_ui_WorldMap_Window_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, In) == 0x000398, "Member 'UWB_ui_WorldMap_Window_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Default_none) == 0x0003A0, "Member 'UWB_ui_WorldMap_Window_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Default) == 0x0003A8, "Member 'UWB_ui_WorldMap_Window_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, All_Set) == 0x0003B0, "Member 'UWB_ui_WorldMap_Window_1_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Base_1) == 0x0003B8, "Member 'UWB_ui_WorldMap_Window_1_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Frame_1) == 0x0003C0, "Member 'UWB_ui_WorldMap_Window_1_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Frame_pattern) == 0x0003C8, "Member 'UWB_ui_WorldMap_Window_1_C::Frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, InvalidationBox_6) == 0x0003D0, "Member 'UWB_ui_WorldMap_Window_1_C::InvalidationBox_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Map_Info_set) == 0x0003D8, "Member 'UWB_ui_WorldMap_Window_1_C::Map_Info_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Noise) == 0x0003E0, "Member 'UWB_ui_WorldMap_Window_1_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, Text_worldmap_mapinfo_1) == 0x0003E8, "Member 'UWB_ui_WorldMap_Window_1_C::Text_worldmap_mapinfo_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_WorldMap_Window_1_C, IsInitializeString) == 0x0003F0, "Member 'UWB_ui_WorldMap_Window_1_C::IsInitializeString' has a wrong offset!");

}

