#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_skill_parts_1

#include "Basic.hpp"

#include "E_SASKind_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.ExecuteUbergraph_WB_ui_SasLink_skill_parts_1
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1) == 0x000014, "Wrong size on WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_SasLink_skill_parts_1_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_SasLink_skill_parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_StateNone");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_StateNone) == 0x000008, "Wrong size on WB_ui_SasLink_skill_parts_1_C_StateNone");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.StateLoop
// 0x000C (0x000C - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_StateLoop");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_StateLoop) == 0x00000C, "Wrong size on WB_ui_SasLink_skill_parts_1_C_StateLoop");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_1_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000009, "Member 'WB_ui_SasLink_skill_parts_1_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.SetUnSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_SetUnSelect final
{
public:
	bool                                          IsUnSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_SetUnSelect) == 0x000001, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_SetUnSelect");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_SetUnSelect) == 0x000001, "Wrong size on WB_ui_SasLink_skill_parts_1_C_SetUnSelect");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_SetUnSelect, IsUnSelect) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_SetUnSelect::IsUnSelect' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_1.WB_ui_SasLink_skill_parts_1_C.SetChara
// 0x02A8 (0x02A8 - 0x0000)
struct WB_ui_SasLink_skill_parts_1_C_SetChara final
{
public:
	E_SASKind                                     SkillID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_573C[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LV;                                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKasane;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableDLC1;                                      // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableDLC2;                                      // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573D[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         _DLCTagList;                                       // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 _BaseSkillID;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           _SaslLeveList;                                     // 0x0030(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UDatabaseManager*                       _Manager;                                          // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 _SasIndexList;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573E[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573F[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array_2;                          // 0x00B0(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5740[0x1];                                     // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0138(0x0018)()
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5741[0x7];                                     // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0170(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_3;                    // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0198(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_4;                    // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x01C0(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_5;                    // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x01F0(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5742[0x4];                                     // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0210(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0238(0x0018)()
	class FString                                 CallFunc_GetText_ReturnValue_6;                    // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0270(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0298(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_1_C_SetChara) == 0x000008, "Wrong alignment on WB_ui_SasLink_skill_parts_1_C_SetChara");
static_assert(sizeof(WB_ui_SasLink_skill_parts_1_C_SetChara) == 0x0002A8, "Wrong size on WB_ui_SasLink_skill_parts_1_C_SetChara");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_SetChara, SkillID) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_1_C_SetChara::SkillID' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_SetChara, LV) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_1_C_SetChara::LV' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_SetChara, IsKasane) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_1_C_SetChara::IsKasane' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_1_C_SetChara, IsEnableDLC1) == 0x000009, "Member 'WB_ui_SasLink_skill_parts_1_C_SetChara::IsEnableDLC1' has a wrong offset!");
