#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MainContents_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C
// 0x0088 (0x0410 - 0x0388)
class UWB_ui_MainContents_Parts_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unselect;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_out;                                        // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_2_select;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Neon_1;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1_select;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Neon_1;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Neon_1_add;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Neon_2_add;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_main_category_1;                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          SelectFlag;                                        // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SelectFlagNext;                                    // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UnSelectFlag;                                      // 0x040A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_MainContents_Parts_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetSelect(bool IsSelect);
	void SetTabIndex(int32 Param_Index, bool IsUnlock);
	void SetUnSelect(bool IsUnSelect);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MainContents_Parts_1_C">();
	}
	static class UWB_ui_MainContents_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MainContents_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_MainContents_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_MainContents_Parts_1_C");
static_assert(sizeof(UWB_ui_MainContents_Parts_1_C) == 0x000410, "Wrong size on UWB_ui_MainContents_Parts_1_C");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_MainContents_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Unselect) == 0x000390, "Member 'UWB_ui_MainContents_Parts_1_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Decision) == 0x000398, "Member 'UWB_ui_MainContents_Parts_1_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Select_out) == 0x0003A0, "Member 'UWB_ui_MainContents_Parts_1_C::Select_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Select_in) == 0x0003A8, "Member 'UWB_ui_MainContents_Parts_1_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Select) == 0x0003B0, "Member 'UWB_ui_MainContents_Parts_1_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Default_none) == 0x0003B8, "Member 'UWB_ui_MainContents_Parts_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Default) == 0x0003C0, "Member 'UWB_ui_MainContents_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Base_2_select) == 0x0003C8, "Member 'UWB_ui_MainContents_Parts_1_C::Base_2_select' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Base_Neon_1) == 0x0003D0, "Member 'UWB_ui_MainContents_Parts_1_C::Base_Neon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Frame_1) == 0x0003D8, "Member 'UWB_ui_MainContents_Parts_1_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Frame_1_select) == 0x0003E0, "Member 'UWB_ui_MainContents_Parts_1_C::Frame_1_select' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Neon_1) == 0x0003E8, "Member 'UWB_ui_MainContents_Parts_1_C::Neon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Neon_1_add) == 0x0003F0, "Member 'UWB_ui_MainContents_Parts_1_C::Neon_1_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Neon_2_add) == 0x0003F8, "Member 'UWB_ui_MainContents_Parts_1_C::Neon_2_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, Text_main_category_1) == 0x000400, "Member 'UWB_ui_MainContents_Parts_1_C::Text_main_category_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, SelectFlag) == 0x000408, "Member 'UWB_ui_MainContents_Parts_1_C::SelectFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, SelectFlagNext) == 0x000409, "Member 'UWB_ui_MainContents_Parts_1_C::SelectFlagNext' has a wrong offset!");
static_assert(offsetof(UWB_ui_MainContents_Parts_1_C, UnSelectFlag) == 0x00040A, "Member 'UWB_ui_MainContents_Parts_1_C::UnSelectFlag' has a wrong offset!");

}

