#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_frame_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Sas_frame_01.WB_ui_Sas_frame_01_C
// 0x0098 (0x0510 - 0x0478)
class UWB_ui_Sas_frame_01_C final : public UUISASFrame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change_2;                                          // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_1;                                          // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gauge_full_out;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gauge_useing;                                      // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gauge_full_in;                                     // 0x04A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Decision;                                          // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gauge_full;                                        // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base_eff;                                          // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_01;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_01_add;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_gauge_use;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_gauge_use_add;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Sas_set;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Sas_frame_02_C*                  ObjFrame;                                          // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ObjNone;                                           // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Sas_frame_01(int32 EntryPoint);
	void SetSasGaugeR(class UImage* Image, int32 Param_Index);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

	bool CheckCombinationVisionCost(E_SASKindNative Sas) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Sas_frame_01_C">();
	}
	static class UWB_ui_Sas_frame_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Sas_frame_01_C>();
	}
};
static_assert(alignof(UWB_ui_Sas_frame_01_C) == 0x000008, "Wrong alignment on UWB_ui_Sas_frame_01_C");
static_assert(sizeof(UWB_ui_Sas_frame_01_C) == 0x000510, "Wrong size on UWB_ui_Sas_frame_01_C");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, UberGraphFrame) == 0x000478, "Member 'UWB_ui_Sas_frame_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Change_2) == 0x000480, "Member 'UWB_ui_Sas_frame_01_C::Change_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Change_1) == 0x000488, "Member 'UWB_ui_Sas_frame_01_C::Change_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Default_2) == 0x000490, "Member 'UWB_ui_Sas_frame_01_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Gauge_full_out) == 0x000498, "Member 'UWB_ui_Sas_frame_01_C::Gauge_full_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Gauge_useing) == 0x0004A0, "Member 'UWB_ui_Sas_frame_01_C::Gauge_useing' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Gauge_full_in) == 0x0004A8, "Member 'UWB_ui_Sas_frame_01_C::Gauge_full_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Default_none) == 0x0004B0, "Member 'UWB_ui_Sas_frame_01_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Decision) == 0x0004B8, "Member 'UWB_ui_Sas_frame_01_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Gauge_full) == 0x0004C0, "Member 'UWB_ui_Sas_frame_01_C::Gauge_full' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Default) == 0x0004C8, "Member 'UWB_ui_Sas_frame_01_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, base_eff) == 0x0004D0, "Member 'UWB_ui_Sas_frame_01_C::base_eff' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Icon_01) == 0x0004D8, "Member 'UWB_ui_Sas_frame_01_C::Icon_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Icon_01_add) == 0x0004E0, "Member 'UWB_ui_Sas_frame_01_C::Icon_01_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Sas_gauge_use) == 0x0004E8, "Member 'UWB_ui_Sas_frame_01_C::Sas_gauge_use' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Sas_gauge_use_add) == 0x0004F0, "Member 'UWB_ui_Sas_frame_01_C::Sas_gauge_use_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, Sas_set) == 0x0004F8, "Member 'UWB_ui_Sas_frame_01_C::Sas_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, ObjFrame) == 0x000500, "Member 'UWB_ui_Sas_frame_01_C::ObjFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_frame_01_C, ObjNone) == 0x000508, "Member 'UWB_ui_Sas_frame_01_C::ObjNone' has a wrong offset!");

}

