#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PhotoMode_Parts_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_PhotoMode_Parts_1.WB_ui_PhotoMode_Parts_1_C.ExecuteUbergraph_WB_ui_PhotoMode_Parts_1
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidgetAnimation*>               K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ReferenceParm, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1) == 0x000008, "Wrong alignment on WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1");
static_assert(sizeof(WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1) == 0x000028, "Wrong size on WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1");
static_assert(offsetof(WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1, K2Node_MakeArray_Array) == 0x000008, "Member 'WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1, K2Node_MakeArray_Array_1) == 0x000018, "Member 'WB_ui_PhotoMode_Parts_1_C_ExecuteUbergraph_WB_ui_PhotoMode_Parts_1::K2Node_MakeArray_Array_1' has a wrong offset!");

}

