#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainTalk

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_BrainTalk.WB_ui_BrainTalk_C.ExecuteUbergraph_WB_ui_BrainTalk
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk) == 0x000004, "Wrong alignment on WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk");
static_assert(sizeof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk) == 0x000010, "Wrong size on WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk");
static_assert(offsetof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk, EntryPoint) == 0x000000, "Member 'WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk, K2Node_Event_State) == 0x000004, "Member 'WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_BrainTalk_C_ExecuteUbergraph_WB_ui_BrainTalk::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainTalk.WB_ui_BrainTalk_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainTalk_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainTalk_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_BrainTalk_C_UpdateState");
static_assert(sizeof(WB_ui_BrainTalk_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_BrainTalk_C_UpdateState");
static_assert(offsetof(WB_ui_BrainTalk_C_UpdateState, State) == 0x000000, "Member 'WB_ui_BrainTalk_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_BrainTalk_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_BrainTalk_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainTalk.WB_ui_BrainTalk_C.GetFaceTexture
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_BrainTalk_C_GetFaceTexture final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _index;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59F9[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainTalk_C_GetFaceTexture) == 0x000008, "Wrong alignment on WB_ui_BrainTalk_C_GetFaceTexture");
static_assert(sizeof(WB_ui_BrainTalk_C_GetFaceTexture) == 0x000020, "Wrong size on WB_ui_BrainTalk_C_GetFaceTexture");
static_assert(offsetof(WB_ui_BrainTalk_C_GetFaceTexture, Param_Index) == 0x000000, "Member 'WB_ui_BrainTalk_C_GetFaceTexture::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_GetFaceTexture, ReturnValue) == 0x000008, "Member 'WB_ui_BrainTalk_C_GetFaceTexture::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_GetFaceTexture, _index) == 0x000010, "Member 'WB_ui_BrainTalk_C_GetFaceTexture::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_GetFaceTexture, CallFunc_Array_Get_Item) == 0x000018, "Member 'WB_ui_BrainTalk_C_GetFaceTexture::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WB_ui_BrainTalk.WB_ui_BrainTalk_C.PuaseBrainTalkVoice
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainTalk_C_PuaseBrainTalkVoice final
{
public:
	bool                                          IsPause;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainTalk_C_PuaseBrainTalkVoice) == 0x000001, "Wrong alignment on WB_ui_BrainTalk_C_PuaseBrainTalkVoice");
static_assert(sizeof(WB_ui_BrainTalk_C_PuaseBrainTalkVoice) == 0x000001, "Wrong size on WB_ui_BrainTalk_C_PuaseBrainTalkVoice");
static_assert(offsetof(WB_ui_BrainTalk_C_PuaseBrainTalkVoice, IsPause) == 0x000000, "Member 'WB_ui_BrainTalk_C_PuaseBrainTalkVoice::IsPause' has a wrong offset!");

// Function WB_ui_BrainTalk.WB_ui_BrainTalk_C.SetupTextSize
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_BrainTalk_C_SetupTextSize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59FA[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstance*                        CallFunc_GetRSGameInstance_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadParamClassManager*             CallFunc_GetSaveLoadParamClassManager_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveLoadExSystemParamManager*          CallFunc_GetSaveLoadExSystemParamManager_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELetterSize                                   CallFunc_GetLetterSize_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainTalk_C_SetupTextSize) == 0x000008, "Wrong alignment on WB_ui_BrainTalk_C_SetupTextSize");
static_assert(sizeof(WB_ui_BrainTalk_C_SetupTextSize) == 0x000028, "Wrong size on WB_ui_BrainTalk_C_SetupTextSize");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, ReturnValue) == 0x000000, "Member 'WB_ui_BrainTalk_C_SetupTextSize::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, CallFunc_GetRSGameInstance_ReturnValue) == 0x000008, "Member 'WB_ui_BrainTalk_C_SetupTextSize::CallFunc_GetRSGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, CallFunc_GetSaveLoadParamClassManager_ReturnValue) == 0x000010, "Member 'WB_ui_BrainTalk_C_SetupTextSize::CallFunc_GetSaveLoadParamClassManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, CallFunc_GetSaveLoadExSystemParamManager_ReturnValue) == 0x000018, "Member 'WB_ui_BrainTalk_C_SetupTextSize::CallFunc_GetSaveLoadExSystemParamManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, CallFunc_GetLetterSize_ReturnValue) == 0x000020, "Member 'WB_ui_BrainTalk_C_SetupTextSize::CallFunc_GetLetterSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainTalk_C_SetupTextSize, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'WB_ui_BrainTalk_C_SetupTextSize::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

