#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_tutorial1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.ExecuteUbergraph_WB_ui_Brain_tutorial1
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5329[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532A[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532B[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532C[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_EventManager_C*                     CallFunc_GetEventManager_EventManager;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCutScenePhotoMode_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1) == 0x000008, "Wrong alignment on WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1) == 0x000048, "Wrong size on WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, EntryPoint) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, K2Node_Event_State) == 0x000018, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, K2Node_Event_SubState) == 0x00001C, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000025, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralInt_ReturnValue) == 0x000028, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00002C, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000030, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000034, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_GetEventManager_EventManager) == 0x000038, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_GetEventManager_EventManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1, CallFunc_IsCutScenePhotoMode_ReturnValue) == 0x000040, "Member 'WB_ui_Brain_tutorial1_C_ExecuteUbergraph_WB_ui_Brain_tutorial1::CallFunc_IsCutScenePhotoMode_ReturnValue' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateState");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateState");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532D[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateNone) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateNone");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateNone) == 0x000010, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateNone");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, SubState) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_tutorial1_C_UpdateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateOpen
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateOpen) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateOpen");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateOpen) == 0x000014, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateOpen");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, SubState) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Brain_tutorial1_C_UpdateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateLoop
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_532F[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5330[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateLoop) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateLoop");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateLoop) == 0x000014, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateLoop");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, SubState) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_tutorial1_C_UpdateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5331[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5332[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateClose) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateClose");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateClose) == 0x000014, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateClose");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, SubState) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x00000C, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_tutorial1_C_UpdateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.UpdateButtonText
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Brain_tutorial1_C_UpdateButtonText final
{
public:
	int32                                         _HardIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5333[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDeviceType                              CallFunc_getIconDeviceType_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_UpdateButtonText) == 0x000008, "Wrong alignment on WB_ui_Brain_tutorial1_C_UpdateButtonText");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_UpdateButtonText) == 0x000018, "Wrong size on WB_ui_Brain_tutorial1_C_UpdateButtonText");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, _HardIndex) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::_HardIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, CallFunc_GetPlatformType_ReturnValue) == 0x000005, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, CallFunc_getIconDeviceType_ReturnValue) == 0x000010, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::CallFunc_getIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_UpdateButtonText, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WB_ui_Brain_tutorial1_C_UpdateButtonText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.BrainTutorialOpen
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Brain_tutorial1_C_BrainTutorialOpen final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5334[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_BrainTutorialOpen) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_BrainTutorialOpen");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_BrainTutorialOpen) == 0x000008, "Wrong size on WB_ui_Brain_tutorial1_C_BrainTutorialOpen");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_BrainTutorialOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_BrainTutorialOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_BrainTutorialOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_tutorial1_C_BrainTutorialOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Brain_tutorial1.WB_ui_Brain_tutorial1_C.Update Button Fixed Text
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text final
{
public:
	int32                                         _HardIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text) == 0x000004, "Wrong alignment on WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text");
static_assert(sizeof(WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text) == 0x000004, "Wrong size on WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text");
static_assert(offsetof(WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text, _HardIndex) == 0x000000, "Member 'WB_ui_Brain_tutorial1_C_Update_Button_Fixed_Text::_HardIndex' has a wrong offset!");

}

