#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_hologram_01

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.ExecuteUbergraph_WB_ui_Sas_hologram_01
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCB[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCD[0x1];                                     // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCE[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FCF[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ARSHUDBase*                             CallFunc_GetHUDBase_HUDBase;                       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01) == 0x000008, "Wrong alignment on WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01) == 0x000050, "Wrong size on WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, EntryPoint) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, K2Node_Event_State) == 0x000018, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, K2Node_Event_SubState) == 0x00001C, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, K2Node_SwitchInteger_CmpSuccess) == 0x000024, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000025, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000026, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000028, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000030, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_GetHUDBase_HUDBase) == 0x000040, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_GetHUDBase_HUDBase' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000048, "Member 'WB_ui_Sas_hologram_01_C_ExecuteUbergraph_WB_ui_Sas_hologram_01::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Sas_hologram_01_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_UpdateState");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Sas_hologram_01_C_UpdateState");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.StateNone
// 0x000C (0x000C - 0x0000)
struct WB_ui_Sas_hologram_01_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD0[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_StateNone");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_StateNone) == 0x00000C, "Wrong size on WB_ui_Sas_hologram_01_C_StateNone");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Sas_hologram_01_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.StateOpen
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Sas_hologram_01_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FD1[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD2[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD3[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD4[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_StateOpen");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_StateOpen) == 0x000028, "Wrong size on WB_ui_Sas_hologram_01_C_StateOpen");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000D, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000020, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000021, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_Sas_hologram_01_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.StateLoop
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Sas_hologram_01_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD5[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD6[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD7[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_StateLoop");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_StateLoop) == 0x000020, "Wrong size on WB_ui_Sas_hologram_01_C_StateLoop");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_Sas_hologram_01_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.StateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Sas_hologram_01_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD8[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_StateClose");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_StateClose) == 0x000014, "Wrong size on WB_ui_Sas_hologram_01_C_StateClose");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Sas_hologram_01_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Sas_hologram_01_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Sas_hologram_01_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Sas_hologram_01_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.SetCharacter
// 0x000C (0x000C - 0x0000)
struct WB_ui_Sas_hologram_01_C_SetCharacter final
{
public:
	EPlayerID                                     CharaID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FD9[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_SetCharacter) == 0x000004, "Wrong alignment on WB_ui_Sas_hologram_01_C_SetCharacter");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_SetCharacter) == 0x00000C, "Wrong size on WB_ui_Sas_hologram_01_C_SetCharacter");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_SetCharacter, CharaID) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_SetCharacter::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_SetCharacter, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'WB_ui_Sas_hologram_01_C_SetCharacter::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_SetCharacter, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_SetCharacter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.UpdateButton
// 0x0048 (0x0048 - 0x0000)
struct WB_ui_Sas_hologram_01_C_UpdateButton final
{
public:
	int32                                         _DrawType;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FDA[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionParam*                           CallFunc_GetOptionParam_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           CallFunc_GetControllerParamValue_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FDB[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputDeviceType                              CallFunc_getIconDeviceType_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6FDC[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_UpdateButton) == 0x000008, "Wrong alignment on WB_ui_Sas_hologram_01_C_UpdateButton");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_UpdateButton) == 0x000048, "Wrong size on WB_ui_Sas_hologram_01_C_UpdateButton");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, _DrawType) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::_DrawType' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_GetUserParamManager_UserParamManager) == 0x000008, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_GetOptionParam_ReturnValue) == 0x000010, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_GetOptionParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_GetControllerParamValue_ReturnValue) == 0x000018, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_GetControllerParamValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, K2Node_SwitchInteger_CmpSuccess) == 0x000019, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000020, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_getIconDeviceType_ReturnValue) == 0x000028, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_getIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_GetPlatformName_ReturnValue) == 0x000030, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000041, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000042, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_UpdateButton, CallFunc_BooleanOR_ReturnValue) == 0x000043, "Member 'WB_ui_Sas_hologram_01_C_UpdateButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.SetCrashVision
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Sas_hologram_01_C_SetCrashVision final
{
public:
	bool                                          Param_IsCrashVision;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_SetCrashVision) == 0x000001, "Wrong alignment on WB_ui_Sas_hologram_01_C_SetCrashVision");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_SetCrashVision) == 0x000001, "Wrong size on WB_ui_Sas_hologram_01_C_SetCrashVision");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_SetCrashVision, Param_IsCrashVision) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_SetCrashVision::Param_IsCrashVision' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.SetCrashVisionStyle
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Sas_hologram_01_C_SetCrashVisionStyle final
{
public:
	bool                                          IsNewStyle;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_SetCrashVisionStyle) == 0x000001, "Wrong alignment on WB_ui_Sas_hologram_01_C_SetCrashVisionStyle");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_SetCrashVisionStyle) == 0x000001, "Wrong size on WB_ui_Sas_hologram_01_C_SetCrashVisionStyle");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_SetCrashVisionStyle, IsNewStyle) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_SetCrashVisionStyle::IsNewStyle' has a wrong offset!");

// Function WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C.CheckOpenReserve
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Sas_hologram_01_C_CheckOpenReserve final
{
public:
	bool                                          IsReserve;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Sas_hologram_01_C_CheckOpenReserve) == 0x000001, "Wrong alignment on WB_ui_Sas_hologram_01_C_CheckOpenReserve");
static_assert(sizeof(WB_ui_Sas_hologram_01_C_CheckOpenReserve) == 0x000001, "Wrong size on WB_ui_Sas_hologram_01_C_CheckOpenReserve");
static_assert(offsetof(WB_ui_Sas_hologram_01_C_CheckOpenReserve, IsReserve) == 0x000000, "Member 'WB_ui_Sas_hologram_01_C_CheckOpenReserve::IsReserve' has a wrong offset!");

}

