#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Quest_Parts_2.WB_ui_Quest_Parts_2_C
// 0x0058 (0x0420 - 0x03C8)
class UWB_ui_Quest_Parts_2_C final : public UUIQuestIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_6;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_5;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_4;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_3;                                         // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_quest_2;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Size_localize;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_icon_1;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Quest_Parts_2(int32 EntryPoint);
	void SetProgress(int32 Progress);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Quest_Parts_2_C">();
	}
	static class UWB_ui_Quest_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Quest_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_Quest_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_Quest_Parts_2_C");
static_assert(sizeof(UWB_ui_Quest_Parts_2_C) == 0x000420, "Wrong size on UWB_ui_Quest_Parts_2_C");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, UberGraphFrame) == 0x0003C8, "Member 'UWB_ui_Quest_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_6) == 0x0003D0, "Member 'UWB_ui_Quest_Parts_2_C::Default_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_5) == 0x0003D8, "Member 'UWB_ui_Quest_Parts_2_C::Default_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_4) == 0x0003E0, "Member 'UWB_ui_Quest_Parts_2_C::Default_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_3) == 0x0003E8, "Member 'UWB_ui_Quest_Parts_2_C::Default_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_2) == 0x0003F0, "Member 'UWB_ui_Quest_Parts_2_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default_none) == 0x0003F8, "Member 'UWB_ui_Quest_Parts_2_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Default) == 0x000400, "Member 'UWB_ui_Quest_Parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Icon_quest_2) == 0x000408, "Member 'UWB_ui_Quest_Parts_2_C::Icon_quest_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Size_localize) == 0x000410, "Member 'UWB_ui_Quest_Parts_2_C::Size_localize' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_Parts_2_C, Text_quest_icon_1) == 0x000418, "Member 'UWB_ui_Quest_Parts_2_C::Text_quest_icon_1' has a wrong offset!");

}

