#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_action_icon_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_2_C.ExecuteUbergraph_WB_ui_PK_action_icon_2
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2) == 0x000004, "Wrong alignment on WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2");
static_assert(sizeof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2) == 0x000014, "Wrong size on WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2, EntryPoint) == 0x000000, "Member 'WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2, K2Node_Event_State) == 0x000004, "Member 'WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_PK_action_icon_2_C_ExecuteUbergraph_WB_ui_PK_action_icon_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_PK_action_icon_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_action_icon_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_PK_action_icon_2_C_UpdateState");
static_assert(sizeof(WB_ui_PK_action_icon_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_PK_action_icon_2_C_UpdateState");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_PK_action_icon_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_PK_action_icon_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_PK_action_icon_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_2_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_PK_action_icon_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_action_icon_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_PK_action_icon_2_C_StateNone");
static_assert(sizeof(WB_ui_PK_action_icon_2_C_StateNone) == 0x000008, "Wrong size on WB_ui_PK_action_icon_2_C_StateNone");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_PK_action_icon_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_PK_action_icon_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_PK_action_icon_2.WB_ui_PK_action_icon_2_C.StateDecision
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_PK_action_icon_2_C_StateDecision final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_action_icon_2_C_StateDecision) == 0x000004, "Wrong alignment on WB_ui_PK_action_icon_2_C_StateDecision");
static_assert(sizeof(WB_ui_PK_action_icon_2_C_StateDecision) == 0x000008, "Wrong size on WB_ui_PK_action_icon_2_C_StateDecision");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_StateDecision, SubState) == 0x000000, "Member 'WB_ui_PK_action_icon_2_C_StateDecision::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_StateDecision, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_PK_action_icon_2_C_StateDecision::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_action_icon_2_C_StateDecision, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_PK_action_icon_2_C_StateDecision::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

}

