#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Brain_gauge3

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Brain_gauge3.WB_ui_Brain_gauge3_C.ExecuteUbergraph_WB_ui_Brain_gauge3
// 0x0120 (0x0120 - 0x0000)
struct WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521D[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521E[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521F[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5220[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5221[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5222[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5223[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_14;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_15;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5224[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_14;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_15;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_16;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_17;           // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5225[0x2];                                     // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_16;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_17;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_18;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_19;           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5226[0x2];                                     // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_18;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_19;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_20;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_21;           // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5227[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_20;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_21;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_22;           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_23;           // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5228[0x2];                                     // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_22;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_23;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_24;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5229[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_24;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_25;           // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522A[0x1];                                     // 0x00AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_25;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_26;           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522B[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_26;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_27;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522C[0x3];                                     // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_27;            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_28;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522D[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_28;            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_29;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522E[0x3];                                     // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_29;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_30;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522F[0x3];                                     // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_30;            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_31;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5230[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_31;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_32;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5231[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_32;            // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_33;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5232[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_33;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_34;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5233[0x3];                                     // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_34;            // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_35;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5234[0x3];                                     // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_35;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_36;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5235[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_36;            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_37;           // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5236[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_37;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_38;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5237[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_38;            // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_39;           // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5238[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_39;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3");
static_assert(sizeof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3) == 0x000120, "Wrong size on WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, EntryPoint) == 0x000000, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000029, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000030, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000034, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000035, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000038, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00003C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000040, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000041, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000044, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x000048, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x00004C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x00004D, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x000050, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x000054, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_14) == 0x000058, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_15) == 0x000059, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_14) == 0x00005C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_15) == 0x000060, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_16) == 0x000064, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_17) == 0x000065, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_16) == 0x000068, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_17) == 0x00006C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_18) == 0x000070, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_19) == 0x000071, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_18) == 0x000074, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_19) == 0x000078, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_20) == 0x00007C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_21) == 0x00007D, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_20) == 0x000080, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_21) == 0x000084, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_22) == 0x000088, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_23) == 0x000089, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_22) == 0x00008C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_23) == 0x000090, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_23' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_24) == 0x000094, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_24) == 0x000098, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_24' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, K2Node_Event_State) == 0x00009C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, K2Node_Event_SubState) == 0x0000A0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, K2Node_Event_DeltaSeconds) == 0x0000A4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, K2Node_SwitchInteger_CmpSuccess) == 0x0000A8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A9, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_25) == 0x0000AA, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_25) == 0x0000AC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_25' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_26) == 0x0000B0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_26) == 0x0000B4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_26' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_27) == 0x0000B8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_27) == 0x0000BC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_27' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_28) == 0x0000C0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_28) == 0x0000C4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_28' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_29) == 0x0000C8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_29) == 0x0000CC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_29' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_30) == 0x0000D0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_30) == 0x0000D4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_30' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_31) == 0x0000D8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_31) == 0x0000DC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_31' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_32) == 0x0000E0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_32) == 0x0000E4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_32' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_33) == 0x0000E8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_33) == 0x0000EC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_33' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_34) == 0x0000F0, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_34) == 0x0000F4, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_34' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_35) == 0x0000F8, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_35) == 0x0000FC, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_35' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_36) == 0x000100, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_36) == 0x000104, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_36' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_37) == 0x000108, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_37) == 0x00010C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_37' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_38) == 0x000110, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_38) == 0x000114, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_38' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_MakeLiteralByte_ReturnValue_39) == 0x000118, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_MakeLiteralByte_ReturnValue_39' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3, CallFunc_Conv_ByteToInt_ReturnValue_39) == 0x00011C, "Member 'WB_ui_Brain_gauge3_C_ExecuteUbergraph_WB_ui_Brain_gauge3::CallFunc_Conv_ByteToInt_ReturnValue_39' has a wrong offset!");

// Function WB_ui_Brain_gauge3.WB_ui_Brain_gauge3_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Brain_gauge3_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge3_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge3_C_UpdateState");
static_assert(sizeof(WB_ui_Brain_gauge3_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Brain_gauge3_C_UpdateState");
static_assert(offsetof(WB_ui_Brain_gauge3_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Brain_gauge3_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Brain_gauge3_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Brain_gauge3_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Brain_gauge3.WB_ui_Brain_gauge3_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Brain_gauge3_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5239[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523A[0x1];                                     // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge3_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge3_C_StateNone");
static_assert(sizeof(WB_ui_Brain_gauge3_C_StateNone) == 0x000014, "Wrong size on WB_ui_Brain_gauge3_C_StateNone");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Brain_gauge3_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_Brain_gauge3_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000005, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_IsValid_ReturnValue_1) == 0x00000D, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000E, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Brain_gauge3_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Brain_gauge3.WB_ui_Brain_gauge3_C.StateOpen
// 0x005C (0x005C - 0x0000)
struct WB_ui_Brain_gauge3_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523B[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523C[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523D[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523E[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_523F[0x1];                                     // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5240[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5241[0x2];                                     // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Brain_gauge3_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_Brain_gauge3_C_StateOpen");
static_assert(sizeof(WB_ui_Brain_gauge3_C_StateOpen) == 0x00005C, "Wrong size on WB_ui_Brain_gauge3_C_StateOpen");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Brain_gauge3_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Brain_gauge3_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000024, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Brain_gauge3_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000028, "Member 'WB_ui_Brain_gauge3_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
