#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Quest_PopUp_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Quest_PopUp_1.WB_ui_Quest_PopUp_1_C
// 0x0108 (0x05C8 - 0x04C0)
class UWB_ui_Quest_PopUp_1_C final : public UUIQuestChoice
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Choice_set;                                        // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Choise_Set_2;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Guide_Set;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_category_4;                                   // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_category_5;                                   // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_category_6;                                   // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_reward1;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_reward1_1;                               // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_reward2;                                 // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_reward3;                                 // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_4;                                 // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_6;                                 // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame5;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                PG_Spacer;                                         // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Reward;                                            // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_3;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Text_2_ItemName;                                   // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_Base_4;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_popup_1;                                // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_popup_2;                                // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_popup_3;                                // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_popup_Guide_1;                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_sub_reward_1;                           // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_sub_reward_2;                           // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_sub_reward_3;                           // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_quest_sub_reward_4;                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextSet_reward_1;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextSet_reward_2;                                  // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TextSet_reward_3;                                  // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_1;                            // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Choise_parts_1_C*                WB_ui_Choise_parts_1_2;                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Quest_PopUp_1(int32 EntryPoint);
	void SetKinsuIcon(class UImage* ImageCategory, class UImage* ImageItemIconFrame);
	void SetItemIconNone(class UImage* ImageCategory, class UImage* ImageItemIconFrame);
	void SetItemIcon(class FName ItemId, class UImage* ImageCategory, class UImage* ImageItemIconFrame);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Quest_PopUp_1_C">();
	}
	static class UWB_ui_Quest_PopUp_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Quest_PopUp_1_C>();
	}
};
static_assert(alignof(UWB_ui_Quest_PopUp_1_C) == 0x000008, "Wrong alignment on UWB_ui_Quest_PopUp_1_C");
static_assert(sizeof(UWB_ui_Quest_PopUp_1_C) == 0x0005C8, "Wrong size on UWB_ui_Quest_PopUp_1_C");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, UberGraphFrame) == 0x0004C0, "Member 'UWB_ui_Quest_PopUp_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Choice_set) == 0x0004C8, "Member 'UWB_ui_Quest_PopUp_1_C::Choice_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Choise_Set_2) == 0x0004D0, "Member 'UWB_ui_Quest_PopUp_1_C::Choise_Set_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Guide_Set) == 0x0004D8, "Member 'UWB_ui_Quest_PopUp_1_C::Guide_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_category_4) == 0x0004E0, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_category_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_category_5) == 0x0004E8, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_category_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_category_6) == 0x0004F0, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_category_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_font_1) == 0x0004F8, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_font_reward1) == 0x000500, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_font_reward1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_font_reward1_1) == 0x000508, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_font_reward1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_font_reward2) == 0x000510, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_font_reward2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Icon_font_reward3) == 0x000518, "Member 'UWB_ui_Quest_PopUp_1_C::Icon_font_reward3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Item_icon_frame_4) == 0x000520, "Member 'UWB_ui_Quest_PopUp_1_C::Item_icon_frame_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Item_icon_frame_6) == 0x000528, "Member 'UWB_ui_Quest_PopUp_1_C::Item_icon_frame_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Item_icon_frame5) == 0x000530, "Member 'UWB_ui_Quest_PopUp_1_C::Item_icon_frame5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, PG_Spacer) == 0x000538, "Member 'UWB_ui_Quest_PopUp_1_C::PG_Spacer' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Reward) == 0x000540, "Member 'UWB_ui_Quest_PopUp_1_C::Reward' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_3) == 0x000548, "Member 'UWB_ui_Quest_PopUp_1_C::Text_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_2_ItemName) == 0x000550, "Member 'UWB_ui_Quest_PopUp_1_C::Text_2_ItemName' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_Base_4) == 0x000558, "Member 'UWB_ui_Quest_PopUp_1_C::Text_Base_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_popup_1) == 0x000560, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_popup_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_popup_2) == 0x000568, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_popup_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_popup_3) == 0x000570, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_popup_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_popup_Guide_1) == 0x000578, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_popup_Guide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_sub_reward_1) == 0x000580, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_sub_reward_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_sub_reward_2) == 0x000588, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_sub_reward_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_sub_reward_3) == 0x000590, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_sub_reward_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, Text_quest_sub_reward_4) == 0x000598, "Member 'UWB_ui_Quest_PopUp_1_C::Text_quest_sub_reward_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, TextSet_reward_1) == 0x0005A0, "Member 'UWB_ui_Quest_PopUp_1_C::TextSet_reward_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, TextSet_reward_2) == 0x0005A8, "Member 'UWB_ui_Quest_PopUp_1_C::TextSet_reward_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, TextSet_reward_3) == 0x0005B0, "Member 'UWB_ui_Quest_PopUp_1_C::TextSet_reward_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, WB_ui_Choise_parts_1_1) == 0x0005B8, "Member 'UWB_ui_Quest_PopUp_1_C::WB_ui_Choise_parts_1_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Quest_PopUp_1_C, WB_ui_Choise_parts_1_2) == 0x0005C0, "Member 'UWB_ui_Quest_PopUp_1_C::WB_ui_Choise_parts_1_2' has a wrong offset!");

}

