#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Party_CharaInfo_Parts_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2
// 0x0060 (0x0060 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C93[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C94[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C95[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C96[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C97[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C98[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C99[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9A[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2) == 0x000060, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00001D, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000024, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000030, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000031, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000034, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000038, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x00003C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, K2Node_Event_State) == 0x000040, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, K2Node_Event_SubState) == 0x000044, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, K2Node_Event_DeltaSeconds) == 0x000048, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x00004C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000051, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x000054, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x000058, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x00005C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_ExecuteUbergraph_WB_ui_Party_CharaInfo_Parts_2::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.StateNone
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9B[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9C[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_StateNone");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone) == 0x000014, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_StateNone");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.StateLoop
// 0x0044 (0x0044 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9D[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9E[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9F[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA0[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_2;        // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CA1[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA2[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_StateLoop");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop) == 0x000044, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_StateLoop");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000011, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000014, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000018, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000019, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x00001C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000020, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000021, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000028, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x00002C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_2) == 0x00002D, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000034, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000035, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000038, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x00003C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x000041, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.SetCursorPositionFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag) == 0x000001, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag) == 0x000001, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag, Flag) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetCursorPositionFlag::Flag' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.SetOperations
// 0x0078 (0x0078 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_SetOperations final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA3[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           _TitleList;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                           _OperationsTitleList;                              // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations) == 0x000008, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_SetOperations");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations) == 0x000078, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_SetOperations");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, Param_Index) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, _TitleList) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::_TitleList' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, _OperationsTitleList) == 0x000018, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::_OperationsTitleList' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, CallFunc_GetDataBaseManager_Manager) == 0x000048, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, CallFunc_GetText_ReturnValue) == 0x000050, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetOperations, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetOperations::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.GetOperations
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_GetOperations final
{
public:
	int32                                         Operations;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_GetOperations) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_GetOperations");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_GetOperations) == 0x000004, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_GetOperations");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_GetOperations, Operations) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_GetOperations::Operations' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.IsDecision
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_IsDecision final
{
public:
	bool                                          Param_IsDecision;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_IsDecision) == 0x000001, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_IsDecision");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_IsDecision) == 0x000001, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_IsDecision");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_IsDecision, Param_IsDecision) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_IsDecision::Param_IsDecision' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.SetSelectFlag
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag) == 0x000001, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag) == 0x000001, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag, Flag) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_SetSelectFlag::Flag' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.StateLoopSelect
// 0x004C (0x004C - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA4[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA5[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA6[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CA7[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA8[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_2;        // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CA9[0x1];                                     // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CAA[0x2];                                     // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_3;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect) == 0x00004C, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, SubState) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000024, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000025, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00002C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000030, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000034, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_2) == 0x000035, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000036, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000038, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x00003C, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x00003D, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000040, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000044, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_3) == 0x000048, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_3' has a wrong offset!");

// Function WB_ui_Party_CharaInfo_Parts_2.WB_ui_Party_CharaInfo_Parts_2_C.StateLoopUnSelect
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CAB[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CAC[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8CAD[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect) == 0x000004, "Wrong alignment on WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect");
static_assert(sizeof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect) == 0x000020, "Wrong size on WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect, SubState) == 0x000000, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_CharaInfo_Parts_2_C_StateLoopUnSelect::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
