#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MainContents_Parts_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.ExecuteUbergraph_WB_ui_MainContents_Parts_1
// 0x0054 (0x0054 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5843[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5844[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5845[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5846[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5847[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5848[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1) == 0x000004, "Wrong alignment on WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1) == 0x000054, "Wrong size on WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000011, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000018, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00001C, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000020, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000024, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000028, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralInt_ReturnValue) == 0x00002C, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000030, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000031, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000034, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000038, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, K2Node_Event_State) == 0x00003C, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, K2Node_Event_SubState) == 0x000040, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000048, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00004C, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'WB_ui_MainContents_Parts_1_C_ExecuteUbergraph_WB_ui_MainContents_Parts_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_MainContents_Parts_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_MainContents_Parts_1_C_UpdateState");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_MainContents_Parts_1_C_UpdateState");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_MainContents_Parts_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_MainContents_Parts_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5849[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_MainContents_Parts_1_C_StateNone");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_StateNone) == 0x000010, "Wrong size on WB_ui_MainContents_Parts_1_C_StateNone");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_MainContents_Parts_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.StateLoop
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_584A[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584B[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584C[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584D[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_MainContents_Parts_1_C_StateLoop");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_StateLoop) == 0x000028, "Wrong size on WB_ui_MainContents_Parts_1_C_StateLoop");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000C, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00000D, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000010, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000020, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000021, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_MainContents_Parts_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_SetSelect final
{
public:
	bool                                          IsSelect;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_MainContents_Parts_1_C_SetSelect");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_SetSelect) == 0x000001, "Wrong size on WB_ui_MainContents_Parts_1_C_SetSelect");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetSelect, IsSelect) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_SetSelect::IsSelect' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.SetTabIndex
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_SetTabIndex final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnlock;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_584E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EContentsOpening>                      OpenFlagList;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                           TextList;                                          // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<EContentsOpening>                      K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584F[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5850[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMenuCommonMessage_ReturnValue;         // 0x0060(0x0018)()
	class URSGameInstance*                        CallFunc_GetRSGameInstance_RSGameInstance;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFlagManager*                           CallFunc_GetFlagManager_ReturnValue;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsContentsOpened_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5851[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5852[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetMenuCommonMessage_ReturnValue_1;       // 0x00A0(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_SetTabIndex) == 0x000008, "Wrong alignment on WB_ui_MainContents_Parts_1_C_SetTabIndex");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_SetTabIndex) == 0x0000C0, "Wrong size on WB_ui_MainContents_Parts_1_C_SetTabIndex");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, Param_Index) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, IsUnlock) == 0x000004, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::IsUnlock' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, OpenFlagList) == 0x000008, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::OpenFlagList' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, TextList) == 0x000018, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::TextList' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_MakeLiteralByte_ReturnValue) == 0x000048, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetDataBaseManager_Manager) == 0x000050, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetMenuCommonMessage_ReturnValue) == 0x000060, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetMenuCommonMessage_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetRSGameInstance_RSGameInstance) == 0x000078, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetRSGameInstance_RSGameInstance' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetFlagManager_ReturnValue) == 0x000080, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetFlagManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_IsContentsOpened_ReturnValue) == 0x000088, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_IsContentsOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetDataBaseManager_Manager_1) == 0x000090, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_BooleanOR_ReturnValue) == 0x000098, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_GetMenuCommonMessage_ReturnValue_1) == 0x0000A0, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_GetMenuCommonMessage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetTabIndex, CallFunc_BooleanAND_ReturnValue) == 0x0000B8, "Member 'WB_ui_MainContents_Parts_1_C_SetTabIndex::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ui_MainContents_Parts_1.WB_ui_MainContents_Parts_1_C.SetUnSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_MainContents_Parts_1_C_SetUnSelect final
{
public:
	bool                                          IsUnSelect;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MainContents_Parts_1_C_SetUnSelect) == 0x000001, "Wrong alignment on WB_ui_MainContents_Parts_1_C_SetUnSelect");
static_assert(sizeof(WB_ui_MainContents_Parts_1_C_SetUnSelect) == 0x000001, "Wrong size on WB_ui_MainContents_Parts_1_C_SetUnSelect");
static_assert(offsetof(WB_ui_MainContents_Parts_1_C_SetUnSelect, IsUnSelect) == 0x000000, "Member 'WB_ui_MainContents_Parts_1_C_SetUnSelect::IsUnSelect' has a wrong offset!");

}

