#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Sas_hologram_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Sas_hologram_01.WB_ui_Sas_hologram_01_C
// 0x00D0 (0x0458 - 0x0388)
class UWB_ui_Sas_hologram_01_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Decision;                                          // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Button;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_base_1;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_base_2;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_eff_1;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_eff_2_1;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_eff_2_2;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Button_frame;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Button_Set;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_base;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_Frame;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_Noise;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_hologram_button_c;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_hologram_button_l;                             // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_hologram_button_r;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Sas_hologram_button_set;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_hologram_icon_font;                            // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Size;                                              // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Size_ghost;                                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsDecide;                                          // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCrashVision;                                     // 0x0451(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCrashVisionNewStyle;                             // 0x0452(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOpenReserve;                                     // 0x0453(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCloseReserve;                                    // 0x0454(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Sas_hologram_01(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetCharacter(EPlayerID CharaID);
	void Decide();
	void UpdateButton();
	void SetCrashVision(bool Param_IsCrashVision);
	void SetCrashVisionStyle(bool IsNewStyle);
	void SetOpenReserve();
	void CheckOpenReserve(bool* IsReserve);
	void SetCloseReserve();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Sas_hologram_01_C">();
	}
	static class UWB_ui_Sas_hologram_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Sas_hologram_01_C>();
	}
};
static_assert(alignof(UWB_ui_Sas_hologram_01_C) == 0x000008, "Wrong alignment on UWB_ui_Sas_hologram_01_C");
static_assert(sizeof(UWB_ui_Sas_hologram_01_C) == 0x000458, "Wrong size on UWB_ui_Sas_hologram_01_C");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Sas_hologram_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Decision) == 0x000390, "Member 'UWB_ui_Sas_hologram_01_C::Decision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Default) == 0x000398, "Member 'UWB_ui_Sas_hologram_01_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Out) == 0x0003A0, "Member 'UWB_ui_Sas_hologram_01_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, In) == 0x0003A8, "Member 'UWB_ui_Sas_hologram_01_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Default_none) == 0x0003B0, "Member 'UWB_ui_Sas_hologram_01_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button) == 0x0003B8, "Member 'UWB_ui_Sas_hologram_01_C::Button' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_base_1) == 0x0003C0, "Member 'UWB_ui_Sas_hologram_01_C::Button_base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_base_2) == 0x0003C8, "Member 'UWB_ui_Sas_hologram_01_C::Button_base_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_eff_1) == 0x0003D0, "Member 'UWB_ui_Sas_hologram_01_C::Button_eff_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_eff_2_1) == 0x0003D8, "Member 'UWB_ui_Sas_hologram_01_C::Button_eff_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_eff_2_2) == 0x0003E0, "Member 'UWB_ui_Sas_hologram_01_C::Button_eff_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_frame) == 0x0003E8, "Member 'UWB_ui_Sas_hologram_01_C::Button_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Button_Set) == 0x0003F0, "Member 'UWB_ui_Sas_hologram_01_C::Button_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Face_a) == 0x0003F8, "Member 'UWB_ui_Sas_hologram_01_C::Face_a' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Face_base) == 0x000400, "Member 'UWB_ui_Sas_hologram_01_C::Face_base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Face_Frame) == 0x000408, "Member 'UWB_ui_Sas_hologram_01_C::Face_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Face_Noise) == 0x000410, "Member 'UWB_ui_Sas_hologram_01_C::Face_Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Sas_hologram_button_c) == 0x000418, "Member 'UWB_ui_Sas_hologram_01_C::Sas_hologram_button_c' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Sas_hologram_button_l) == 0x000420, "Member 'UWB_ui_Sas_hologram_01_C::Sas_hologram_button_l' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Sas_hologram_button_r) == 0x000428, "Member 'UWB_ui_Sas_hologram_01_C::Sas_hologram_button_r' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Sas_hologram_button_set) == 0x000430, "Member 'UWB_ui_Sas_hologram_01_C::Sas_hologram_button_set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Sas_hologram_icon_font) == 0x000438, "Member 'UWB_ui_Sas_hologram_01_C::Sas_hologram_icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Size) == 0x000440, "Member 'UWB_ui_Sas_hologram_01_C::Size' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, Size_ghost) == 0x000448, "Member 'UWB_ui_Sas_hologram_01_C::Size_ghost' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, IsDecide) == 0x000450, "Member 'UWB_ui_Sas_hologram_01_C::IsDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, IsCrashVision) == 0x000451, "Member 'UWB_ui_Sas_hologram_01_C::IsCrashVision' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, IsCrashVisionNewStyle) == 0x000452, "Member 'UWB_ui_Sas_hologram_01_C::IsCrashVisionNewStyle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, IsOpenReserve) == 0x000453, "Member 'UWB_ui_Sas_hologram_01_C::IsOpenReserve' has a wrong offset!");
static_assert(offsetof(UWB_ui_Sas_hologram_01_C, IsCloseReserve) == 0x000454, "Member 'UWB_ui_Sas_hologram_01_C::IsCloseReserve' has a wrong offset!");

}

