#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Loading_chara_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Loading_chara_1.WB_ui_Loading_chara_1_C
// 0x0120 (0x04A8 - 0x0388)
class UWB_ui_Loading_chara_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_black;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Shadow;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 black_cover_1;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 black_cover_2;                                     // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_L;                                       // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_R;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_Un;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BlackBand_Up;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2;                                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3;                                            // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_4;                                            // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_1_particle;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_2_particle;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_3_particle;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_4_particle;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_line;                                        // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise_TV;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           REDRetainerBox_noise;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RT_chara;                                          // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_load_chara_info;                              // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_load_chara_title;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ID;                                                // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6647[0x4];                                     // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UILoading3D_C*                      Scene;                                             // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrawTime;                                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagDisableClose;                                  // 0x04A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagTest;                                          // 0x04A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Loading_chara_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetId(int32 Param_ID);
	void Create3DScene();
	void Release3DScene();
	void SetTest(bool IsTest);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Loading_chara_1_C">();
	}
	static class UWB_ui_Loading_chara_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Loading_chara_1_C>();
	}
};
static_assert(alignof(UWB_ui_Loading_chara_1_C) == 0x000008, "Wrong alignment on UWB_ui_Loading_chara_1_C");
static_assert(sizeof(UWB_ui_Loading_chara_1_C) == 0x0004A8, "Wrong size on UWB_ui_Loading_chara_1_C");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Loading_chara_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Out) == 0x000390, "Member 'UWB_ui_Loading_chara_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, In) == 0x000398, "Member 'UWB_ui_Loading_chara_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Default_none) == 0x0003A0, "Member 'UWB_ui_Loading_chara_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Default) == 0x0003A8, "Member 'UWB_ui_Loading_chara_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Base_black) == 0x0003B0, "Member 'UWB_ui_Loading_chara_1_C::Base_black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, BG_Shadow) == 0x0003B8, "Member 'UWB_ui_Loading_chara_1_C::BG_Shadow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, black_cover_1) == 0x0003C0, "Member 'UWB_ui_Loading_chara_1_C::black_cover_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, black_cover_2) == 0x0003C8, "Member 'UWB_ui_Loading_chara_1_C::black_cover_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, BlackBand_L) == 0x0003D0, "Member 'UWB_ui_Loading_chara_1_C::BlackBand_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, BlackBand_R) == 0x0003D8, "Member 'UWB_ui_Loading_chara_1_C::BlackBand_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, BlackBand_Un) == 0x0003E0, "Member 'UWB_ui_Loading_chara_1_C::BlackBand_Un' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, BlackBand_Up) == 0x0003E8, "Member 'UWB_ui_Loading_chara_1_C::BlackBand_Up' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, CA_Image_Blue) == 0x0003F0, "Member 'UWB_ui_Loading_chara_1_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, CA_Image_Green) == 0x0003F8, "Member 'UWB_ui_Loading_chara_1_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, CA_Image_Red) == 0x000400, "Member 'UWB_ui_Loading_chara_1_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, CA_RetainerBox) == 0x000408, "Member 'UWB_ui_Loading_chara_1_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Icon_font_1) == 0x000410, "Member 'UWB_ui_Loading_chara_1_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_1) == 0x000418, "Member 'UWB_ui_Loading_chara_1_C::Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_2) == 0x000420, "Member 'UWB_ui_Loading_chara_1_C::Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_3) == 0x000428, "Member 'UWB_ui_Loading_chara_1_C::Line_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_4) == 0x000430, "Member 'UWB_ui_Loading_chara_1_C::Line_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_1_particle) == 0x000438, "Member 'UWB_ui_Loading_chara_1_C::Line_1_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_2_particle) == 0x000440, "Member 'UWB_ui_Loading_chara_1_C::Line_2_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_3_particle) == 0x000448, "Member 'UWB_ui_Loading_chara_1_C::Line_3_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Line_4_particle) == 0x000450, "Member 'UWB_ui_Loading_chara_1_C::Line_4_particle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Noise_line) == 0x000458, "Member 'UWB_ui_Loading_chara_1_C::Noise_line' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Noise_TV) == 0x000460, "Member 'UWB_ui_Loading_chara_1_C::Noise_TV' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, REDRetainerBox_Menu) == 0x000468, "Member 'UWB_ui_Loading_chara_1_C::REDRetainerBox_Menu' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, REDRetainerBox_noise) == 0x000470, "Member 'UWB_ui_Loading_chara_1_C::REDRetainerBox_noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, RT_chara) == 0x000478, "Member 'UWB_ui_Loading_chara_1_C::RT_chara' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Text_load_chara_info) == 0x000480, "Member 'UWB_ui_Loading_chara_1_C::Text_load_chara_info' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Text_load_chara_title) == 0x000488, "Member 'UWB_ui_Loading_chara_1_C::Text_load_chara_title' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, ID) == 0x000490, "Member 'UWB_ui_Loading_chara_1_C::ID' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, Scene) == 0x000498, "Member 'UWB_ui_Loading_chara_1_C::Scene' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, DrawTime) == 0x0004A0, "Member 'UWB_ui_Loading_chara_1_C::DrawTime' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, FlagDisableClose) == 0x0004A4, "Member 'UWB_ui_Loading_chara_1_C::FlagDisableClose' has a wrong offset!");
static_assert(offsetof(UWB_ui_Loading_chara_1_C, FlagTest) == 0x0004A5, "Member 'UWB_ui_Loading_chara_1_C::FlagTest' has a wrong offset!");

}

