#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_5

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Struct_ui_equip_item_list_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "Enum_ui_equip_parts_5_animation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Equip_Parts_5.WB_ui_Equip_Parts_5_C
// 0x00E8 (0x0480 - 0x0398)
class UWB_ui_Equip_Parts_5_C final : public UUIEquipParts5
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       In_2_5;                                            // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2_4;                                            // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2_3;                                            // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2_2;                                            // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_0;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_2;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_3;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_4;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_5;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_1L;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChangeLine_1R;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_List;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List_Set;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          REDScrollBox_1;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_equipage_contents_3;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_equipage_contents_4;                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FStruct_ui_equip_item_list>     ItemList;                                          // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         CursorPos;                                         // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMouseDecide;                                     // 0x046C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FristFlag;                                         // 0x046D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5964[0x2];                                     // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BaseIndex;                                         // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SortType;                                          // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagChangeCursor;                                  // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagControl;                                       // 0x0479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagWeaponSkin;                                    // 0x047A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Equip_Parts_5(int32 EntryPoint);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void OnInitialized();
	void ___g_U__(int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_UnFocus(class UUserWidget* PWidget);
	void Event_Focus(class UUserWidget* PWidget);
	void Event_UpdateElement(int32 Param_Index, class UUserWidget* PWidget);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetItemList(TArray<struct FStruct_ui_equip_item_list>& List, bool IsSkin);
	void SetupList();
	void SetListElement(class UWB_ui_Equip_Parts_4_C*& Widget, int32& Param_Index);
	void UpdateCursor();
	void GetListCursor(int32* Param_Cursor);
	void SetListCursor(int32& Param_Cursor);
	void GetIconIndex(class FName ItemId, int32* Param_Index);
	void SetMouseDecideReset();
	void GetMouseDecide(bool* Mousedecide);
	void SetupText();
	void ClearCurrentNewFlag();
	void SetFirstFlag(bool IsFirst, int32 Param_BaseIndex);
	bool ClearCurrentNewFlagNative(int32 Param_Index);
	void Sort(int32 Param_SortType);
	void IsSortSwap(struct FStruct_ui_equip_item_list& Item1, struct FStruct_ui_equip_item_list& Item2, bool* IsSwap);
	void GetCurrentParam(struct FStruct_ui_equip_item_list* Param);
	void ResetCurrentNewFlag();
	void SetControl(bool IsControl);
	void SetListCursorID(class FName ID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Equip_Parts_5_C">();
	}
	static class UWB_ui_Equip_Parts_5_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Equip_Parts_5_C>();
	}
};
static_assert(alignof(UWB_ui_Equip_Parts_5_C) == 0x000008, "Wrong alignment on UWB_ui_Equip_Parts_5_C");
static_assert(sizeof(UWB_ui_Equip_Parts_5_C) == 0x000480, "Wrong size on UWB_ui_Equip_Parts_5_C");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, UberGraphFrame) == 0x000398, "Member 'UWB_ui_Equip_Parts_5_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In_2_5) == 0x0003A0, "Member 'UWB_ui_Equip_Parts_5_C::In_2_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In_2_4) == 0x0003A8, "Member 'UWB_ui_Equip_Parts_5_C::In_2_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In_2_3) == 0x0003B0, "Member 'UWB_ui_Equip_Parts_5_C::In_2_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In_2_2) == 0x0003B8, "Member 'UWB_ui_Equip_Parts_5_C::In_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In_2) == 0x0003C0, "Member 'UWB_ui_Equip_Parts_5_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Out) == 0x0003C8, "Member 'UWB_ui_Equip_Parts_5_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, In) == 0x0003D0, "Member 'UWB_ui_Equip_Parts_5_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Default_none) == 0x0003D8, "Member 'UWB_ui_Equip_Parts_5_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Default) == 0x0003E0, "Member 'UWB_ui_Equip_Parts_5_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, All_Color) == 0x0003E8, "Member 'UWB_ui_Equip_Parts_5_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, CanvasPanel_ViewRange) == 0x0003F0, "Member 'UWB_ui_Equip_Parts_5_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_0) == 0x0003F8, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_2) == 0x000400, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_3) == 0x000408, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_4) == 0x000410, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_5) == 0x000418, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_1L) == 0x000420, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_1L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ChangeLine_1R) == 0x000428, "Member 'UWB_ui_Equip_Parts_5_C::ChangeLine_1R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Line_List) == 0x000430, "Member 'UWB_ui_Equip_Parts_5_C::Line_List' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, List_Set) == 0x000438, "Member 'UWB_ui_Equip_Parts_5_C::List_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, REDScrollBox_1) == 0x000440, "Member 'UWB_ui_Equip_Parts_5_C::REDScrollBox_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Text_equipage_contents_3) == 0x000448, "Member 'UWB_ui_Equip_Parts_5_C::Text_equipage_contents_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, Text_equipage_contents_4) == 0x000450, "Member 'UWB_ui_Equip_Parts_5_C::Text_equipage_contents_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, ItemList) == 0x000458, "Member 'UWB_ui_Equip_Parts_5_C::ItemList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, CursorPos) == 0x000468, "Member 'UWB_ui_Equip_Parts_5_C::CursorPos' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, IsMouseDecide) == 0x00046C, "Member 'UWB_ui_Equip_Parts_5_C::IsMouseDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, FristFlag) == 0x00046D, "Member 'UWB_ui_Equip_Parts_5_C::FristFlag' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, BaseIndex) == 0x000470, "Member 'UWB_ui_Equip_Parts_5_C::BaseIndex' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, SortType) == 0x000474, "Member 'UWB_ui_Equip_Parts_5_C::SortType' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, FlagChangeCursor) == 0x000478, "Member 'UWB_ui_Equip_Parts_5_C::FlagChangeCursor' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, FlagControl) == 0x000479, "Member 'UWB_ui_Equip_Parts_5_C::FlagControl' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_5_C, FlagWeaponSkin) == 0x00047A, "Member 'UWB_ui_Equip_Parts_5_C::FlagWeaponSkin' has a wrong offset!");

}

