#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Caption_Guide_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Caption_Guide_1.WB_ui_Caption_Guide_1_C
// 0x0038 (0x03C0 - 0x0388)
class UWB_ui_Caption_Guide_1_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USpacer*                                Spacer_1;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          GuideFlagSkip;                                     // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsFade;                                            // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Caption_Guide_1(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void Set_Guide(bool FlagSkip, bool FlagPhotoMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Caption_Guide_1_C">();
	}
	static class UWB_ui_Caption_Guide_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Caption_Guide_1_C>();
	}
};
static_assert(alignof(UWB_ui_Caption_Guide_1_C) == 0x000008, "Wrong alignment on UWB_ui_Caption_Guide_1_C");
static_assert(sizeof(UWB_ui_Caption_Guide_1_C) == 0x0003C0, "Wrong size on UWB_ui_Caption_Guide_1_C");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Caption_Guide_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, Out) == 0x000390, "Member 'UWB_ui_Caption_Guide_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, In) == 0x000398, "Member 'UWB_ui_Caption_Guide_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, Default) == 0x0003A0, "Member 'UWB_ui_Caption_Guide_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, Spacer_1) == 0x0003A8, "Member 'UWB_ui_Caption_Guide_1_C::Spacer_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, WB_ui_Guide) == 0x0003B0, "Member 'UWB_ui_Caption_Guide_1_C::WB_ui_Guide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, GuideFlagSkip) == 0x0003B8, "Member 'UWB_ui_Caption_Guide_1_C::GuideFlagSkip' has a wrong offset!");
static_assert(offsetof(UWB_ui_Caption_Guide_1_C, IsFade) == 0x0003B9, "Member 'UWB_ui_Caption_Guide_1_C::IsFade' has a wrong offset!");

}

