#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TitleLogo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_TitleLogo.WB_ui_TitleLogo_C
// 0x0028 (0x0480 - 0x0458)
class UWB_ui_TitleLogo_C final : public UUITitleLogo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Title_image;                                       // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_TitleLogo(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_TitleLogo_C">();
	}
	static class UWB_ui_TitleLogo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_TitleLogo_C>();
	}
};
static_assert(alignof(UWB_ui_TitleLogo_C) == 0x000008, "Wrong alignment on UWB_ui_TitleLogo_C");
static_assert(sizeof(UWB_ui_TitleLogo_C) == 0x000480, "Wrong size on UWB_ui_TitleLogo_C");
static_assert(offsetof(UWB_ui_TitleLogo_C, UberGraphFrame) == 0x000458, "Member 'UWB_ui_TitleLogo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_TitleLogo_C, Default) == 0x000460, "Member 'UWB_ui_TitleLogo_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_TitleLogo_C, Out) == 0x000468, "Member 'UWB_ui_TitleLogo_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_TitleLogo_C, In) == 0x000470, "Member 'UWB_ui_TitleLogo_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_TitleLogo_C, Title_image) == 0x000478, "Member 'UWB_ui_TitleLogo_C::Title_image' has a wrong offset!");

}

