#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Success

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Success.WB_ui_Success_C
// 0x0068 (0x03F0 - 0x0388)
class UWB_ui_Success_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Success_1;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ARSCharacterBase*                       Player;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Offset;                                            // 0x03E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Success(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetMessage();
	void UpdatePosition();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Success_C">();
	}
	static class UWB_ui_Success_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Success_C>();
	}
};
static_assert(alignof(UWB_ui_Success_C) == 0x000008, "Wrong alignment on UWB_ui_Success_C");
static_assert(sizeof(UWB_ui_Success_C) == 0x0003F0, "Wrong size on UWB_ui_Success_C");
static_assert(offsetof(UWB_ui_Success_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Success_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Out) == 0x000390, "Member 'UWB_ui_Success_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, In) == 0x000398, "Member 'UWB_ui_Success_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Default) == 0x0003A0, "Member 'UWB_ui_Success_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, All_Color) == 0x0003A8, "Member 'UWB_ui_Success_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Base_1) == 0x0003B0, "Member 'UWB_ui_Success_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Base_2) == 0x0003B8, "Member 'UWB_ui_Success_C::Base_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Glow) == 0x0003C0, "Member 'UWB_ui_Success_C::Glow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Noise) == 0x0003C8, "Member 'UWB_ui_Success_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Text_Success_1) == 0x0003D0, "Member 'UWB_ui_Success_C::Text_Success_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Player) == 0x0003D8, "Member 'UWB_ui_Success_C::Player' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Timer) == 0x0003E0, "Member 'UWB_ui_Success_C::Timer' has a wrong offset!");
static_assert(offsetof(UWB_ui_Success_C, Offset) == 0x0003E4, "Member 'UWB_ui_Success_C::Offset' has a wrong offset!");

}

