#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_skill_parts_2

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.ExecuteUbergraph_WB_ui_SasLink_skill_parts_2
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2) == 0x000014, "Wrong size on WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2, EntryPoint) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2, K2Node_Event_State) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_SasLink_skill_parts_2_C_ExecuteUbergraph_WB_ui_SasLink_skill_parts_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_UpdateState");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_SasLink_skill_parts_2_C_UpdateState");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_UpdateState, State) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_2_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_2_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_StateNone");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_StateNone) == 0x000008, "Wrong size on WB_ui_SasLink_skill_parts_2_C_StateNone");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_2_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.StateLoop
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _WorkSubState;                                     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue_1;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_StateLoop");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_StateLoop) == 0x000010, "Wrong size on WB_ui_SasLink_skill_parts_2_C_StateLoop");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, _WorkSubState) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::_WorkSubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, CallFunc_NotEqual_BoolBool_ReturnValue_1) == 0x000009, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::CallFunc_NotEqual_BoolBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x00000A, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x00000B, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x00000C, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, CallFunc_BooleanOR_ReturnValue) == 0x00000D, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoop, K2Node_SwitchInteger_CmpSuccess_1) == 0x00000E, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoop::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.StateLoopSelect
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_StateLoopSelect final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay_1;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect) == 0x000004, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_StateLoopSelect");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect) == 0x000008, "Wrong size on WB_ui_SasLink_skill_parts_2_C_StateLoopSelect");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect, SubState) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoopSelect::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoopSelect::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoopSelect::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000006, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_StateLoopSelect, CallFunc_IsPlayUICurrentAnimation_isPlay_1) == 0x000007, "Member 'WB_ui_SasLink_skill_parts_2_C_StateLoopSelect::CallFunc_IsPlayUICurrentAnimation_isPlay_1' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.SetText
// 0x0070 (0x0070 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_SetText final
{
public:
	int32                                         LV;                                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_513A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FName>                           _MessageLvList;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_SetText) == 0x000008, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_SetText");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_SetText) == 0x000070, "Wrong size on WB_ui_SasLink_skill_parts_2_C_SetText");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, LV) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::LV' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, Text) == 0x000008, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, _MessageLvList) == 0x000020, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::_MessageLvList' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, CallFunc_GetDataBaseManager_Manager) == 0x000030, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, K2Node_MakeArray_Array) == 0x000038, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, CallFunc_GetText_ReturnValue) == 0x000048, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WB_ui_SasLink_skill_parts_2_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_SetSelect final
{
public:
	bool                                          Param_IsSelect;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_SetSelect) == 0x000001, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_SetSelect");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_SetSelect) == 0x000001, "Wrong size on WB_ui_SasLink_skill_parts_2_C_SetSelect");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetSelect, Param_IsSelect) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_SetSelect::Param_IsSelect' has a wrong offset!");

// Function WB_ui_SasLink_skill_parts_2.WB_ui_SasLink_skill_parts_2_C.SetDisable
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_SasLink_skill_parts_2_C_SetDisable final
{
public:
	bool                                          Param_IsDisable;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasLink_skill_parts_2_C_SetDisable) == 0x000001, "Wrong alignment on WB_ui_SasLink_skill_parts_2_C_SetDisable");
static_assert(sizeof(WB_ui_SasLink_skill_parts_2_C_SetDisable) == 0x000001, "Wrong size on WB_ui_SasLink_skill_parts_2_C_SetDisable");
static_assert(offsetof(WB_ui_SasLink_skill_parts_2_C_SetDisable, Param_IsDisable) == 0x000000, "Member 'WB_ui_SasLink_skill_parts_2_C_SetDisable::Param_IsDisable' has a wrong offset!");

}

