#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Enemy_Info_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Enemy_Info_Parts_2.WB_ui_Enemy_Info_Parts_2_C
// 0x0028 (0x03C0 - 0x0398)
class UWB_ui_Enemy_Info_Parts_2_C final : public UUIEnemyDropItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Frame_Icon;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_item_2;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Enemy_Info_Parts_2(int32 EntryPoint);
	void SetInfoBP(int32 ItemIconId, EItemRarity ItemRariy);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Enemy_Info_Parts_2_C">();
	}
	static class UWB_ui_Enemy_Info_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Enemy_Info_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_Enemy_Info_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_Enemy_Info_Parts_2_C");
static_assert(sizeof(UWB_ui_Enemy_Info_Parts_2_C) == 0x0003C0, "Wrong size on UWB_ui_Enemy_Info_Parts_2_C");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_2_C, UberGraphFrame) == 0x000398, "Member 'UWB_ui_Enemy_Info_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_2_C, Default) == 0x0003A0, "Member 'UWB_ui_Enemy_Info_Parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_2_C, Frame_Icon) == 0x0003A8, "Member 'UWB_ui_Enemy_Info_Parts_2_C::Frame_Icon' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_2_C, Icon) == 0x0003B0, "Member 'UWB_ui_Enemy_Info_Parts_2_C::Icon' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_2_C, Text_enemy_item_2) == 0x0003B8, "Member 'UWB_ui_Enemy_Info_Parts_2_C::Text_enemy_item_2' has a wrong offset!");

}

