#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_DetailMap_Parts_4

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_DetailMap_Parts_4.WB_ui_DetailMap_Parts_4_C.ExecuteUbergraph_WB_ui_DetailMap_Parts_4
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4) == 0x000004, "Wrong alignment on WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4");
static_assert(sizeof(WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4) == 0x000008, "Wrong size on WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4, EntryPoint) == 0x000000, "Member 'WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4, CallFunc_GetPlatformType_ReturnValue) == 0x000004, "Member 'WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WB_ui_DetailMap_Parts_4_C_ExecuteUbergraph_WB_ui_DetailMap_Parts_4::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_4.WB_ui_DetailMap_Parts_4_C.SetStringName
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_DetailMap_Parts_4_C_SetStringName final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WB_ui_DetailMap_Parts_4_C_SetStringName) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_4_C_SetStringName");
static_assert(sizeof(WB_ui_DetailMap_Parts_4_C_SetStringName) == 0x000018, "Wrong size on WB_ui_DetailMap_Parts_4_C_SetStringName");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_SetStringName, Param_Name) == 0x000000, "Member 'WB_ui_DetailMap_Parts_4_C_SetStringName::Param_Name' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_4.WB_ui_DetailMap_Parts_4_C.InitializeAreaFixString
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString");
static_assert(sizeof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString) == 0x000030, "Wrong size on WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString, CallFunc_GetDataBaseManager_Manager_1) == 0x000008, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString, CallFunc_GetText_ReturnValue_1) == 0x000020, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeAreaFixString::CallFunc_GetText_ReturnValue_1' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_4.WB_ui_DetailMap_Parts_4_C.InitializeBlockFixString
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString final
{
public:
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager_1;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString) == 0x000008, "Wrong alignment on WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString");
static_assert(sizeof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString) == 0x000030, "Wrong size on WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString, CallFunc_GetDataBaseManager_Manager) == 0x000000, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString, CallFunc_GetDataBaseManager_Manager_1) == 0x000008, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString::CallFunc_GetDataBaseManager_Manager_1' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString, CallFunc_GetText_ReturnValue_1) == 0x000020, "Member 'WB_ui_DetailMap_Parts_4_C_InitializeBlockFixString::CallFunc_GetText_ReturnValue_1' has a wrong offset!");

// Function WB_ui_DetailMap_Parts_4.WB_ui_DetailMap_Parts_4_C.setGuide
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_DetailMap_Parts_4_C_SetGuide final
{
public:
	bool                                          Param_SetGuide;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_DetailMap_Parts_4_C_SetGuide) == 0x000001, "Wrong alignment on WB_ui_DetailMap_Parts_4_C_SetGuide");
static_assert(sizeof(WB_ui_DetailMap_Parts_4_C_SetGuide) == 0x000001, "Wrong size on WB_ui_DetailMap_Parts_4_C_SetGuide");
static_assert(offsetof(WB_ui_DetailMap_Parts_4_C_SetGuide, Param_SetGuide) == 0x000000, "Member 'WB_ui_DetailMap_Parts_4_C_SetGuide::Param_SetGuide' has a wrong offset!");

}

