#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_TeamKizuna

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_TeamKizuna.WB_ui_TeamKizuna_C
// 0x0060 (0x03E8 - 0x0388)
class UWB_ui_TeamKizuna_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out_max;                                           // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_max;                                            // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_max;                                       // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Area_here01;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_TeamKizuna_1;                                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_TeamKizuna_Level_1;                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsMax;                                             // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_TeamKizuna(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void UpdateBondLevel();
	void SetBaseText();
	void SetTeamBondsLevel();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_TeamKizuna_C">();
	}
	static class UWB_ui_TeamKizuna_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_TeamKizuna_C>();
	}
};
static_assert(alignof(UWB_ui_TeamKizuna_C) == 0x000008, "Wrong alignment on UWB_ui_TeamKizuna_C");
static_assert(sizeof(UWB_ui_TeamKizuna_C) == 0x0003E8, "Wrong size on UWB_ui_TeamKizuna_C");
static_assert(offsetof(UWB_ui_TeamKizuna_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_TeamKizuna_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Out_max) == 0x000390, "Member 'UWB_ui_TeamKizuna_C::Out_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, In_max) == 0x000398, "Member 'UWB_ui_TeamKizuna_C::In_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Default_max) == 0x0003A0, "Member 'UWB_ui_TeamKizuna_C::Default_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Out) == 0x0003A8, "Member 'UWB_ui_TeamKizuna_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, In) == 0x0003B0, "Member 'UWB_ui_TeamKizuna_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Default) == 0x0003B8, "Member 'UWB_ui_TeamKizuna_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Area_here01) == 0x0003C0, "Member 'UWB_ui_TeamKizuna_C::Area_here01' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Frame_Grow) == 0x0003C8, "Member 'UWB_ui_TeamKizuna_C::Frame_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Text_TeamKizuna_1) == 0x0003D0, "Member 'UWB_ui_TeamKizuna_C::Text_TeamKizuna_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, Text_TeamKizuna_Level_1) == 0x0003D8, "Member 'UWB_ui_TeamKizuna_C::Text_TeamKizuna_Level_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_TeamKizuna_C, IsMax) == 0x0003E0, "Member 'UWB_ui_TeamKizuna_C::IsMax' has a wrong offset!");

}

