#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Shop_EStatus_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Shop_EStatus_Parts_1.WB_ui_Shop_EStatus_Parts_1_C
// 0x0070 (0x0458 - 0x03E8)
class UWB_ui_Shop_EStatus_Parts_1_C final : public UUIShopPartyStatus
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                All_Color;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chara_Set_Base_1;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chara_Set_Frame_1;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_1;                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_2;                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_3;                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_4;                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_5;                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_6;                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_7;                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_8;                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_9;                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Shop_EStatus_Parts_2_C*          WB_ui_Shop_EStatus_Parts_2_10;                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Shop_EStatus_Parts_1(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Shop_EStatus_Parts_1_C">();
	}
	static class UWB_ui_Shop_EStatus_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Shop_EStatus_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_Shop_EStatus_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_Shop_EStatus_Parts_1_C");
static_assert(sizeof(UWB_ui_Shop_EStatus_Parts_1_C) == 0x000458, "Wrong size on UWB_ui_Shop_EStatus_Parts_1_C");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, UberGraphFrame) == 0x0003E8, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, All_Color) == 0x0003F0, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, Chara_Set_Base_1) == 0x0003F8, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::Chara_Set_Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, Chara_Set_Frame_1) == 0x000400, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::Chara_Set_Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_1) == 0x000408, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_2) == 0x000410, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_3) == 0x000418, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_4) == 0x000420, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_5) == 0x000428, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_6) == 0x000430, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_7) == 0x000438, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_8) == 0x000440, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_8' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_9) == 0x000448, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_9' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_1_C, WB_ui_Shop_EStatus_Parts_2_10) == 0x000450, "Member 'UWB_ui_Shop_EStatus_Parts_1_C::WB_ui_Shop_EStatus_Parts_2_10' has a wrong offset!");

}

