#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Shop_EStatus_Parts_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Shop_EStatus_Parts_2.WB_ui_Shop_EStatus_Parts_2_C
// 0x00B8 (0x0560 - 0x04A8)
class UWB_ui_Shop_EStatus_Parts_2_C final : public UUIShopPartyStatusIcon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unselect_max;                                      // 0x04B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_max;                                       // 0x04B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unselect;                                          // 0x04C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x04C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizonFlipbookWidget*                 Arrow_1_L;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizonFlipbookWidget*                 Arrow_1_R;                                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizonFlipbookWidget*                 Arrow_2_L;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizonFlipbookWidget*                 Arrow_2_R;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Bond_Set;                                          // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EStatus_L;                                         // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EStatus_R;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a2;                                           // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_done;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_E;                                            // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Parameter_L;                                  // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Parameter_R;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_skin;                                         // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Shop_info_bond_1num;                          // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_param_num_1;                             // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_shop_param_num_2;                             // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Shop_EStatus_Parts_2(int32 EntryPoint);
	void OnInitialized();
	void SetEquipOrLoveIcon(EEquipOrLoveIcon Type);
	void SetParameterIcon(int32 Param_Index, int32 Icon);
	void SetFaceIcon(EPlayerID CharacterId);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Shop_EStatus_Parts_2_C">();
	}
	static class UWB_ui_Shop_EStatus_Parts_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Shop_EStatus_Parts_2_C>();
	}
};
static_assert(alignof(UWB_ui_Shop_EStatus_Parts_2_C) == 0x000008, "Wrong alignment on UWB_ui_Shop_EStatus_Parts_2_C");
static_assert(sizeof(UWB_ui_Shop_EStatus_Parts_2_C) == 0x000560, "Wrong size on UWB_ui_Shop_EStatus_Parts_2_C");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, UberGraphFrame) == 0x0004A8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Unselect_max) == 0x0004B0, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Unselect_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Default_max) == 0x0004B8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Default_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Unselect) == 0x0004C0, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Unselect' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Default_none) == 0x0004C8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Default) == 0x0004D0, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Arrow_1_L) == 0x0004D8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Arrow_1_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Arrow_1_R) == 0x0004E0, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Arrow_1_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Arrow_2_L) == 0x0004E8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Arrow_2_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Arrow_2_R) == 0x0004F0, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Arrow_2_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Bond_Set) == 0x0004F8, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Bond_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, EStatus_L) == 0x000500, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::EStatus_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, EStatus_R) == 0x000508, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::EStatus_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Face_a2) == 0x000510, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Face_a2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Frame) == 0x000518, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Icon_done) == 0x000520, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Icon_done' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Icon_E) == 0x000528, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Icon_E' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Icon_Parameter_L) == 0x000530, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Icon_Parameter_L' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Icon_Parameter_R) == 0x000538, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Icon_Parameter_R' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Icon_skin) == 0x000540, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Icon_skin' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Text_Shop_info_bond_1num) == 0x000548, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Text_Shop_info_bond_1num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Text_shop_param_num_1) == 0x000550, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Text_shop_param_num_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Shop_EStatus_Parts_2_C, Text_shop_param_num_2) == 0x000558, "Member 'UWB_ui_Shop_EStatus_Parts_2_C::Text_shop_param_num_2' has a wrong offset!");

}

