#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Vitality_en_01_frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Vitality_en_01_frame.WB_ui_Vitality_en_01_frame_C
// 0x0080 (0x0498 - 0x0418)
class UWB_ui_Vitality_en_01_frame_C final : public UUIVitalityEN01
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0418(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               All;                                               // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 brain_crash_frame;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guage_frame;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status01;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status02;                                     // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status03;                                     // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status04;                                     // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Status05;                                     // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_en_01;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_en_LV_1;                                      // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_en_LV_1_num;                                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Vitality_en_01_frame(int32 EntryPoint);
	void SetLevel(int32 Level);
	void SetIcon2(class UImage* Icon, int32 Param_Index);
	void SetIcon1(class UImage* Icon, int32 Param_Index);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Vitality_en_01_frame_C">();
	}
	static class UWB_ui_Vitality_en_01_frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Vitality_en_01_frame_C>();
	}
};
static_assert(alignof(UWB_ui_Vitality_en_01_frame_C) == 0x000008, "Wrong alignment on UWB_ui_Vitality_en_01_frame_C");
static_assert(sizeof(UWB_ui_Vitality_en_01_frame_C) == 0x000498, "Wrong size on UWB_ui_Vitality_en_01_frame_C");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, UberGraphFrame) == 0x000418, "Member 'UWB_ui_Vitality_en_01_frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Default_none) == 0x000420, "Member 'UWB_ui_Vitality_en_01_frame_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Out) == 0x000428, "Member 'UWB_ui_Vitality_en_01_frame_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, In) == 0x000430, "Member 'UWB_ui_Vitality_en_01_frame_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Default) == 0x000438, "Member 'UWB_ui_Vitality_en_01_frame_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, All) == 0x000440, "Member 'UWB_ui_Vitality_en_01_frame_C::All' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, brain_crash_frame) == 0x000448, "Member 'UWB_ui_Vitality_en_01_frame_C::brain_crash_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Guage_frame) == 0x000450, "Member 'UWB_ui_Vitality_en_01_frame_C::Guage_frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Icon_Status01) == 0x000458, "Member 'UWB_ui_Vitality_en_01_frame_C::Icon_Status01' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Icon_Status02) == 0x000460, "Member 'UWB_ui_Vitality_en_01_frame_C::Icon_Status02' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Icon_Status03) == 0x000468, "Member 'UWB_ui_Vitality_en_01_frame_C::Icon_Status03' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Icon_Status04) == 0x000470, "Member 'UWB_ui_Vitality_en_01_frame_C::Icon_Status04' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Icon_Status05) == 0x000478, "Member 'UWB_ui_Vitality_en_01_frame_C::Icon_Status05' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Text_en_01) == 0x000480, "Member 'UWB_ui_Vitality_en_01_frame_C::Text_en_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Text_en_LV_1) == 0x000488, "Member 'UWB_ui_Vitality_en_01_frame_C::Text_en_LV_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Vitality_en_01_frame_C, Text_en_LV_1_num) == 0x000490, "Member 'UWB_ui_Vitality_en_01_frame_C::Text_en_LV_1_num' has a wrong offset!");

}

