#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MapGuide

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_MapGuide.WB_ui_MapGuide_C.ExecuteUbergraph_WB_ui_MapGuide
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AC[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_ui_MapGuide_Parts_1_C*>      K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide) == 0x000008, "Wrong alignment on WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide");
static_assert(sizeof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide) == 0x000028, "Wrong size on WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, EntryPoint) == 0x000000, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, K2Node_Event_State) == 0x000004, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide, K2Node_MakeArray_Array) == 0x000018, "Member 'WB_ui_MapGuide_C_ExecuteUbergraph_WB_ui_MapGuide::K2Node_MakeArray_Array' has a wrong offset!");

// Function WB_ui_MapGuide.WB_ui_MapGuide_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_MapGuide_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MapGuide_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_MapGuide_C_UpdateState");
static_assert(sizeof(WB_ui_MapGuide_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_MapGuide_C_UpdateState");
static_assert(offsetof(WB_ui_MapGuide_C_UpdateState, State) == 0x000000, "Member 'WB_ui_MapGuide_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_MapGuide_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_MapGuide_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_MapGuide.WB_ui_MapGuide_C.StateNone
// 0x001C (0x001C - 0x0000)
struct WB_ui_MapGuide_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AD[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MapGuide_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_MapGuide_C_StateNone");
static_assert(sizeof(WB_ui_MapGuide_C_StateNone) == 0x00001C, "Wrong size on WB_ui_MapGuide_C_StateNone");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_MapGuide_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_MapGuide_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_ui_MapGuide_C_StateNone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WB_ui_MapGuide_C_StateNone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_MapGuide_C_StateNone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'WB_ui_MapGuide_C_StateNone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateNone, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_MapGuide_C_StateNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_MapGuide.WB_ui_MapGuide_C.StateLoop
// 0x0040 (0x0040 - 0x0000)
struct WB_ui_MapGuide_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _IsEnd;                                            // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95AE[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95AF[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isVisibleAreaHere_visibleFlag;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B0[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B1[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MapGuide_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_MapGuide_C_StateLoop");
static_assert(sizeof(WB_ui_MapGuide_C_StateLoop) == 0x000040, "Wrong size on WB_ui_MapGuide_C_StateLoop");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_MapGuide_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, _IsEnd) == 0x000004, "Member 'WB_ui_MapGuide_C_StateLoop::_IsEnd' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_MapGuide_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_ui_MapGuide_C_StateLoop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000010, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_isVisibleAreaHere_visibleFlag) == 0x000018, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_isVisibleAreaHere_visibleFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WB_ui_MapGuide_C_StateLoop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WB_ui_MapGuide_C_StateLoop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'WB_ui_MapGuide_C_StateLoop::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_IsPlaying_IsPlaying) == 0x000031, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_IsPlaying_IsPlaying' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003C, "Member 'WB_ui_MapGuide_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_MapGuide.WB_ui_MapGuide_C.SetupGuide
// 0x0148 (0x0148 - 0x0000)
struct WB_ui_MapGuide_C_SetupGuide final
{
public:
	bool                                          _VisionSimulatorFlag;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          _LockFlag;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B2[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _index;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFlagManager*                           _FlagManager;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDatabaseManager*                       _Manager;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B3[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95B4[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_LevelManager_C*                     CallFunc_GetLevelManager_LevelManager;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidCurrentSimulatorLevelInfosName_ReturnValue; // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B5[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B6[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_islockInputSubMenu_ReturnValue;           // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OperationRestrictionFlagCheck_ReturnValue; // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OperationRestrictionFlagCheck_ReturnValue_1; // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B7[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSGameInstanceBP_C*                    CallFunc_GetRSGameInstance_AsRSGame_Instance_BP;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B8[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFlagManager*                           CallFunc_GetFlagManager_ReturnValue;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WorldmapIsAllLocationNotSelectable_ReturnValue; // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95B9[0x3];                                     // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95BA[0x7];                                     // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item_3;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95BB[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95BC[0x4];                                     // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item_4;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_3;                    // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsContentsOpened_ReturnValue;             // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95BD[0x1];                                     // 0x011B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95BE[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsContentsOpened_ReturnValue_1;           // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95BF[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_MapGuide_Parts_1_C*              CallFunc_Array_Get_Item_5;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_MapGuide_C_SetupGuide) == 0x000008, "Wrong alignment on WB_ui_MapGuide_C_SetupGuide");
static_assert(sizeof(WB_ui_MapGuide_C_SetupGuide) == 0x000148, "Wrong size on WB_ui_MapGuide_C_SetupGuide");
static_assert(offsetof(WB_ui_MapGuide_C_SetupGuide, _VisionSimulatorFlag) == 0x000000, "Member 'WB_ui_MapGuide_C_SetupGuide::_VisionSimulatorFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_SetupGuide, _LockFlag) == 0x000001, "Member 'WB_ui_MapGuide_C_SetupGuide::_LockFlag' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_SetupGuide, _index) == 0x000004, "Member 'WB_ui_MapGuide_C_SetupGuide::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_MapGuide_C_SetupGuide, _FlagManager) == 0x000008, "Member 'WB_ui_MapGuide_C_SetupGuide::_FlagManager' has a wrong offset!");
