#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Present_next

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Present_next.WB_ui_Present_next_C
// 0x00A0 (0x0430 - 0x0390)
class UWB_ui_Present_next_C final : public UUIPresentNext
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_none;                                      // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Out;                                               // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base;                                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Choice_Base;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Choice_Grow;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Choice_pattern;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_BG;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Frame;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Noise;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Present;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Shade;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   PresentID;                                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Present_next(int32 EntryPoint);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void LoadTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Present_next_C">();
	}
	static class UWB_ui_Present_next_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Present_next_C>();
	}
};
static_assert(alignof(UWB_ui_Present_next_C) == 0x000008, "Wrong alignment on UWB_ui_Present_next_C");
static_assert(sizeof(UWB_ui_Present_next_C) == 0x000430, "Wrong size on UWB_ui_Present_next_C");
static_assert(offsetof(UWB_ui_Present_next_C, UberGraphFrame) == 0x000390, "Member 'UWB_ui_Present_next_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Default_none) == 0x000398, "Member 'UWB_ui_Present_next_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Out) == 0x0003A0, "Member 'UWB_ui_Present_next_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, In) == 0x0003A8, "Member 'UWB_ui_Present_next_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Default) == 0x0003B0, "Member 'UWB_ui_Present_next_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Base) == 0x0003B8, "Member 'UWB_ui_Present_next_C::Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, CA_Image_Blue) == 0x0003C0, "Member 'UWB_ui_Present_next_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, CA_Image_Green) == 0x0003C8, "Member 'UWB_ui_Present_next_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, CA_Image_Red) == 0x0003D0, "Member 'UWB_ui_Present_next_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, CA_RetainerBox) == 0x0003D8, "Member 'UWB_ui_Present_next_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Choice_Base) == 0x0003E0, "Member 'UWB_ui_Present_next_C::Choice_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Choice_Grow) == 0x0003E8, "Member 'UWB_ui_Present_next_C::Choice_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Choice_pattern) == 0x0003F0, "Member 'UWB_ui_Present_next_C::Choice_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Noise) == 0x0003F8, "Member 'UWB_ui_Present_next_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Thumbnail_BG) == 0x000400, "Member 'UWB_ui_Present_next_C::Thumbnail_BG' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Thumbnail_Frame) == 0x000408, "Member 'UWB_ui_Present_next_C::Thumbnail_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Thumbnail_Noise) == 0x000410, "Member 'UWB_ui_Present_next_C::Thumbnail_Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Thumbnail_Present) == 0x000418, "Member 'UWB_ui_Present_next_C::Thumbnail_Present' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, Thumbnail_Shade) == 0x000420, "Member 'UWB_ui_Present_next_C::Thumbnail_Shade' has a wrong offset!");
static_assert(offsetof(UWB_ui_Present_next_C, PresentID) == 0x000428, "Member 'UWB_ui_Present_next_C::PresentID' has a wrong offset!");

}

