#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Area_next

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_Area_next.WB_ui_Area_next_C.ExecuteUbergraph_WB_ui_Area_next
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next) == 0x000004, "Wrong alignment on WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next");
static_assert(sizeof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next) == 0x000010, "Wrong size on WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next");
static_assert(offsetof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next, EntryPoint) == 0x000000, "Member 'WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next, K2Node_Event_State) == 0x000004, "Member 'WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_Area_next_C_ExecuteUbergraph_WB_ui_Area_next::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_Area_next.WB_ui_Area_next_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Area_next_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Area_next_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Area_next_C_UpdateState");
static_assert(sizeof(WB_ui_Area_next_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Area_next_C_UpdateState");
static_assert(offsetof(WB_ui_Area_next_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Area_next_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Area_next_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Area_next_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Area_next.WB_ui_Area_next_C.Start
// 0x0130 (0x0130 - 0x0000)
struct WB_ui_Area_next_C_Start final
{
public:
	int32                                         LocationId;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaId;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PortalID;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWorldMap;                                        // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D42[0x2];                                     // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AMessageHudManager*                     CallFunc_GetMessageHudManager_MessageHudManager;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Start_ReturnValue;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D43[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0070(0x0018)()
	class AActionManager*                         CallFunc_GetActionManager_ActionManager;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UDatabaseManager*                       CallFunc_GetDataBaseManager_Manager;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue;                      // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_1;                    // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetText_ReturnValue_2;                    // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Area_next_C_Start) == 0x000008, "Wrong alignment on WB_ui_Area_next_C_Start");
static_assert(sizeof(WB_ui_Area_next_C_Start) == 0x000130, "Wrong size on WB_ui_Area_next_C_Start");
static_assert(offsetof(WB_ui_Area_next_C_Start, LocationId) == 0x000000, "Member 'WB_ui_Area_next_C_Start::LocationId' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, AreaId) == 0x000004, "Member 'WB_ui_Area_next_C_Start::AreaId' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, PortalID) == 0x000008, "Member 'WB_ui_Area_next_C_Start::PortalID' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, IsWorldMap) == 0x00000C, "Member 'WB_ui_Area_next_C_Start::IsWorldMap' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, ReturnValue) == 0x00000D, "Member 'WB_ui_Area_next_C_Start::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetMessageHudManager_MessageHudManager) == 0x000010, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetMessageHudManager_MessageHudManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Start_ReturnValue) == 0x000018, "Member 'WB_ui_Area_next_C_Start::CallFunc_Start_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000060, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000070, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetActionManager_ActionManager) == 0x000088, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetActionManager_ActionManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000090, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A0, "Member 'WB_ui_Area_next_C_Start::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetDataBaseManager_Manager) == 0x0000B0, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetDataBaseManager_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B8, "Member 'WB_ui_Area_next_C_Start::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetText_ReturnValue) == 0x0000C8, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'WB_ui_Area_next_C_Start::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000E8, "Member 'WB_ui_Area_next_C_Start::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetText_ReturnValue_1) == 0x0000F8, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000108, "Member 'WB_ui_Area_next_C_Start::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_Conv_StringToName_ReturnValue) == 0x000118, "Member 'WB_ui_Area_next_C_Start::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_Start, CallFunc_GetText_ReturnValue_2) == 0x000120, "Member 'WB_ui_Area_next_C_Start::CallFunc_GetText_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Area_next.WB_ui_Area_next_C.End
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Area_next_C_End final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D44[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActionManager*                         CallFunc_GetActionManager_ActionManager;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Area_next_C_End) == 0x000008, "Wrong alignment on WB_ui_Area_next_C_End");
static_assert(sizeof(WB_ui_Area_next_C_End) == 0x000010, "Wrong size on WB_ui_Area_next_C_End");
static_assert(offsetof(WB_ui_Area_next_C_End, ReturnValue) == 0x000000, "Member 'WB_ui_Area_next_C_End::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Area_next_C_End, CallFunc_GetActionManager_ActionManager) == 0x000008, "Member 'WB_ui_Area_next_C_End::CallFunc_GetActionManager_ActionManager' has a wrong offset!");

}

