#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasLink_popup_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "E_SASKind_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_SasLink_popup_1.WB_ui_SasLink_popup_1_C
// 0x01A0 (0x0530 - 0x0390)
class UWB_ui_SasLink_popup_1_C final : public UUISASLinkPopup
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_max_out;                                   // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_max_in;                                    // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_out;                                       // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_in;                                        // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_max;                                       // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All;                                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Info;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bond_Base;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cover_Black;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Face_a2;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_List_1;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_List_2;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Movie_Line_1;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Movie_Line_2;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          REDScrollBox_1;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SAS_Base;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_frame_pattern;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_icon_add;                                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_Image_1;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Sas_Image_2;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_List_Frame_2;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_List_Frame_1_under;                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Skill_List_Frame_1_up;                             // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_bond_4_num;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_charaname_3;                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_info_1;                               // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_sasname_3;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_saslink_sasname_4;                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Base;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Frame;                                    // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Shade;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Guide_C*                         WB_ui_Guide;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_SasLink_skill_parts_2_C*> SkillStatusList;                                   // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	EPlayerID                                     CharaID;                                           // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B15[0x3];                                     // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         bondsLevel;                                        // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxBondsLevel;                                     // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CursorIndex;                                       // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagViewMode;                                      // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B16[0x7];                                     // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MovieManager_C*                     MovieManager;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StateMovie;                                        // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagSetMovie;                                      // 0x04FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagCloseMovie;                                    // 0x04FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B17[0x2];                                     // 0x04FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MoviePath;                                         // 0x0500(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 PlayerId;                                          // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          FlagViewEx1;                                       // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagViewEx2;                                       // 0x0521(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagKasane;                                        // 0x0522(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagEnableDLC1;                                    // 0x0523(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagEnableDLC2;                                    // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B18[0x3];                                     // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxCell;                                           // 0x0528(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlatformPS;                                      // 0x052C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_SasLink_popup_1(int32 EntryPoint);
	void Event_LeftDown_Mouse(int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_UnFocus_Mouse(int32 IsMouseScroll, int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_Focus_Mouse(int32 IsMouseScroll, int32 Param_Cursor, class UUserWidget* PWidget);
	void Event_UnFocus(class UUserWidget* PWidget);
	void Event_Focus(class UUserWidget* PWidget);
	void Event_UpdateElement(int32 Param_Index, class UUserWidget* PWidget);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetCharacter(EPlayerID Param_CharaID, bool IsEnableDLC1, bool IsEnableDLC2);
	void Setup();
	void MoveCursor();
	void IsBondMax(bool* IsMax);
	void UpdateSasText();
	void PCSasSelectEnable(bool Enable);
	void SetupGuide();
	void UpdateSasElement(class UWB_ui_SasLink_skill_parts_2_C* Element, int32 Param_Index);
	void SetViewMode(bool IsViewMode, bool IsEx1, bool IsEx2);
	void Set_Current_CursorPosition(int32 Position);
	void InitializeMovie();
	void UpdateMovie();
	void CreateMoviePath();
	void EndMovie();
	void UpdateTexture();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_SasLink_popup_1_C">();
	}
	static class UWB_ui_SasLink_popup_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_SasLink_popup_1_C>();
	}
};
static_assert(alignof(UWB_ui_SasLink_popup_1_C) == 0x000008, "Wrong alignment on UWB_ui_SasLink_popup_1_C");
static_assert(sizeof(UWB_ui_SasLink_popup_1_C) == 0x000530, "Wrong size on UWB_ui_SasLink_popup_1_C");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, UberGraphFrame) == 0x000390, "Member 'UWB_ui_SasLink_popup_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default_max_out) == 0x000398, "Member 'UWB_ui_SasLink_popup_1_C::Default_max_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default_max_in) == 0x0003A0, "Member 'UWB_ui_SasLink_popup_1_C::Default_max_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default_out) == 0x0003A8, "Member 'UWB_ui_SasLink_popup_1_C::Default_out' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default_in) == 0x0003B0, "Member 'UWB_ui_SasLink_popup_1_C::Default_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default_max) == 0x0003B8, "Member 'UWB_ui_SasLink_popup_1_C::Default_max' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Default) == 0x0003C0, "Member 'UWB_ui_SasLink_popup_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, All) == 0x0003C8, "Member 'UWB_ui_SasLink_popup_1_C::All' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Base_Info) == 0x0003D0, "Member 'UWB_ui_SasLink_popup_1_C::Base_Info' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Bond_Base) == 0x0003D8, "Member 'UWB_ui_SasLink_popup_1_C::Bond_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, CanvasPanel_ViewRange) == 0x0003E0, "Member 'UWB_ui_SasLink_popup_1_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Cover_Black) == 0x0003E8, "Member 'UWB_ui_SasLink_popup_1_C::Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Face_a2) == 0x0003F0, "Member 'UWB_ui_SasLink_popup_1_C::Face_a2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Frame_List_1) == 0x0003F8, "Member 'UWB_ui_SasLink_popup_1_C::Frame_List_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Frame_List_2) == 0x000400, "Member 'UWB_ui_SasLink_popup_1_C::Frame_List_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Icon_font_1) == 0x000408, "Member 'UWB_ui_SasLink_popup_1_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Movie_Line_1) == 0x000410, "Member 'UWB_ui_SasLink_popup_1_C::Movie_Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Movie_Line_2) == 0x000418, "Member 'UWB_ui_SasLink_popup_1_C::Movie_Line_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Overlay_1) == 0x000420, "Member 'UWB_ui_SasLink_popup_1_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, REDScrollBox_1) == 0x000428, "Member 'UWB_ui_SasLink_popup_1_C::REDScrollBox_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, SAS_Base) == 0x000430, "Member 'UWB_ui_SasLink_popup_1_C::SAS_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Sas_frame_pattern) == 0x000438, "Member 'UWB_ui_SasLink_popup_1_C::Sas_frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Sas_icon) == 0x000440, "Member 'UWB_ui_SasLink_popup_1_C::Sas_icon' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Sas_icon_add) == 0x000448, "Member 'UWB_ui_SasLink_popup_1_C::Sas_icon_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Sas_Image_1) == 0x000450, "Member 'UWB_ui_SasLink_popup_1_C::Sas_Image_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Sas_Image_2) == 0x000458, "Member 'UWB_ui_SasLink_popup_1_C::Sas_Image_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, SizeBox_0) == 0x000460, "Member 'UWB_ui_SasLink_popup_1_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Skill_List_Frame_2) == 0x000468, "Member 'UWB_ui_SasLink_popup_1_C::Skill_List_Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Skill_List_Frame_1_under) == 0x000470, "Member 'UWB_ui_SasLink_popup_1_C::Skill_List_Frame_1_under' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Skill_List_Frame_1_up) == 0x000478, "Member 'UWB_ui_SasLink_popup_1_C::Skill_List_Frame_1_up' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Text_saslink_bond_4_num) == 0x000480, "Member 'UWB_ui_SasLink_popup_1_C::Text_saslink_bond_4_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Text_saslink_charaname_3) == 0x000488, "Member 'UWB_ui_SasLink_popup_1_C::Text_saslink_charaname_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Text_saslink_info_1) == 0x000490, "Member 'UWB_ui_SasLink_popup_1_C::Text_saslink_info_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Text_saslink_sasname_3) == 0x000498, "Member 'UWB_ui_SasLink_popup_1_C::Text_saslink_sasname_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Text_saslink_sasname_4) == 0x0004A0, "Member 'UWB_ui_SasLink_popup_1_C::Text_saslink_sasname_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Thubnail_Base) == 0x0004A8, "Member 'UWB_ui_SasLink_popup_1_C::Thubnail_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Thubnail_Frame) == 0x0004B0, "Member 'UWB_ui_SasLink_popup_1_C::Thubnail_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, Thubnail_Shade) == 0x0004B8, "Member 'UWB_ui_SasLink_popup_1_C::Thubnail_Shade' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, WB_ui_Guide) == 0x0004C0, "Member 'UWB_ui_SasLink_popup_1_C::WB_ui_Guide' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, SkillStatusList) == 0x0004C8, "Member 'UWB_ui_SasLink_popup_1_C::SkillStatusList' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, CharaID) == 0x0004D8, "Member 'UWB_ui_SasLink_popup_1_C::CharaID' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, bondsLevel) == 0x0004DC, "Member 'UWB_ui_SasLink_popup_1_C::bondsLevel' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, MaxBondsLevel) == 0x0004E0, "Member 'UWB_ui_SasLink_popup_1_C::MaxBondsLevel' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, CursorIndex) == 0x0004E4, "Member 'UWB_ui_SasLink_popup_1_C::CursorIndex' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagViewMode) == 0x0004E8, "Member 'UWB_ui_SasLink_popup_1_C::FlagViewMode' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, MovieManager) == 0x0004F0, "Member 'UWB_ui_SasLink_popup_1_C::MovieManager' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, StateMovie) == 0x0004F8, "Member 'UWB_ui_SasLink_popup_1_C::StateMovie' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagSetMovie) == 0x0004FC, "Member 'UWB_ui_SasLink_popup_1_C::FlagSetMovie' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagCloseMovie) == 0x0004FD, "Member 'UWB_ui_SasLink_popup_1_C::FlagCloseMovie' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, MoviePath) == 0x000500, "Member 'UWB_ui_SasLink_popup_1_C::MoviePath' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, PlayerId) == 0x000510, "Member 'UWB_ui_SasLink_popup_1_C::PlayerId' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagViewEx1) == 0x000520, "Member 'UWB_ui_SasLink_popup_1_C::FlagViewEx1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagViewEx2) == 0x000521, "Member 'UWB_ui_SasLink_popup_1_C::FlagViewEx2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagKasane) == 0x000522, "Member 'UWB_ui_SasLink_popup_1_C::FlagKasane' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagEnableDLC1) == 0x000523, "Member 'UWB_ui_SasLink_popup_1_C::FlagEnableDLC1' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, FlagEnableDLC2) == 0x000524, "Member 'UWB_ui_SasLink_popup_1_C::FlagEnableDLC2' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, MaxCell) == 0x000528, "Member 'UWB_ui_SasLink_popup_1_C::MaxCell' has a wrong offset!");
static_assert(offsetof(UWB_ui_SasLink_popup_1_C, IsPlatformPS) == 0x00052C, "Member 'UWB_ui_SasLink_popup_1_C::IsPlatformPS' has a wrong offset!");

}

