#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_4

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "Enum_ui_equip_parts_4_animation_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Equip_Parts_4.WB_ui_Equip_Parts_4_C
// 0x00B8 (0x0440 - 0x0388)
class UWB_ui_Equip_Parts_4_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_in_4;                                       // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in_3;                                       // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_3;                                          // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_3;                                         // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in_2;                                       // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Base_1;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_2;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_category;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_E;                                            // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_skin;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Item_icon_frame_2;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Set;                                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Equipage_list_1;                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Equipage_list_1_num;                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableWork;                                      // 0x0429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelect;                                          // 0x042A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsNew;                                             // 0x042B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseOut;                                        // 0x042C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseIn;                                         // 0x042D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFirst;                                           // 0x042E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStart;                                           // 0x042F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   BackupName;                                        // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectReset;                                     // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDoneInitializeAnimation;                         // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWeaponSkin;                                      // 0x043A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Equip_Parts_4(int32 EntryPoint);
	void Destruct();
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void SetSelect(bool Param_IsSelect);
	void SetElement(class FName Param_Name, int32 Num, int32 IconIndex, EItemRarity Rarity, bool IsSkin);
	void SetNewFlag(bool NewFlag);
	void SetEquipFlag(bool EquipFlag, bool UseSkinFlag);
	void SetRarity(EItemRarity Rarity);
	void PlayMouseOut();
	void PlayMouseIn();
	void CheckMouse();
	void SetFirstFlag(bool Param_IsFirst);
	void SetEnableFlag(bool Param_IsEnable);
	void DoOnceInitializeAnimation();

	void GetAnimationIndex2(Enum_ui_equip_parts_4_animation Animation, int32* Param_Index) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Equip_Parts_4_C">();
	}
	static class UWB_ui_Equip_Parts_4_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Equip_Parts_4_C>();
	}
};
static_assert(alignof(UWB_ui_Equip_Parts_4_C) == 0x000008, "Wrong alignment on UWB_ui_Equip_Parts_4_C");
static_assert(sizeof(UWB_ui_Equip_Parts_4_C) == 0x000440, "Wrong size on UWB_ui_Equip_Parts_4_C");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Equip_Parts_4_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select_in_4) == 0x000390, "Member 'UWB_ui_Equip_Parts_4_C::Select_in_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select_in_3) == 0x000398, "Member 'UWB_ui_Equip_Parts_4_C::Select_in_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select_3) == 0x0003A0, "Member 'UWB_ui_Equip_Parts_4_C::Select_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Default_3) == 0x0003A8, "Member 'UWB_ui_Equip_Parts_4_C::Default_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select_in_2) == 0x0003B0, "Member 'UWB_ui_Equip_Parts_4_C::Select_in_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select_in) == 0x0003B8, "Member 'UWB_ui_Equip_Parts_4_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Select) == 0x0003C0, "Member 'UWB_ui_Equip_Parts_4_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Default) == 0x0003C8, "Member 'UWB_ui_Equip_Parts_4_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Base_1) == 0x0003D0, "Member 'UWB_ui_Equip_Parts_4_C::Base_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Frame_1) == 0x0003D8, "Member 'UWB_ui_Equip_Parts_4_C::Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Frame_2) == 0x0003E0, "Member 'UWB_ui_Equip_Parts_4_C::Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Icon_category) == 0x0003E8, "Member 'UWB_ui_Equip_Parts_4_C::Icon_category' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Icon_E) == 0x0003F0, "Member 'UWB_ui_Equip_Parts_4_C::Icon_E' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Icon_new) == 0x0003F8, "Member 'UWB_ui_Equip_Parts_4_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Icon_skin) == 0x000400, "Member 'UWB_ui_Equip_Parts_4_C::Icon_skin' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Item_icon_frame_2) == 0x000408, "Member 'UWB_ui_Equip_Parts_4_C::Item_icon_frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Set) == 0x000410, "Member 'UWB_ui_Equip_Parts_4_C::Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Text_Equipage_list_1) == 0x000418, "Member 'UWB_ui_Equip_Parts_4_C::Text_Equipage_list_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, Text_Equipage_list_1_num) == 0x000420, "Member 'UWB_ui_Equip_Parts_4_C::Text_Equipage_list_1_num' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsEnable) == 0x000428, "Member 'UWB_ui_Equip_Parts_4_C::IsEnable' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsEnableWork) == 0x000429, "Member 'UWB_ui_Equip_Parts_4_C::IsEnableWork' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsSelect) == 0x00042A, "Member 'UWB_ui_Equip_Parts_4_C::IsSelect' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsNew) == 0x00042B, "Member 'UWB_ui_Equip_Parts_4_C::IsNew' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsMouseOut) == 0x00042C, "Member 'UWB_ui_Equip_Parts_4_C::IsMouseOut' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsMouseIn) == 0x00042D, "Member 'UWB_ui_Equip_Parts_4_C::IsMouseIn' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsFirst) == 0x00042E, "Member 'UWB_ui_Equip_Parts_4_C::IsFirst' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsStart) == 0x00042F, "Member 'UWB_ui_Equip_Parts_4_C::IsStart' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, BackupName) == 0x000430, "Member 'UWB_ui_Equip_Parts_4_C::BackupName' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsSelectReset) == 0x000438, "Member 'UWB_ui_Equip_Parts_4_C::IsSelectReset' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsDoneInitializeAnimation) == 0x000439, "Member 'UWB_ui_Equip_Parts_4_C::IsDoneInitializeAnimation' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_4_C, IsWeaponSkin) == 0x00043A, "Member 'UWB_ui_Equip_Parts_4_C::IsWeaponSkin' has a wrong offset!");

}

