#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_7

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.ExecuteUbergraph_WB_ui_Equip_Parts_7
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C6[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C7[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95C8[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95C9[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_ui_Equip_Parts_2_C*>         K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95CA[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95CB[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_ui_Equip_Parts_2_C*                 CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95CC[0x2];                                     // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x0080(0x000C)(NoDestructor)
	uint8                                         Pad_95CD[0x4];                                     // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95CE[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95CF[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95D0[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7) == 0x0000C0, "Wrong size on WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, EntryPoint) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue) == 0x000008, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000024, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_Event_State) == 0x000030, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_Event_SubState) == 0x000034, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_Event_DeltaSeconds) == 0x000038, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_SwitchInteger_CmpSuccess) == 0x00003C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_MakeArray_Array) == 0x000040, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000050, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000054, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000058, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00005C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_CreateDelegate_OutputDelegate) == 0x000060, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Array_Get_Item) == 0x000070, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_GetPlatformType_ReturnValue) == 0x00007D, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_CustomEvent_argument) == 0x000080, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, K2Node_CustomEvent_pWidget) == 0x000090, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000098, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000099, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A0, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A1, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_PlaySE_ReturnValue) == 0x0000A8, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x0000B0, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x0000B1, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x0000B4, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x0000B8, "Member 'WB_ui_Equip_Parts_7_C_ExecuteUbergraph_WB_ui_Equip_Parts_7::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.≈ôπÌ√»xû
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Equip_Parts_7_C_______x_ final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_95D1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_______x_) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_7_C_______x_");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_______x_) == 0x000018, "Wrong size on WB_ui_Equip_Parts_7_C_______x_");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_______x_, Argument) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_______x_::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_______x_, PWidget) == 0x000010, "Member 'WB_ui_Equip_Parts_7_C_______x_::PWidget' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Equip_Parts_7_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_7_C_UpdateState");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Equip_Parts_7_C_UpdateState");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Equip_Parts_7_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Equip_Parts_7_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_7_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_7_C_PreConstruct");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_Equip_Parts_7_C_PreConstruct");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.StateNone
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Equip_Parts_7_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D2[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D3[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95D4[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_7_C_StateNone");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_StateNone) == 0x000028, "Wrong size on WB_ui_Equip_Parts_7_C_StateNone");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Equip_Parts_7_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WB_ui_Equip_Parts_7_C_StateNone::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WB_ui_Equip_Parts_7_C_StateNone::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000021, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000024, "Member 'WB_ui_Equip_Parts_7_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.StateLoop
// 0x0084 (0x0084 - 0x0000)
struct WB_ui_Equip_Parts_7_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95D5[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95D6[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D7[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95D9[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95DA[0x3];                                     // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95DB[0x2];                                     // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95DC[0x2];                                     // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_Equip_Parts_7_C_StateLoop");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_StateLoop) == 0x000084, "Wrong size on WB_ui_Equip_Parts_7_C_StateLoop");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000014, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Loop_Counter_Variable_1) == 0x00001C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_1) == 0x000020, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Array_Index_Variable_2) == 0x000024, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Loop_Counter_Variable_2) == 0x000028, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_2) == 0x00002C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000030, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Loop_Counter_Variable_3) == 0x000034, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_3) == 0x000038, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00003C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Array_Index_Variable_3) == 0x000040, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000044, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Loop_Counter_Variable_4) == 0x00004C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Array_Length_ReturnValue_1) == 0x000054, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Add_IntInt_ReturnValue_4) == 0x000058, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, Temp_int_Array_Index_Variable_4) == 0x000060, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000064, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Array_Length_ReturnValue_2) == 0x000068, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_2) == 0x00006C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00006D, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000070, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Array_Length_ReturnValue_3) == 0x000074, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_3) == 0x000078, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000079, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Array_Length_ReturnValue_4) == 0x00007C, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_StateLoop, CallFunc_Less_IntInt_ReturnValue_4) == 0x000080, "Member 'WB_ui_Equip_Parts_7_C_StateLoop::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.UpdateCursor
// 0x0060 (0x0060 - 0x0000)
struct WB_ui_Equip_Parts_7_C_UpdateCursor final
{
public:
	int32                                         _Cursor;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95DD[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95DE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95DF[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95E0[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95E1[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95E2[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95E3[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_2;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_UpdateCursor) == 0x000008, "Wrong alignment on WB_ui_Equip_Parts_7_C_UpdateCursor");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_UpdateCursor) == 0x000060, "Wrong size on WB_ui_Equip_Parts_7_C_UpdateCursor");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, _Cursor) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_BooleanAND_ReturnValue) == 0x000012, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00001A, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_BooleanAND_ReturnValue_1) == 0x00001B, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001C, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00001D, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001E, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000024, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000028, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_BooleanAND_ReturnValue_2) == 0x00002C, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_PlaySE_ReturnValue) == 0x000030, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000038, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Less_IntInt_ReturnValue_1) == 0x000040, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000041, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_CheckInput_IsInput) == 0x000048, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Percent_IntInt_ReturnValue_1) == 0x00004C, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_CheckInput_IsInput_1) == 0x000050, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Add_IntInt_ReturnValue_2) == 0x000054, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_UpdateCursor, CallFunc_Percent_IntInt_ReturnValue_2) == 0x000058, "Member 'WB_ui_Equip_Parts_7_C_UpdateCursor::CallFunc_Percent_IntInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.SetSingle
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_7_C_SetSingle final
{
public:
	bool                                          Param_IsSingle;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_SetSingle) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_7_C_SetSingle");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_SetSingle) == 0x000001, "Wrong size on WB_ui_Equip_Parts_7_C_SetSingle");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_SetSingle, Param_IsSingle) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_SetSingle::Param_IsSingle' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_7_C_SetActive final
{
public:
	bool                                          Param_IsActive;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_SetActive) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_7_C_SetActive");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_SetActive) == 0x000001, "Wrong size on WB_ui_Equip_Parts_7_C_SetActive");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_SetActive, Param_IsActive) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_SetActive::Param_IsActive' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.SetDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Equip_Parts_7_C_SetDecide final
{
public:
	bool                                          Param_IsDecide;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Equip_Parts_7_C_SetDecide) == 0x000001, "Wrong alignment on WB_ui_Equip_Parts_7_C_SetDecide");
static_assert(sizeof(WB_ui_Equip_Parts_7_C_SetDecide) == 0x000001, "Wrong size on WB_ui_Equip_Parts_7_C_SetDecide");
static_assert(offsetof(WB_ui_Equip_Parts_7_C_SetDecide, Param_IsDecide) == 0x000000, "Member 'WB_ui_Equip_Parts_7_C_SetDecide::Param_IsDecide' has a wrong offset!");

// Function WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C.SetEquip
// 0x0110 (0x0110 - 0x0000)
struct WB_ui_Equip_Parts_7_C_SetEquip final
{
public:
	struct FPlayerInfo                            Param;                                             // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
