#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_SasSkill_Popup

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.ExecuteUbergraph_WB_ui_SasSkill_Popup
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup) == 0x000014, "Wrong size on WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup, EntryPoint) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup, K2Node_Event_State) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_SasSkill_Popup_C_ExecuteUbergraph_WB_ui_SasSkill_Popup::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_SasSkill_Popup_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_UpdateState");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_SasSkill_Popup_C_UpdateState");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_UpdateState, State) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_SasSkill_Popup_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.StateNone
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasSkill_Popup_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_StateNone");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_StateNone) == 0x000008, "Wrong size on WB_ui_SasSkill_Popup_C_StateNone");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.StateOpen
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasSkill_Popup_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_StateOpen");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_StateOpen) == 0x000008, "Wrong size on WB_ui_SasSkill_Popup_C_StateOpen");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_SasSkill_Popup_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.StateLoop
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasSkill_Popup_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_StateLoop");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_StateLoop) == 0x000008, "Wrong size on WB_ui_SasSkill_Popup_C_StateLoop");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.StateClose
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_SasSkill_Popup_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_IsPlaying;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_SasSkill_Popup_C_StateClose");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_StateClose) == 0x000008, "Wrong size on WB_ui_SasSkill_Popup_C_StateClose");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_SasSkill_Popup_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000005, "Member 'WB_ui_SasSkill_Popup_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_StateClose, CallFunc_IsPlaying_IsPlaying) == 0x000006, "Member 'WB_ui_SasSkill_Popup_C_StateClose::CallFunc_IsPlaying_IsPlaying' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.SetCharacter
// 0x0003 (0x0003 - 0x0000)
struct WB_ui_SasSkill_Popup_C_SetCharacter final
{
public:
	EPlayerID                                     CharaID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableDLC1;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEnableDLC2;                                      // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_SetCharacter) == 0x000001, "Wrong alignment on WB_ui_SasSkill_Popup_C_SetCharacter");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_SetCharacter) == 0x000003, "Wrong size on WB_ui_SasSkill_Popup_C_SetCharacter");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_SetCharacter, CharaID) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_SetCharacter::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_SetCharacter, IsEnableDLC1) == 0x000001, "Member 'WB_ui_SasSkill_Popup_C_SetCharacter::IsEnableDLC1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_SetCharacter, IsEnableDLC2) == 0x000002, "Member 'WB_ui_SasSkill_Popup_C_SetCharacter::IsEnableDLC2' has a wrong offset!");

// Function WB_ui_SasSkill_Popup.WB_ui_SasSkill_Popup_C.SetViewMode
// 0x0002 (0x0002 - 0x0000)
struct WB_ui_SasSkill_Popup_C_SetViewMode final
{
public:
	bool                                          Param_IsEx1;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Param_IsEx2;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_SasSkill_Popup_C_SetViewMode) == 0x000001, "Wrong alignment on WB_ui_SasSkill_Popup_C_SetViewMode");
static_assert(sizeof(WB_ui_SasSkill_Popup_C_SetViewMode) == 0x000002, "Wrong size on WB_ui_SasSkill_Popup_C_SetViewMode");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_SetViewMode, Param_IsEx1) == 0x000000, "Member 'WB_ui_SasSkill_Popup_C_SetViewMode::Param_IsEx1' has a wrong offset!");
static_assert(offsetof(WB_ui_SasSkill_Popup_C_SetViewMode, Param_IsEx2) == 0x000001, "Member 'WB_ui_SasSkill_Popup_C_SetViewMode::Param_IsEx2' has a wrong offset!");

}

