#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_log

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_log.WB_ui_Log_C
// 0x00C0 (0x0838 - 0x0778)
class UWB_ui_Log_C final : public UUILog
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0778(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_6;                                         // 0x0780(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_5;                                         // 0x0788(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_4;                                         // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_3;                                         // 0x0798(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x07A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x07A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_7;                                              // 0x07B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_6;                                              // 0x07B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_5;                                              // 0x07C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_4;                                              // 0x07C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_3;                                              // 0x07D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_2;                                              // 0x07D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In_1;                                              // 0x07E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               OP_Scale_All_Set;                                  // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_1;                                 // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_2;                                 // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_3;                                 // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_4;                                 // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_5;                                 // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_6;                                 // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Log_parts_1_C*                   WB_ui_Log_parts_7;                                 // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MessageSizeNormal;                                 // 0x0828(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MessageSizeExpansion;                              // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Log(int32 EntryPoint);
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	bool SetupTextSize();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Log_C">();
	}
	static class UWB_ui_Log_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Log_C>();
	}
};
static_assert(alignof(UWB_ui_Log_C) == 0x000008, "Wrong alignment on UWB_ui_Log_C");
static_assert(sizeof(UWB_ui_Log_C) == 0x000838, "Wrong size on UWB_ui_Log_C");
static_assert(offsetof(UWB_ui_Log_C, UberGraphFrame) == 0x000778, "Member 'UWB_ui_Log_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_6) == 0x000780, "Member 'UWB_ui_Log_C::Default_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_5) == 0x000788, "Member 'UWB_ui_Log_C::Default_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_4) == 0x000790, "Member 'UWB_ui_Log_C::Default_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_3) == 0x000798, "Member 'UWB_ui_Log_C::Default_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_2) == 0x0007A0, "Member 'UWB_ui_Log_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, Default_1) == 0x0007A8, "Member 'UWB_ui_Log_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_7) == 0x0007B0, "Member 'UWB_ui_Log_C::In_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_6) == 0x0007B8, "Member 'UWB_ui_Log_C::In_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_5) == 0x0007C0, "Member 'UWB_ui_Log_C::In_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_4) == 0x0007C8, "Member 'UWB_ui_Log_C::In_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_3) == 0x0007D0, "Member 'UWB_ui_Log_C::In_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_2) == 0x0007D8, "Member 'UWB_ui_Log_C::In_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, In_1) == 0x0007E0, "Member 'UWB_ui_Log_C::In_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, OP_Scale_All_Set) == 0x0007E8, "Member 'UWB_ui_Log_C::OP_Scale_All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_1) == 0x0007F0, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_2) == 0x0007F8, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_3) == 0x000800, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_4) == 0x000808, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_5) == 0x000810, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_6) == 0x000818, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_6' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, WB_ui_Log_parts_7) == 0x000820, "Member 'UWB_ui_Log_C::WB_ui_Log_parts_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, MessageSizeNormal) == 0x000828, "Member 'UWB_ui_Log_C::MessageSizeNormal' has a wrong offset!");
static_assert(offsetof(UWB_ui_Log_C, MessageSizeExpansion) == 0x000830, "Member 'UWB_ui_Log_C::MessageSizeExpansion' has a wrong offset!");

}

