#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BrainMap_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Struct_ui_brainmap_info_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.SetPopupMode__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature final
{
public:
	bool                                          IsPopup;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong alignment on WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature");
static_assert(sizeof(WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong size on WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature, IsPopup) == 0x000000, "Member 'WB_ui_BrainMap_1_C_SetPopupMode__DelegateSignature::IsPopup' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.ExecuteUbergraph_WB_ui_BrainMap_1
// 0x0068 (0x0068 - 0x0000)
struct WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4ED9[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDA[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDB[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDC[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UOverlay*>                       K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UOverlay*>                       K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDD[0x2];                                     // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1");
static_assert(sizeof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1) == 0x000068, "Wrong size on WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, EntryPoint) == 0x000000, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_Event_State) == 0x000010, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_Event_SubState) == 0x000014, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001D, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00001E, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000024, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000028, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000029, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000030, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_MakeArray_Array) == 0x000038, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, K2Node_MakeArray_Array_1) == 0x000048, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000058, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000059, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00005C, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000060, "Member 'WB_ui_BrainMap_1_C_ExecuteUbergraph_WB_ui_BrainMap_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_BrainMap_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_BrainMap_1_C_UpdateState");
static_assert(sizeof(WB_ui_BrainMap_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_BrainMap_1_C_UpdateState");
static_assert(offsetof(WB_ui_BrainMap_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_BrainMap_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_BrainMap_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_BrainMap_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.StateNone
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_BrainMap_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EDE[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EDF[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_StateNone) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_StateNone");
static_assert(sizeof(WB_ui_BrainMap_1_C_StateNone) == 0x000020, "Wrong size on WB_ui_BrainMap_1_C_StateNone");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_BrainMap_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000004, "Member 'WB_ui_BrainMap_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_IsValid_ReturnValue) == 0x000006, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_AddChild_ReturnValue_1) == 0x000010, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000018, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00001C, "Member 'WB_ui_BrainMap_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.StateOpen
// 0x0038 (0x0038 - 0x0000)
struct WB_ui_BrainMap_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE1[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE2[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isTutoTips_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE3[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isPlayingContentsIn_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE4[0x1];                                     // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_StateOpen");
static_assert(sizeof(WB_ui_BrainMap_1_C_StateOpen) == 0x000038, "Wrong size on WB_ui_BrainMap_1_C_StateOpen");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_BrainMap_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_BrainMap_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000011, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000020, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_isTutoTips_ReturnValue) == 0x000028, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_isTutoTips_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue) == 0x00002C, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_DisplayTipsOrMiniTipsByHelpID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_isPlayingContentsIn_ReturnValue) == 0x000030, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_isPlayingContentsIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000031, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000032, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000034, "Member 'WB_ui_BrainMap_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.StateLoop
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_BrainMap_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE5[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelectSkill_IsSelect;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE6[0x1];                                     // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckRectangle_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSelectSkill_IsSelect_1;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE7[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EE8[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetResultIndex_ResultIndex;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EE9[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEA[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckDecide_IsOpen;                       // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_2;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEB[0x1];                                     // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_StateLoop");
static_assert(sizeof(WB_ui_BrainMap_1_C_StateLoop) == 0x000050, "Wrong size on WB_ui_BrainMap_1_C_StateLoop");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_BrainMap_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMap_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_IsSelectSkill_IsSelect) == 0x000010, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_IsSelectSkill_IsSelect' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000011, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_IsValid_ReturnValue) == 0x000012, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_CheckRectangle_ReturnValue) == 0x000018, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_CheckRectangle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_CheckInput_IsInput) == 0x000019, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_IsSelectSkill_IsSelect_1) == 0x00001A, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_IsSelectSkill_IsSelect_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x00001B, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue_1) == 0x00001C, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_PlaySE_ReturnValue) == 0x000020, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000028, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000029, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_GetResultIndex_ResultIndex) == 0x00002C, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_GetResultIndex_ResultIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000034, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000038, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00003C, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_CheckInput_IsInput_1) == 0x000042, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_CheckDecide_IsOpen) == 0x000043, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_CheckDecide_IsOpen' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_CheckInput_IsInput_2) == 0x000044, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_CheckInput_IsInput_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_BooleanAND_ReturnValue_2) == 0x000045, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000046, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000048, "Member 'WB_ui_BrainMap_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.StateClose
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_BrainMap_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayAnyBPWork_IsPlay;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_isPlayingContentsOut_ReturnValue;         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_BrainMap_1_C_StateClose");
static_assert(sizeof(WB_ui_BrainMap_1_C_StateClose) == 0x000010, "Wrong size on WB_ui_BrainMap_1_C_StateClose");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_BrainMap_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, CallFunc_IsPlayAnyBPWork_IsPlay) == 0x000004, "Member 'WB_ui_BrainMap_1_C_StateClose::CallFunc_IsPlayAnyBPWork_IsPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_BrainMap_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, CallFunc_isPlayingContentsOut_ReturnValue) == 0x000006, "Member 'WB_ui_BrainMap_1_C_StateClose::CallFunc_isPlayingContentsOut_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000007, "Member 'WB_ui_BrainMap_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000008, "Member 'WB_ui_BrainMap_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x00000C, "Member 'WB_ui_BrainMap_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.SetContentsChange
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_BrainMap_1_C_SetContentsChange final
{
public:
	bool                                          IsChange;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMap_1_C_SetContentsChange) == 0x000001, "Wrong alignment on WB_ui_BrainMap_1_C_SetContentsChange");
static_assert(sizeof(WB_ui_BrainMap_1_C_SetContentsChange) == 0x000001, "Wrong size on WB_ui_BrainMap_1_C_SetContentsChange");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetContentsChange, IsChange) == 0x000000, "Member 'WB_ui_BrainMap_1_C_SetContentsChange::IsChange' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.InitPartsList
// 0x00A8 (0x00A8 - 0x0000)
struct WB_ui_BrainMap_1_C_InitPartsList final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EED[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EEE[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UREDImage*                              K2Node_DynamicCast_AsREDImage;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EEF[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_2;                          // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_3;                          // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_4;                          // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_5;                          // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_6;                          // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UImage*>                         K2Node_MakeArray_Array_7;                          // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_InitPartsList) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_InitPartsList");
static_assert(sizeof(WB_ui_BrainMap_1_C_InitPartsList) == 0x0000A8, "Wrong size on WB_ui_BrainMap_1_C_InitPartsList");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WB_ui_BrainMap_1_C_InitPartsList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_ui_BrainMap_1_C_InitPartsList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, CallFunc_InRange_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_BrainMap_1_C_InitPartsList::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_BrainMap_1_C_InitPartsList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WB_ui_BrainMap_1_C_InitPartsList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_DynamicCast_AsREDImage) == 0x000018, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_DynamicCast_AsREDImage' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, CallFunc_Less_IntInt_ReturnValue) == 0x000021, "Member 'WB_ui_BrainMap_1_C_InitPartsList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array) == 0x000028, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_1) == 0x000038, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_2) == 0x000048, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_3) == 0x000058, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_4) == 0x000068, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_5) == 0x000078, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_6) == 0x000088, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_InitPartsList, K2Node_MakeArray_Array_7) == 0x000098, "Member 'WB_ui_BrainMap_1_C_InitPartsList::K2Node_MakeArray_Array_7' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.CreateCursor
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_BrainMap_1_C_CreateCursor final
{
public:
	class UWB_ui_BrainMap_SkillMap_Parts_2_C*     CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_BrainMap_1_C_CreateCursor) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_CreateCursor");
static_assert(sizeof(WB_ui_BrainMap_1_C_CreateCursor) == 0x000008, "Wrong size on WB_ui_BrainMap_1_C_CreateCursor");
static_assert(offsetof(WB_ui_BrainMap_1_C_CreateCursor, CallFunc_Create_ReturnValue) == 0x000000, "Member 'WB_ui_BrainMap_1_C_CreateCursor::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function WB_ui_BrainMap_1.WB_ui_BrainMap_1_C.SetupSkillOpen
// 0x0100 (0x0100 - 0x0000)
struct WB_ui_BrainMap_1_C_SetupSkillOpen final
{
public:
	bool                                          _IsEnableLearn;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     _PlayerID;                                         // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF0[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         _MaterialIndex;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _index;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF1[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 _FrameIndexList;                                   // 0x0010(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         _SkillStatus;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    _Manager;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_ui_brainmap_info               _Work;                                             // 0x0030(0x0030)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF3[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStruct_ui_brainmap_info>       CallFunc_GetBrainmapTable_Table;                   // 0x0088(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF4[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF5[0x2];                                     // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPlayerSkillPoint_skill_point;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF6[0x2];                                     // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ARSBattlePlayer_C*                      CallFunc_GetMainPlayer_Player;                     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IPlayerInterface>      CallFunc_GetPlayerID_self_CastInput;               // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerID                                     CallFunc_GetPlayerID_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EF7[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4EF8[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerManager_C*                    CallFunc_GetPlayerManager_PlayerManager;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x00F8(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillLearnAble_bOK;                     // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillLearned_learned;                   // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_BrainMap_1_C_SetupSkillOpen) == 0x000008, "Wrong alignment on WB_ui_BrainMap_1_C_SetupSkillOpen");
static_assert(sizeof(WB_ui_BrainMap_1_C_SetupSkillOpen) == 0x000100, "Wrong size on WB_ui_BrainMap_1_C_SetupSkillOpen");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _IsEnableLearn) == 0x000000, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_IsEnableLearn' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _PlayerID) == 0x000001, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_PlayerID' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _MaterialIndex) == 0x000004, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_MaterialIndex' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _index) == 0x000008, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_index' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _FrameIndexList) == 0x000010, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_FrameIndexList' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _SkillStatus) == 0x000020, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_SkillStatus' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _Manager) == 0x000028, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_Manager' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, _Work) == 0x000030, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::_Work' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, Temp_int_Variable) == 0x000064, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_BrainMap_1_C_SetupSkillOpen, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'WB_ui_BrainMap_1_C_SetupSkillOpen::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
