#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Equip_Parts_7

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Equip_Parts_7.WB_ui_Equip_Parts_7_C
// 0x0098 (0x0420 - 0x0388)
class UWB_ui_Equip_Parts_7_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default_2;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Equipages_list;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Line_List_3;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_equipage_contents_1;                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_equipage_contents_2;                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_equipage_contents_7;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Equip_Parts_2_C*                 WB_ui_Equipages_Parts_2_1;                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Equip_Parts_2_C*                 WB_ui_Equipages_Parts_2_2;                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Equip_Parts_2_C*                 WB_ui_Equipages_Parts_2_3;                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Equip_Parts_2_C*                 WB_ui_Equipages_Parts_2_4;                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Equip_Parts_2_C*                 WB_ui_Equipages_Parts_2_5;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_ui_Equip_Parts_2_C*>         ElementList;                                       // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         ElementCursor;                                     // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSingle;                                          // 0x0414(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsActive;                                          // 0x0415(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsDecide;                                          // 0x0416(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseDecide;                                     // 0x0417(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         CursorNum;                                         // 0x0418(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsStartLock;                                       // 0x041C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          FlagControl;                                       // 0x041D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableWeaponSkin;                                // 0x041E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableWeaponSkinCell;                            // 0x041F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_Equip_Parts_7(int32 EntryPoint);
	void OnInitialized();
	void ______x_(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void StateNone(int32 SubState);
	void StateLoop(int32 SubState);
	void UpdateCursor();
	void SetSingle(bool Param_IsSingle);
	void SetActive(bool Param_IsActive);
	void SetDecide(bool Param_IsDecide);
	void SetEquip(struct FPlayerInfo& Param, bool& IsCostume);
	void GetCursorPos(int32* Param_Cursor);
	void InitializeEquip();
	void InitializeCostume();
	void EquipSlotMouseSetUp(ESlateVisibility Visible);
	void SetMouseDecideReset();
	void GetMouseDecide(bool* Mousedecide);
	void SetEquipNum(int32 Num);
	void SetStartLock(bool FlagLock);
	void SetCursorPos(int32 Param_Cursor);
	void SetControl(bool IsControl);
	void CorrectCursor();
	void SetEnableWeaponSkin(bool IsEnable);
	void SetupWeaponSkinElement(bool IsCostume);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Equip_Parts_7_C">();
	}
	static class UWB_ui_Equip_Parts_7_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Equip_Parts_7_C>();
	}
};
static_assert(alignof(UWB_ui_Equip_Parts_7_C) == 0x000008, "Wrong alignment on UWB_ui_Equip_Parts_7_C");
static_assert(sizeof(UWB_ui_Equip_Parts_7_C) == 0x000420, "Wrong size on UWB_ui_Equip_Parts_7_C");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_Equip_Parts_7_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Default_2) == 0x000390, "Member 'UWB_ui_Equip_Parts_7_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Default_none) == 0x000398, "Member 'UWB_ui_Equip_Parts_7_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Default_1) == 0x0003A0, "Member 'UWB_ui_Equip_Parts_7_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, All_Color) == 0x0003A8, "Member 'UWB_ui_Equip_Parts_7_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Equipages_list) == 0x0003B0, "Member 'UWB_ui_Equip_Parts_7_C::Equipages_list' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Line_List_3) == 0x0003B8, "Member 'UWB_ui_Equip_Parts_7_C::Line_List_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Text_equipage_contents_1) == 0x0003C0, "Member 'UWB_ui_Equip_Parts_7_C::Text_equipage_contents_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Text_equipage_contents_2) == 0x0003C8, "Member 'UWB_ui_Equip_Parts_7_C::Text_equipage_contents_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, Text_equipage_contents_7) == 0x0003D0, "Member 'UWB_ui_Equip_Parts_7_C::Text_equipage_contents_7' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, WB_ui_Equipages_Parts_2_1) == 0x0003D8, "Member 'UWB_ui_Equip_Parts_7_C::WB_ui_Equipages_Parts_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, WB_ui_Equipages_Parts_2_2) == 0x0003E0, "Member 'UWB_ui_Equip_Parts_7_C::WB_ui_Equipages_Parts_2_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, WB_ui_Equipages_Parts_2_3) == 0x0003E8, "Member 'UWB_ui_Equip_Parts_7_C::WB_ui_Equipages_Parts_2_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, WB_ui_Equipages_Parts_2_4) == 0x0003F0, "Member 'UWB_ui_Equip_Parts_7_C::WB_ui_Equipages_Parts_2_4' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, WB_ui_Equipages_Parts_2_5) == 0x0003F8, "Member 'UWB_ui_Equip_Parts_7_C::WB_ui_Equipages_Parts_2_5' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, ElementList) == 0x000400, "Member 'UWB_ui_Equip_Parts_7_C::ElementList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, ElementCursor) == 0x000410, "Member 'UWB_ui_Equip_Parts_7_C::ElementCursor' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsSingle) == 0x000414, "Member 'UWB_ui_Equip_Parts_7_C::IsSingle' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsActive) == 0x000415, "Member 'UWB_ui_Equip_Parts_7_C::IsActive' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsDecide) == 0x000416, "Member 'UWB_ui_Equip_Parts_7_C::IsDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsMouseDecide) == 0x000417, "Member 'UWB_ui_Equip_Parts_7_C::IsMouseDecide' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, CursorNum) == 0x000418, "Member 'UWB_ui_Equip_Parts_7_C::CursorNum' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsStartLock) == 0x00041C, "Member 'UWB_ui_Equip_Parts_7_C::IsStartLock' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, FlagControl) == 0x00041D, "Member 'UWB_ui_Equip_Parts_7_C::FlagControl' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsEnableWeaponSkin) == 0x00041E, "Member 'UWB_ui_Equip_Parts_7_C::IsEnableWeaponSkin' has a wrong offset!");
static_assert(offsetof(UWB_ui_Equip_Parts_7_C, IsEnableWeaponSkinCell) == 0x00041F, "Member 'UWB_ui_Equip_Parts_7_C::IsEnableWeaponSkinCell' has a wrong offset!");

}

