#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MainContents_Parts_3

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_MainContents_Parts_3.WB_ui_MainContents_Parts_3_C.ExecuteUbergraph_WB_ui_MainContents_Parts_3
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5478[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3) == 0x000008, "Wrong alignment on WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3");
static_assert(sizeof(WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3) == 0x000010, "Wrong size on WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3");
static_assert(offsetof(WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3, EntryPoint) == 0x000000, "Member 'WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WB_ui_MainContents_Parts_3_C_ExecuteUbergraph_WB_ui_MainContents_Parts_3::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WB_ui_MainContents_Parts_3.WB_ui_MainContents_Parts_3_C.PressButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_MainContents_Parts_3_C_PressButton final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_MainContents_Parts_3_C_PressButton) == 0x000008, "Wrong alignment on WB_ui_MainContents_Parts_3_C_PressButton");
static_assert(sizeof(WB_ui_MainContents_Parts_3_C_PressButton) == 0x000008, "Wrong size on WB_ui_MainContents_Parts_3_C_PressButton");
static_assert(offsetof(WB_ui_MainContents_Parts_3_C_PressButton, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WB_ui_MainContents_Parts_3_C_PressButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

