#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Enemy_Info_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Enemy_Info_Parts_1.WB_ui_Enemy_Info_Parts_1_C
// 0x0108 (0x0530 - 0x0428)
class UWB_ui_Enemy_Info_Parts_1_C final : public UUIEnemyInfoWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0428(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change_2_1;                                        // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Change_1_2;                                        // 0x0438(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_2;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_1;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Info;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_Info_Frame;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange_1;                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange_2;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Location;                                    // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List_Set;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Details;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBoxSimple*                    REDScrollBoxSimple_Details2;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBoxSimple*                    REDScrollBoxSimple_Detals1;                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_habitat_1;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_habitat_2;                              // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_info_1;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_info_2;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_item_1;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_enemy_name_1;                                 // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_icon_1;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_icon_2;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Text_icon_3;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thubnail_Shade;                                    // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Enemy_M;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Frame;                                   // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Thumbnail_Noise;                                   // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDOverlay*                            Thumbnail_Set;                                     // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_DropItem;                              // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Habitat;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Enemy_Info_Parts_2_C*            WB_ui_Enemy_Info_Parts_2;                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Enemy_Info_Parts_1(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Enemy_Info_Parts_1_C">();
	}
	static class UWB_ui_Enemy_Info_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Enemy_Info_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_Enemy_Info_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_Enemy_Info_Parts_1_C");
static_assert(sizeof(UWB_ui_Enemy_Info_Parts_1_C) == 0x000530, "Wrong size on UWB_ui_Enemy_Info_Parts_1_C");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, UberGraphFrame) == 0x000428, "Member 'UWB_ui_Enemy_Info_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Change_2_1) == 0x000430, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Change_2_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Change_1_2) == 0x000438, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Change_1_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Default_2) == 0x000440, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Default_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Default_1) == 0x000448, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Default_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, All_Color) == 0x000450, "Member 'UWB_ui_Enemy_Info_Parts_1_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Base_Info) == 0x000458, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Base_Info' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Base_Info_Frame) == 0x000460, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Base_Info_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, CanvasPanel_ViewRange_1) == 0x000468, "Member 'UWB_ui_Enemy_Info_Parts_1_C::CanvasPanel_ViewRange_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, CanvasPanel_ViewRange_2) == 0x000470, "Member 'UWB_ui_Enemy_Info_Parts_1_C::CanvasPanel_ViewRange_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Frame_Location) == 0x000478, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Frame_Location' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Icon_font) == 0x000480, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, List_Set) == 0x000488, "Member 'UWB_ui_Enemy_Info_Parts_1_C::List_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Overlay_Details) == 0x000490, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Overlay_Details' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, REDScrollBoxSimple_Details2) == 0x000498, "Member 'UWB_ui_Enemy_Info_Parts_1_C::REDScrollBoxSimple_Details2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, REDScrollBoxSimple_Detals1) == 0x0004A0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::REDScrollBoxSimple_Detals1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_habitat_1) == 0x0004A8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_habitat_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_habitat_2) == 0x0004B0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_habitat_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_info_1) == 0x0004B8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_info_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_info_2) == 0x0004C0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_info_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_item_1) == 0x0004C8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_item_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_enemy_name_1) == 0x0004D0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_enemy_name_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_icon_1) == 0x0004D8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_icon_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_icon_2) == 0x0004E0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_icon_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Text_icon_3) == 0x0004E8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Text_icon_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Thubnail_Shade) == 0x0004F0, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Thubnail_Shade' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Thumbnail_Enemy_M) == 0x0004F8, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Thumbnail_Enemy_M' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Thumbnail_Frame) == 0x000500, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Thumbnail_Frame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Thumbnail_Noise) == 0x000508, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Thumbnail_Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, Thumbnail_Set) == 0x000510, "Member 'UWB_ui_Enemy_Info_Parts_1_C::Thumbnail_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, VerticalBox_DropItem) == 0x000518, "Member 'UWB_ui_Enemy_Info_Parts_1_C::VerticalBox_DropItem' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, VerticalBox_Habitat) == 0x000520, "Member 'UWB_ui_Enemy_Info_Parts_1_C::VerticalBox_Habitat' has a wrong offset!");
static_assert(offsetof(UWB_ui_Enemy_Info_Parts_1_C, WB_ui_Enemy_Info_Parts_2) == 0x000528, "Member 'UWB_ui_Enemy_Info_Parts_1_C::WB_ui_Enemy_Info_Parts_2' has a wrong offset!");

}

