#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Info_window_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Info_window_1.WB_ui_Info_window_1_C
// 0x00A8 (0x0488 - 0x03E0)
class UWB_ui_Info_window_1_C final : public UUIInfoWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue;                                     // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Base;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_Grow;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_pattern;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Guide_Line_1;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Guide_Set;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PG_Cover_Black;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_100;                                        // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Info_Guide_1;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Info_window;                                  // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Info_window_1(int32 EntryPoint);
	void SetStyleNormal();
	void SetStyleWarning();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Info_window_1_C">();
	}
	static class UWB_ui_Info_window_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Info_window_1_C>();
	}
};
static_assert(alignof(UWB_ui_Info_window_1_C) == 0x000008, "Wrong alignment on UWB_ui_Info_window_1_C");
static_assert(sizeof(UWB_ui_Info_window_1_C) == 0x000488, "Wrong size on UWB_ui_Info_window_1_C");
static_assert(offsetof(UWB_ui_Info_window_1_C, UberGraphFrame) == 0x0003E0, "Member 'UWB_ui_Info_window_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Out) == 0x0003E8, "Member 'UWB_ui_Info_window_1_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, In) == 0x0003F0, "Member 'UWB_ui_Info_window_1_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Default_none) == 0x0003F8, "Member 'UWB_ui_Info_window_1_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Default) == 0x000400, "Member 'UWB_ui_Info_window_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, CA_Image_Blue) == 0x000408, "Member 'UWB_ui_Info_window_1_C::CA_Image_Blue' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, CA_Image_Green) == 0x000410, "Member 'UWB_ui_Info_window_1_C::CA_Image_Green' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, CA_Image_Red) == 0x000418, "Member 'UWB_ui_Info_window_1_C::CA_Image_Red' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, CA_RetainerBox) == 0x000420, "Member 'UWB_ui_Info_window_1_C::CA_RetainerBox' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Frame_Base) == 0x000428, "Member 'UWB_ui_Info_window_1_C::Frame_Base' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Frame_Grow) == 0x000430, "Member 'UWB_ui_Info_window_1_C::Frame_Grow' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Frame_pattern) == 0x000438, "Member 'UWB_ui_Info_window_1_C::Frame_pattern' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Guide_Line_1) == 0x000440, "Member 'UWB_ui_Info_window_1_C::Guide_Line_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Guide_Set) == 0x000448, "Member 'UWB_ui_Info_window_1_C::Guide_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Icon_font) == 0x000450, "Member 'UWB_ui_Info_window_1_C::Icon_font' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Icon_font_1) == 0x000458, "Member 'UWB_ui_Info_window_1_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Noise) == 0x000460, "Member 'UWB_ui_Info_window_1_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, PG_Cover_Black) == 0x000468, "Member 'UWB_ui_Info_window_1_C::PG_Cover_Black' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Spacer_100) == 0x000470, "Member 'UWB_ui_Info_window_1_C::Spacer_100' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Text_Info_Guide_1) == 0x000478, "Member 'UWB_ui_Info_window_1_C::Text_Info_Guide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Info_window_1_C, Text_Info_window) == 0x000480, "Member 'UWB_ui_Info_window_1_C::Text_Info_window' has a wrong offset!");

}

