#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Present

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Present.WB_ui_Present_C.ExecuteUbergraph_WB_ui_Present
// 0x0150 (0x0150 - 0x0000)
struct WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E7E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E7F[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E80[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E81[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_index;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_5;                      // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_4;                      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Present_List_Parts_1_C*          K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1;   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E82[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Present_List_Parts_1_C*          K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E83[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_3;                      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Present_List_Parts_1_C*          K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_2; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E84[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E85[0x2];                                     // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_isMouseScroll_1;                // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_2;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_isMouseScroll;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_1;                       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Present_List_Parts_1_C*          K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_3; // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E86[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Present_List_Parts_1_C*          K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_4; // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E87[0x1];                                     // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E88[0x2];                                     // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E89[0x3];                                     // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_cursor;                         // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E8A[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8B[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present) == 0x000008, "Wrong alignment on WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present");
static_assert(sizeof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present) == 0x000150, "Wrong size on WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, EntryPoint) == 0x000000, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000011, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000018, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_Event_IsDesignTime) == 0x00001C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_Event_State) == 0x000020, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_Event_SubState) == 0x000024, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_SwitchInteger_CmpSuccess) == 0x00002C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00002D, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000030, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_index) == 0x000054, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget_5) == 0x000058, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget_4) == 0x000060, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1) == 0x000068, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_1) == 0x000078, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget_3) == 0x000088, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_2) == 0x000090, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_bSuccess_2) == 0x000098, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate_2) == 0x00009C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000AC, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_GetPlatformType_ReturnValue) == 0x0000BC, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000BD, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C0, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_isMouseScroll_1) == 0x0000D0, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_cursor_2) == 0x0000D4, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_cursor_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget_2) == 0x0000D8, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_isMouseScroll) == 0x0000E0, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_cursor_1) == 0x0000E4, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_cursor_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget_1) == 0x0000E8, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_3) == 0x0000F0, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_4) == 0x000100, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_AsWB_Ui_Present_List_Parts_1_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_DynamicCast_bSuccess_4) == 0x000108, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000109, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00010A, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CreateDelegate_OutputDelegate_5) == 0x00010C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x00011C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x00011D, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000120, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000124, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000128, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_cursor) == 0x00012C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, K2Node_CustomEvent_pWidget) == 0x000130, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000138, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x00013C, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00013D, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x000140, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present, CallFunc_PlaySE_ReturnValue_1) == 0x000148, "Member 'WB_ui_Present_C_ExecuteUbergraph_WB_ui_Present::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_MouseDown
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Present_C_Event_MouseDown final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_MouseDown) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_MouseDown");
static_assert(sizeof(WB_ui_Present_C_Event_MouseDown) == 0x000010, "Wrong size on WB_ui_Present_C_Event_MouseDown");
static_assert(offsetof(WB_ui_Present_C_Event_MouseDown, Param_Cursor) == 0x000000, "Member 'WB_ui_Present_C_Event_MouseDown::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_MouseDown, PWidget) == 0x000008, "Member 'WB_ui_Present_C_Event_MouseDown::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_MouseUnFocus
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Present_C_Event_MouseUnFocus final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_MouseUnFocus) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_MouseUnFocus");
static_assert(sizeof(WB_ui_Present_C_Event_MouseUnFocus) == 0x000010, "Wrong size on WB_ui_Present_C_Event_MouseUnFocus");
static_assert(offsetof(WB_ui_Present_C_Event_MouseUnFocus, IsMouseScroll) == 0x000000, "Member 'WB_ui_Present_C_Event_MouseUnFocus::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_MouseUnFocus, Param_Cursor) == 0x000004, "Member 'WB_ui_Present_C_Event_MouseUnFocus::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_MouseUnFocus, PWidget) == 0x000008, "Member 'WB_ui_Present_C_Event_MouseUnFocus::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_MouseFocus
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Present_C_Event_MouseFocus final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_MouseFocus) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_MouseFocus");
static_assert(sizeof(WB_ui_Present_C_Event_MouseFocus) == 0x000010, "Wrong size on WB_ui_Present_C_Event_MouseFocus");
static_assert(offsetof(WB_ui_Present_C_Event_MouseFocus, IsMouseScroll) == 0x000000, "Member 'WB_ui_Present_C_Event_MouseFocus::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_MouseFocus, Param_Cursor) == 0x000004, "Member 'WB_ui_Present_C_Event_MouseFocus::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_MouseFocus, PWidget) == 0x000008, "Member 'WB_ui_Present_C_Event_MouseFocus::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_List_UnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Present_C_Event_List_UnFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_List_UnFocus) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_List_UnFocus");
static_assert(sizeof(WB_ui_Present_C_Event_List_UnFocus) == 0x000008, "Wrong size on WB_ui_Present_C_Event_List_UnFocus");
static_assert(offsetof(WB_ui_Present_C_Event_List_UnFocus, PWidget) == 0x000000, "Member 'WB_ui_Present_C_Event_List_UnFocus::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_List_Focus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Present_C_Event_List_Focus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_List_Focus) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_List_Focus");
static_assert(sizeof(WB_ui_Present_C_Event_List_Focus) == 0x000008, "Wrong size on WB_ui_Present_C_Event_List_Focus");
static_assert(offsetof(WB_ui_Present_C_Event_List_Focus, PWidget) == 0x000000, "Member 'WB_ui_Present_C_Event_List_Focus::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.Event_List_UpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Present_C_Event_List_UpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_Event_List_UpdateElement) == 0x000008, "Wrong alignment on WB_ui_Present_C_Event_List_UpdateElement");
static_assert(sizeof(WB_ui_Present_C_Event_List_UpdateElement) == 0x000010, "Wrong size on WB_ui_Present_C_Event_List_UpdateElement");
static_assert(offsetof(WB_ui_Present_C_Event_List_UpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_Present_C_Event_List_UpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_Event_List_UpdateElement, PWidget) == 0x000008, "Member 'WB_ui_Present_C_Event_List_UpdateElement::PWidget' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Present_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Present_C_UpdateState");
static_assert(sizeof(WB_ui_Present_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Present_C_UpdateState");
static_assert(offsetof(WB_ui_Present_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Present_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Present_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Present_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Present_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Present_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_Present_C_PreConstruct");
static_assert(sizeof(WB_ui_Present_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_Present_C_PreConstruct");
static_assert(offsetof(WB_ui_Present_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_Present_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Present_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_Present_C_StateNone");
static_assert(sizeof(WB_ui_Present_C_StateNone) == 0x000010, "Wrong size on WB_ui_Present_C_StateNone");
static_assert(offsetof(WB_ui_Present_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_Present_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Present_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Present_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Present_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Present_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Present_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.StateOpen
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_Present_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E8F[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Present_C_StateOpen) == 0x000008, "Wrong alignment on WB_ui_Present_C_StateOpen");
static_assert(sizeof(WB_ui_Present_C_StateOpen) == 0x000020, "Wrong size on WB_ui_Present_C_StateOpen");
static_assert(offsetof(WB_ui_Present_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_Present_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Present_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Present_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Present_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Present_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Present_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_PlaySE_ReturnValue) == 0x000010, "Member 'WB_ui_Present_C_StateOpen::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_Present_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.StateLoop
// 0x0068 (0x0068 - 0x0000)
struct WB_ui_Present_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E90[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E91[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_2;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNum_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E92[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E93[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCancelGeneralChoice_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEndGeneralChoice_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E94[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGeneralChoiceResult_ReturnValue;       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckInput_IsInput_1;                     // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E95[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_StateLoop) == 0x000008, "Wrong alignment on WB_ui_Present_C_StateLoop");
static_assert(sizeof(WB_ui_Present_C_StateLoop) == 0x000068, "Wrong size on WB_ui_Present_C_StateLoop");
static_assert(offsetof(WB_ui_Present_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_Present_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_PlaySE_ReturnValue) == 0x000008, "Member 'WB_ui_Present_C_StateLoop::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WB_ui_Present_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_PlaySE_ReturnValue_1) == 0x000018, "Member 'WB_ui_Present_C_StateLoop::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_PlaySE_ReturnValue_2) == 0x000020, "Member 'WB_ui_Present_C_StateLoop::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_GetUserParamManager_UserParamManager) == 0x000028, "Member 'WB_ui_Present_C_StateLoop::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_GetItemNum_ReturnValue) == 0x000030, "Member 'WB_ui_Present_C_StateLoop::CallFunc_GetItemNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WB_ui_Present_C_StateLoop::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000035, "Member 'WB_ui_Present_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000038, "Member 'WB_ui_Present_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000040, "Member 'WB_ui_Present_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_GetHUDMainGame_HUDMainGame_1) == 0x000048, "Member 'WB_ui_Present_C_StateLoop::CallFunc_GetHUDMainGame_HUDMainGame_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_IsCancelGeneralChoice_ReturnValue) == 0x000050, "Member 'WB_ui_Present_C_StateLoop::CallFunc_IsCancelGeneralChoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_IsEndGeneralChoice_ReturnValue) == 0x000051, "Member 'WB_ui_Present_C_StateLoop::CallFunc_IsEndGeneralChoice_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'WB_ui_Present_C_StateLoop::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_GetGeneralChoiceResult_ReturnValue) == 0x000054, "Member 'WB_ui_Present_C_StateLoop::CallFunc_GetGeneralChoiceResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'WB_ui_Present_C_StateLoop::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_CheckInput_IsInput) == 0x000059, "Member 'WB_ui_Present_C_StateLoop::CallFunc_CheckInput_IsInput' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'WB_ui_Present_C_StateLoop::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_CheckInput_IsInput_1) == 0x00005B, "Member 'WB_ui_Present_C_StateLoop::CallFunc_CheckInput_IsInput_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00005C, "Member 'WB_ui_Present_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000060, "Member 'WB_ui_Present_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.StateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_Present_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E96[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Present_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_Present_C_StateClose");
static_assert(sizeof(WB_ui_Present_C_StateClose) == 0x000014, "Wrong size on WB_ui_Present_C_StateClose");
static_assert(offsetof(WB_ui_Present_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_Present_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Present_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_Present_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_Present_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_Present_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_Present_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Present_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_Present_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.SetTargetCharacter
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Present_C_SetTargetCharacter final
{
public:
	EPlayerID                                     TargetID;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Present_C_SetTargetCharacter) == 0x000001, "Wrong alignment on WB_ui_Present_C_SetTargetCharacter");
static_assert(sizeof(WB_ui_Present_C_SetTargetCharacter) == 0x000001, "Wrong size on WB_ui_Present_C_SetTargetCharacter");
static_assert(offsetof(WB_ui_Present_C_SetTargetCharacter, TargetID) == 0x000000, "Member 'WB_ui_Present_C_SetTargetCharacter::TargetID' has a wrong offset!");

// Function WB_ui_Present.WB_ui_Present_C.CreateList
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ui_Present_C_CreateList final
{
public:
	int32                                         _WorkIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E97[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserParamManager*                      _Manager;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerID                                     _PlayerID;                                         // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E98[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E99[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9A[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9B[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9C[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemNum_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
