#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_BossName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_BossName.WB_ui_BossName_C
// 0x00E0 (0x05E8 - 0x0508)
class UWB_ui_BossName_C final : public UUIBossName
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0508(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0510(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0518(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0520(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0528(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base01;                                            // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise01_02;                                  // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise02_blue01;                              // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise02_green01;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise02_red01;                               // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise03_02;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 block_noise03_03;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 bug_grid;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Blue_2;                                   // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Green_2;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CA_Image_Red_2;                                    // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        CA_RetainerBox_2;                                  // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame_1_add;                                       // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Ghost1;                                            // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grid_parts01;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grid_parts02;                                      // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grid_parts03;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Grid_parts04;                                      // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_fade1;                                       // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_fade2;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Nomal_grid;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Nomal_grid_b_01;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_EnemyName_01;                                 // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_BossName(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void Construct();
	void Image_fade();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_BossName_C">();
	}
	static class UWB_ui_BossName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_BossName_C>();
	}
};
static_assert(alignof(UWB_ui_BossName_C) == 0x000008, "Wrong alignment on UWB_ui_BossName_C");
static_assert(sizeof(UWB_ui_BossName_C) == 0x0005E8, "Wrong size on UWB_ui_BossName_C");
static_assert(offsetof(UWB_ui_BossName_C, UberGraphFrame) == 0x000508, "Member 'UWB_ui_BossName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Out) == 0x000510, "Member 'UWB_ui_BossName_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, In) == 0x000518, "Member 'UWB_ui_BossName_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Default_none) == 0x000520, "Member 'UWB_ui_BossName_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Default) == 0x000528, "Member 'UWB_ui_BossName_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, base01) == 0x000530, "Member 'UWB_ui_BossName_C::base01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise01_02) == 0x000538, "Member 'UWB_ui_BossName_C::block_noise01_02' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise02_blue01) == 0x000540, "Member 'UWB_ui_BossName_C::block_noise02_blue01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise02_green01) == 0x000548, "Member 'UWB_ui_BossName_C::block_noise02_green01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise02_red01) == 0x000550, "Member 'UWB_ui_BossName_C::block_noise02_red01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise03_02) == 0x000558, "Member 'UWB_ui_BossName_C::block_noise03_02' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, block_noise03_03) == 0x000560, "Member 'UWB_ui_BossName_C::block_noise03_03' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, bug_grid) == 0x000568, "Member 'UWB_ui_BossName_C::bug_grid' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, CA_Image_Blue_2) == 0x000570, "Member 'UWB_ui_BossName_C::CA_Image_Blue_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, CA_Image_Green_2) == 0x000578, "Member 'UWB_ui_BossName_C::CA_Image_Green_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, CA_Image_Red_2) == 0x000580, "Member 'UWB_ui_BossName_C::CA_Image_Red_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, CA_RetainerBox_2) == 0x000588, "Member 'UWB_ui_BossName_C::CA_RetainerBox_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Frame_1_add) == 0x000590, "Member 'UWB_ui_BossName_C::Frame_1_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Ghost1) == 0x000598, "Member 'UWB_ui_BossName_C::Ghost1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Grid_parts01) == 0x0005A0, "Member 'UWB_ui_BossName_C::Grid_parts01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Grid_parts02) == 0x0005A8, "Member 'UWB_ui_BossName_C::Grid_parts02' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Grid_parts03) == 0x0005B0, "Member 'UWB_ui_BossName_C::Grid_parts03' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Grid_parts04) == 0x0005B8, "Member 'UWB_ui_BossName_C::Grid_parts04' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Image_fade1) == 0x0005C0, "Member 'UWB_ui_BossName_C::Image_fade1' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Image_fade2) == 0x0005C8, "Member 'UWB_ui_BossName_C::Image_fade2' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Nomal_grid) == 0x0005D0, "Member 'UWB_ui_BossName_C::Nomal_grid' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Nomal_grid_b_01) == 0x0005D8, "Member 'UWB_ui_BossName_C::Nomal_grid_b_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_BossName_C, Text_EnemyName_01) == 0x0005E0, "Member 'UWB_ui_BossName_C::Text_EnemyName_01' has a wrong offset!");

}

