#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_GameOver_Parts_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_ui_GameOver_Parts_1.WB_ui_GameOver_Parts_1_C.ExecuteUbergraph_WB_ui_GameOver_Parts_1
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1) == 0x000004, "Wrong alignment on WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1");
static_assert(sizeof(WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1) == 0x000004, "Wrong size on WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1");
static_assert(offsetof(WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1, EntryPoint) == 0x000000, "Member 'WB_ui_GameOver_Parts_1_C_ExecuteUbergraph_WB_ui_GameOver_Parts_1::EntryPoint' has a wrong offset!");

// Function WB_ui_GameOver_Parts_1.WB_ui_GameOver_Parts_1_C.UpdateGameOverBlackMaterial
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5859[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial) == 0x000008, "Wrong alignment on WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial");
static_assert(sizeof(WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial) == 0x000018, "Wrong size on WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial");
static_assert(offsetof(WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial, EffectMaterial) == 0x000000, "Member 'WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial::EffectMaterial' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial, CallFunc_GetEffectMaterial_ReturnValue) == 0x000010, "Member 'WB_ui_GameOver_Parts_1_C_UpdateGameOverBlackMaterial::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");

}

