#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_NexusDrive_Jack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_NexusDrive_Jack.WB_ui_NexusDrive_Jack_C
// 0x0048 (0x03D0 - 0x0388)
class UWB_ui_NexusDrive_Jack_C final : public UUIBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 base1;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 base2;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_nexusdrive_jack_01;                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DrawTime;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagDrawBonus;                                     // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ui_NexusDrive_Jack(int32 EntryPoint);
	void Construct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);
	void OnInitialized();
	void StateNone(int32 SubState);
	void StateOpen(int32 SubState);
	void StateLoop(int32 SubState);
	void StateClose(int32 SubState);
	void SetupText();
	void SetDrawBonus(bool IsDraw);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_NexusDrive_Jack_C">();
	}
	static class UWB_ui_NexusDrive_Jack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_NexusDrive_Jack_C>();
	}
};
static_assert(alignof(UWB_ui_NexusDrive_Jack_C) == 0x000008, "Wrong alignment on UWB_ui_NexusDrive_Jack_C");
static_assert(sizeof(UWB_ui_NexusDrive_Jack_C) == 0x0003D0, "Wrong size on UWB_ui_NexusDrive_Jack_C");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, UberGraphFrame) == 0x000388, "Member 'UWB_ui_NexusDrive_Jack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, Out) == 0x000390, "Member 'UWB_ui_NexusDrive_Jack_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, In) == 0x000398, "Member 'UWB_ui_NexusDrive_Jack_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, Default) == 0x0003A0, "Member 'UWB_ui_NexusDrive_Jack_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, base1) == 0x0003A8, "Member 'UWB_ui_NexusDrive_Jack_C::base1' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, base2) == 0x0003B0, "Member 'UWB_ui_NexusDrive_Jack_C::base2' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, Text_nexusdrive_jack_01) == 0x0003B8, "Member 'UWB_ui_NexusDrive_Jack_C::Text_nexusdrive_jack_01' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, DrawTime) == 0x0003C0, "Member 'UWB_ui_NexusDrive_Jack_C::DrawTime' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, Timer) == 0x0003C4, "Member 'UWB_ui_NexusDrive_Jack_C::Timer' has a wrong offset!");
static_assert(offsetof(UWB_ui_NexusDrive_Jack_C, FlagDrawBonus) == 0x0003C8, "Member 'UWB_ui_NexusDrive_Jack_C::FlagDrawBonus' has a wrong offset!");

}

