#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_weight_gauge_1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C.ExecuteUbergraph_WB_ui_PK_weight_gauge_1
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1) == 0x000004, "Wrong alignment on WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1");
static_assert(sizeof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1) == 0x000010, "Wrong size on WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1, EntryPoint) == 0x000000, "Member 'WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1, K2Node_Event_State) == 0x000004, "Member 'WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1, K2Node_Event_SubState) == 0x000008, "Member 'WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'WB_ui_PK_weight_gauge_1_C_ExecuteUbergraph_WB_ui_PK_weight_gauge_1::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_PK_weight_gauge_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_weight_gauge_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_PK_weight_gauge_1_C_UpdateState");
static_assert(sizeof(WB_ui_PK_weight_gauge_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_PK_weight_gauge_1_C_UpdateState");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_PK_weight_gauge_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_PK_weight_gauge_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_PK_weight_gauge_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C.GetPsychicObjectWeightGaugePos
// 0x0038 (0x0038 - 0x0000)
struct WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos final
{
public:
	class AActor*                                 Param_Target;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59E6[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_PsychicObjectBaseInterface_C> K2Node_DynamicCast_AsBPI_Psychic_Object_Base_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E7[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPsychicObjectWeightGaugePos_weight_gauge_pos; // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos) == 0x000008, "Wrong alignment on WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos");
static_assert(sizeof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos) == 0x000038, "Wrong size on WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos, Param_Target) == 0x000000, "Member 'WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos::Param_Target' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos, ReturnValue) == 0x000008, "Member 'WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos, K2Node_DynamicCast_AsBPI_Psychic_Object_Base_Interface) == 0x000018, "Member 'WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos::K2Node_DynamicCast_AsBPI_Psychic_Object_Base_Interface' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos, CallFunc_GetPsychicObjectWeightGaugePos_weight_gauge_pos) == 0x00002C, "Member 'WB_ui_PK_weight_gauge_1_C_GetPsychicObjectWeightGaugePos::CallFunc_GetPsychicObjectWeightGaugePos_weight_gauge_pos' has a wrong offset!");

// Function WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C.GetFontColorButton1
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_PK_weight_gauge_1_C_GetFontColorButton1 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton1) == 0x000004, "Wrong alignment on WB_ui_PK_weight_gauge_1_C_GetFontColorButton1");
static_assert(sizeof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton1) == 0x000020, "Wrong size on WB_ui_PK_weight_gauge_1_C_GetFontColorButton1");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton1, ReturnValue) == 0x000000, "Member 'WB_ui_PK_weight_gauge_1_C_GetFontColorButton1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton1, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WB_ui_PK_weight_gauge_1_C_GetFontColorButton1::K2Node_MakeStruct_LinearColor' has a wrong offset!");

// Function WB_ui_PK_weight_gauge_1.WB_ui_PK_weight_gauge_1_C.GetFontColorButton2
// 0x0020 (0x0020 - 0x0000)
struct WB_ui_PK_weight_gauge_1_C_GetFontColorButton2 final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton2) == 0x000004, "Wrong alignment on WB_ui_PK_weight_gauge_1_C_GetFontColorButton2");
static_assert(sizeof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton2) == 0x000020, "Wrong size on WB_ui_PK_weight_gauge_1_C_GetFontColorButton2");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton2, ReturnValue) == 0x000000, "Member 'WB_ui_PK_weight_gauge_1_C_GetFontColorButton2::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_weight_gauge_1_C_GetFontColorButton2, K2Node_MakeStruct_LinearColor) == 0x000010, "Member 'WB_ui_PK_weight_gauge_1_C_GetFontColorButton2::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

