#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Code

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Code.WB_ui_Code_C
// 0x0088 (0x0488 - 0x0400)
class UWB_ui_Code_C final : public UUICode
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                All_Color;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               All_Set;                                           // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ViewRange;                             // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CodeList_Color;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_font_1;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               List_Set;                                          // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDRetainerBox*                        REDRetainerBox_Menu_2;                             // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDScrollBox*                          ScrollBox_CodeList;                                // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_code_contents_1;                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_Code_Guide_1;                                 // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ui_Code_List_Parts_1_C*             WB_ui_Code_List_Parts_1;                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Code(int32 EntryPoint);
	void ListUnFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListFocusMouse(int32 IsMouseScroll, int32 Param_Index, class UUserWidget* Widget);
	void ListUnFocus(class UUserWidget* Widget);
	void ListFocus(class UUserWidget* Widget);
	void ListUpdateElement(int32 Param_Index, class UUserWidget* Widget);
	void Construct();
	void OnInitialized();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Code_C">();
	}
	static class UWB_ui_Code_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Code_C>();
	}
};
static_assert(alignof(UWB_ui_Code_C) == 0x000008, "Wrong alignment on UWB_ui_Code_C");
static_assert(sizeof(UWB_ui_Code_C) == 0x000488, "Wrong size on UWB_ui_Code_C");
static_assert(offsetof(UWB_ui_Code_C, UberGraphFrame) == 0x000400, "Member 'UWB_ui_Code_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Out) == 0x000408, "Member 'UWB_ui_Code_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Default) == 0x000410, "Member 'UWB_ui_Code_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, In) == 0x000418, "Member 'UWB_ui_Code_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, All_Color) == 0x000420, "Member 'UWB_ui_Code_C::All_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, All_Set) == 0x000428, "Member 'UWB_ui_Code_C::All_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, CanvasPanel_0) == 0x000430, "Member 'UWB_ui_Code_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, CanvasPanel_ViewRange) == 0x000438, "Member 'UWB_ui_Code_C::CanvasPanel_ViewRange' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, CodeList_Color) == 0x000440, "Member 'UWB_ui_Code_C::CodeList_Color' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Icon_font_1) == 0x000448, "Member 'UWB_ui_Code_C::Icon_font_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, List_Set) == 0x000450, "Member 'UWB_ui_Code_C::List_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Overlay_2) == 0x000458, "Member 'UWB_ui_Code_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, REDRetainerBox_Menu_2) == 0x000460, "Member 'UWB_ui_Code_C::REDRetainerBox_Menu_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, ScrollBox_CodeList) == 0x000468, "Member 'UWB_ui_Code_C::ScrollBox_CodeList' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Text_code_contents_1) == 0x000470, "Member 'UWB_ui_Code_C::Text_code_contents_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, Text_Code_Guide_1) == 0x000478, "Member 'UWB_ui_Code_C::Text_Code_Guide_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Code_C, WB_ui_Code_List_Parts_1) == 0x000480, "Member 'UWB_ui_Code_C::WB_ui_Code_List_Parts_1' has a wrong offset!");

}

