#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_PK_psychic_gauge_1

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.ExecuteUbergraph_WB_ui_PK_psychic_gauge_1
// 0x0080 (0x0080 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5825[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_State;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5826[0x2];                                     // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5827[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5828[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5829[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582A[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582B[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582C[0x2];                                     // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1) == 0x000008, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1) == 0x000080, "Wrong size on WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, EntryPoint) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000005, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, K2Node_Event_State) == 0x000010, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, K2Node_Event_SubState) == 0x000014, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, K2Node_SwitchInteger_CmpSuccess) == 0x00001C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00001D, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000020, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000024, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000025, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x000028, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x00002C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000030, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000034, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000038, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00003C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000048, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000050, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Array_Add_ReturnValue) == 0x000058, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x00005C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Array_Add_ReturnValue_1) == 0x000060, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000064, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000068, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x00006C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Array_Add_ReturnValue_2) == 0x000070, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x000074, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x000075, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x000078, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x00007C, "Member 'WB_ui_PK_psychic_gauge_1_C_ExecuteUbergraph_WB_ui_PK_psychic_gauge_1::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_UpdateState");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_PK_psychic_gauge_1_C_UpdateState");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.StateNone
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582D[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_StateNone) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_StateNone");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_StateNone) == 0x000010, "Wrong size on WB_ui_PK_psychic_gauge_1_C_StateNone");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, SubState) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateNone, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_StateNone::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.StateOpen
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_StateOpen final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582E[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_StateOpen) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_StateOpen");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_StateOpen) == 0x000014, "Wrong size on WB_ui_PK_psychic_gauge_1_C_StateOpen");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, SubState) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateOpen, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_PK_psychic_gauge_1_C_StateOpen::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.StateLoop
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_StateLoop final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582F[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5830[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5831[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5832[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_StateLoop) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_StateLoop");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_StateLoop) == 0x000028, "Wrong size on WB_ui_PK_psychic_gauge_1_C_StateLoop");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, SubState) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000010, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000014, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000018, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000019, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00001C, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000020, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateLoop, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000024, "Member 'WB_ui_PK_psychic_gauge_1_C_StateLoop::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.StateClose
// 0x0014 (0x0014 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_StateClose final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5833[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayUICurrentAnimation_isPlay;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_StateClose) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_StateClose");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_StateClose) == 0x000014, "Wrong size on WB_ui_PK_psychic_gauge_1_C_StateClose");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, SubState) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, K2Node_SwitchInteger_CmpSuccess) == 0x000005, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000006, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_StateClose, CallFunc_IsPlayUICurrentAnimation_isPlay) == 0x000010, "Member 'WB_ui_PK_psychic_gauge_1_C_StateClose::CallFunc_IsPlayUICurrentAnimation_isPlay' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.setGauge
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_SetGauge final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_SetGauge) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_SetGauge");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_SetGauge) == 0x000008, "Wrong size on WB_ui_PK_psychic_gauge_1_C_SetGauge");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGauge, Param) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGauge::Param' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGauge, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGauge::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.UseGauge
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_UseGauge final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_UseGauge) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_UseGauge");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_UseGauge) == 0x000010, "Wrong size on WB_ui_PK_psychic_gauge_1_C_UseGauge");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UseGauge, Percent) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_UseGauge::Percent' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UseGauge, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_UseGauge::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UseGauge, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_UseGauge::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UseGauge, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'WB_ui_PK_psychic_gauge_1_C_UseGauge::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.SetGrowColor
// 0x0004 (0x0004 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_SetGrowColor final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_SetGrowColor) == 0x000004, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_SetGrowColor");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_SetGrowColor) == 0x000004, "Wrong size on WB_ui_PK_psychic_gauge_1_C_SetGrowColor");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGrowColor, Param_Index) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGrowColor::Param_Index' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.UpdateGauge
// 0x0090 (0x0090 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_UpdateGauge final
{
public:
	float                                         DeltaSecond;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5834[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 _WidthListBar5;                                    // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 _LevelOffsetDeltaTime;                             // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5835[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5836[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5837[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5838[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge) == 0x000008, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_UpdateGauge");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge) == 0x000090, "Wrong size on WB_ui_PK_psychic_gauge_1_C_UpdateGauge");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, DeltaSecond) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::DeltaSecond' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, _WidthListBar5) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::_WidthListBar5' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, _LevelOffsetDeltaTime) == 0x000018, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::_LevelOffsetDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Less_FloatFloat_ReturnValue) == 0x000028, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000040, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, K2Node_MakeArray_Array) == 0x000048, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000060, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_IsValid_ReturnValue_2) == 0x000069, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, K2Node_MakeArray_Array_1) == 0x000070, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Add_FloatFloat_ReturnValue) == 0x000080, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000084, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000088, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_UpdateGauge, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00008C, "Member 'WB_ui_PK_psychic_gauge_1_C_UpdateGauge::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.SetGaugeLevel
// 0x0030 (0x0030 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5839[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 _WidthList_Bar3;                                   // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel) == 0x000008, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel) == 0x000030, "Wrong size on WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, Level) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::Level' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, _WidthList_Bar3) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::_WidthList_Bar3' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, K2Node_MakeArray_Array) == 0x000018, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002A, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.LoadPsychicGaugeTable
// 0x0050 (0x0050 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable final
{
public:
	TMap<class FName, struct FPsychicGuageDataCell> CallFunc_LoadGaugeTableDatas_return;               // 0x0000(0x0050)()
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable) == 0x000008, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable) == 0x000050, "Wrong size on WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable, CallFunc_LoadGaugeTableDatas_return) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_LoadPsychicGaugeTable::CallFunc_LoadGaugeTableDatas_return' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.SetGaugeEffectTime
// 0x0058 (0x0058 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPsychicGuageDataCell                  _Work;                                             // 0x0008(0x0048)(Edit, BlueprintVisible)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime) == 0x000008, "Wrong alignment on WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime");
static_assert(sizeof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime) == 0x000058, "Wrong size on WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime, Param_Index) == 0x000000, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime, Time) == 0x000004, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime::Time' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime, _Work) == 0x000008, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime::_Work' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime, CallFunc_Map_Length_ReturnValue) == 0x000050, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WB_ui_PK_psychic_gauge_1_C_SetGaugeEffectTime::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WB_ui_PK_psychic_gauge_1.WB_ui_PK_psychic_gauge_1_C.UpdateGaugeEffect
// 0x0128 (0x0128 - 0x0000)
struct WB_ui_PK_psychic_gauge_1_C_UpdateGaugeEffect final
{
public:
	float                                         DeltaSecond;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _LeapAlpha;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPsychicGuageDataCell                  _NextTableValue;                                   // 0x0008(0x0048)(Edit, BlueprintVisible)
	struct FPsychicGuageDataCell                  _CurrentTableValue;                                // 0x0050(0x0048)(Edit, BlueprintVisible)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583A[0x2];                                     // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_583B[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPsychicGuageDataCell>          CallFunc_Map_Values_Values;                        // 0x00A8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FPsychicGuageDataCell>          CallFunc_Map_Values_Values_1;                      // 0x00B8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583C[0x2];                                     // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583D[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583E[0x2];                                     // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPsychicGuageDataCell>          CallFunc_Map_Values_Values_2;                      // 0x00F8(0x0010)(ReferenceParm, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_583F[0x2];                                     // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPsychicGuageDataCell>          CallFunc_Map_Values_Values_3;                      // 0x0110(0x0010)(ReferenceParm, HasGetValueTypeHash)
