#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Target_Brain_1

#include "Basic.hpp"

#include "Enum_ui_UV_Button_N1_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Target_Brain_1.WB_ui_Target_Brain_1_C.ExecuteUbergraph_WB_ui_Target_Brain_1
// 0x0028 (0x0028 - 0x0000)
struct WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F7E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_isChangedIconDeviceType_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F7F[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateButton_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateButton_ReturnValue_1;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1) == 0x000008, "Wrong alignment on WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1");
static_assert(sizeof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1) == 0x000028, "Wrong size on WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, EntryPoint) == 0x000000, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000008, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, CallFunc_isChangedIconDeviceType_ReturnValue) == 0x000010, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::CallFunc_isChangedIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, K2Node_Event_State) == 0x000014, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, K2Node_Event_SubState) == 0x000018, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, CallFunc_UpdateButton_ReturnValue) == 0x000020, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::CallFunc_UpdateButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1, CallFunc_UpdateButton_ReturnValue_1) == 0x000021, "Member 'WB_ui_Target_Brain_1_C_ExecuteUbergraph_WB_ui_Target_Brain_1::CallFunc_UpdateButton_ReturnValue_1' has a wrong offset!");

// Function WB_ui_Target_Brain_1.WB_ui_Target_Brain_1_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Target_Brain_1_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Target_Brain_1_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Target_Brain_1_C_UpdateState");
static_assert(sizeof(WB_ui_Target_Brain_1_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Target_Brain_1_C_UpdateState");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Target_Brain_1_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Target_Brain_1_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Target_Brain_1_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Target_Brain_1.WB_ui_Target_Brain_1_C.UpdateButton
// 0x0090 (0x0090 - 0x0000)
struct WB_ui_Target_Brain_1_C_UpdateButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F80[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_UV_Button_N1>                  _ButtonList;                                       // 0x0008(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FText>                           _TextList;                                         // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         _DrawType;                                         // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F81[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, HasGetValueTypeHash)
	class UUserParamManager*                      CallFunc_GetUserParamManager_UserParamManager;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOptionParam*                           CallFunc_GetOptionParam_ReturnValue;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERSGamepadInputName                           CallFunc_GetControllerParamValue_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F82[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUDMainGame_C*                         CallFunc_GetHUDMainGame_HUDMainGame;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EInputDeviceType                              CallFunc_getIconDeviceType_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F83[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_ui_UV_Button_N1>                  K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Target_Brain_1_C_UpdateButton) == 0x000008, "Wrong alignment on WB_ui_Target_Brain_1_C_UpdateButton");
static_assert(sizeof(WB_ui_Target_Brain_1_C_UpdateButton) == 0x000090, "Wrong size on WB_ui_Target_Brain_1_C_UpdateButton");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, ReturnValue) == 0x000000, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, _ButtonList) == 0x000008, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::_ButtonList' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, _TextList) == 0x000018, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::_TextList' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, _DrawType) == 0x000028, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::_DrawType' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_GetUserParamManager_UserParamManager) == 0x000040, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_GetUserParamManager_UserParamManager' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_GetOptionParam_ReturnValue) == 0x000048, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_GetOptionParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_GetControllerParamValue_ReturnValue) == 0x000050, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_GetControllerParamValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, K2Node_SwitchInteger_CmpSuccess) == 0x000051, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_GetHUDMainGame_HUDMainGame) == 0x000058, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_GetHUDMainGame_HUDMainGame' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_GetPlatformName_ReturnValue) == 0x000060, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_getIconDeviceType_ReturnValue) == 0x000070, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_getIconDeviceType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000071, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, K2Node_SwitchEnum_CmpSuccess) == 0x000072, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000073, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, K2Node_MakeArray_Array_1) == 0x000078, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Target_Brain_1_C_UpdateButton, CallFunc_BooleanOR_ReturnValue) == 0x000088, "Member 'WB_ui_Target_Brain_1_C_UpdateButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

