#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Notice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_Notice.WB_ui_Notice_C
// 0x0088 (0x04E0 - 0x0458)
class UWB_ui_Notice_C final : public UUINoticeMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0460(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       In;                                                // 0x0468(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_none;                                      // 0x0470(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Bm_Set;                                            // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_bn;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Frame_1;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Frame_2;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Frame_3;                                      // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDImageBase*                          Icon_kizuna;                                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Notice_1;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Notice_ClearGetter;                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Noise;                                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_notice_1;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_notice_2;                                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_notice_3;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_Notice(int32 EntryPoint);
	void Event_ClearGetterAchievement(EClearGetterType Value);
	void WishListRemove(EUINoticeMessageCallType SenderType, class FName DatatableId);
	void SetNoticeIcon(int32 Type);
	void Kasutamu(EUINoticeMessageCallType SenderType, class FName DatatableId);
	void SubQuest(EUINoticeMessageCallType SenderType, class FName DatatableId);
	void Construct();
	void BrainMessage(EUINoticeMessageCallType SenderType, class FName DatatableId);
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_Notice_C">();
	}
	static class UWB_ui_Notice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_Notice_C>();
	}
};
static_assert(alignof(UWB_ui_Notice_C) == 0x000008, "Wrong alignment on UWB_ui_Notice_C");
static_assert(sizeof(UWB_ui_Notice_C) == 0x0004E0, "Wrong size on UWB_ui_Notice_C");
static_assert(offsetof(UWB_ui_Notice_C, UberGraphFrame) == 0x000458, "Member 'UWB_ui_Notice_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Out) == 0x000460, "Member 'UWB_ui_Notice_C::Out' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, In) == 0x000468, "Member 'UWB_ui_Notice_C::In' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Default_none) == 0x000470, "Member 'UWB_ui_Notice_C::Default_none' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Default) == 0x000478, "Member 'UWB_ui_Notice_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Bm_Set) == 0x000480, "Member 'UWB_ui_Notice_C::Bm_Set' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_bn) == 0x000488, "Member 'UWB_ui_Notice_C::Icon_bn' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_Frame_1) == 0x000490, "Member 'UWB_ui_Notice_C::Icon_Frame_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_Frame_2) == 0x000498, "Member 'UWB_ui_Notice_C::Icon_Frame_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_Frame_3) == 0x0004A0, "Member 'UWB_ui_Notice_C::Icon_Frame_3' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_kizuna) == 0x0004A8, "Member 'UWB_ui_Notice_C::Icon_kizuna' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_Notice_1) == 0x0004B0, "Member 'UWB_ui_Notice_C::Icon_Notice_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Icon_Notice_ClearGetter) == 0x0004B8, "Member 'UWB_ui_Notice_C::Icon_Notice_ClearGetter' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Noise) == 0x0004C0, "Member 'UWB_ui_Notice_C::Noise' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Text_notice_1) == 0x0004C8, "Member 'UWB_ui_Notice_C::Text_notice_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Text_notice_2) == 0x0004D0, "Member 'UWB_ui_Notice_C::Text_notice_2' has a wrong offset!");
static_assert(offsetof(UWB_ui_Notice_C, Text_notice_3) == 0x0004D8, "Member 'UWB_ui_Notice_C::Text_notice_3' has a wrong offset!");

}

