#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_Party

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_Party.WB_ui_Party_C.SetCharaID_Main__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Party_C_SetCharaID_Main__DelegateSignature final
{
public:
	int32                                         CharaID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4324[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoiseReset;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_C_SetCharaID_Main__DelegateSignature) == 0x000008, "Wrong alignment on WB_ui_Party_C_SetCharaID_Main__DelegateSignature");
static_assert(sizeof(WB_ui_Party_C_SetCharaID_Main__DelegateSignature) == 0x000018, "Wrong size on WB_ui_Party_C_SetCharaID_Main__DelegateSignature");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Main__DelegateSignature, CharaID) == 0x000000, "Member 'WB_ui_Party_C_SetCharaID_Main__DelegateSignature::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Main__DelegateSignature, Image) == 0x000008, "Member 'WB_ui_Party_C_SetCharaID_Main__DelegateSignature::Image' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Main__DelegateSignature, IsNoiseReset) == 0x000010, "Member 'WB_ui_Party_C_SetCharaID_Main__DelegateSignature::IsNoiseReset' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.SetCharaID_Sub__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Party_C_SetCharaID_Sub__DelegateSignature final
{
public:
	int32                                         CharaID;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4325[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 Image;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoiseReset;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_C_SetCharaID_Sub__DelegateSignature) == 0x000008, "Wrong alignment on WB_ui_Party_C_SetCharaID_Sub__DelegateSignature");
static_assert(sizeof(WB_ui_Party_C_SetCharaID_Sub__DelegateSignature) == 0x000018, "Wrong size on WB_ui_Party_C_SetCharaID_Sub__DelegateSignature");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Sub__DelegateSignature, CharaID) == 0x000000, "Member 'WB_ui_Party_C_SetCharaID_Sub__DelegateSignature::CharaID' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Sub__DelegateSignature, Image) == 0x000008, "Member 'WB_ui_Party_C_SetCharaID_Sub__DelegateSignature::Image' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_SetCharaID_Sub__DelegateSignature, IsNoiseReset) == 0x000010, "Member 'WB_ui_Party_C_SetCharaID_Sub__DelegateSignature::IsNoiseReset' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.SetScene__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_C_SetScene__DelegateSignature final
{
public:
	EUIMain3DCharacterSceneID                     SceneID;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_SetScene__DelegateSignature) == 0x000001, "Wrong alignment on WB_ui_Party_C_SetScene__DelegateSignature");
static_assert(sizeof(WB_ui_Party_C_SetScene__DelegateSignature) == 0x000001, "Wrong size on WB_ui_Party_C_SetScene__DelegateSignature");
static_assert(offsetof(WB_ui_Party_C_SetScene__DelegateSignature, SceneID) == 0x000000, "Member 'WB_ui_Party_C_SetScene__DelegateSignature::SceneID' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.SetPopupMode__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_C_SetPopupMode__DelegateSignature final
{
public:
	bool                                          IsPopup;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong alignment on WB_ui_Party_C_SetPopupMode__DelegateSignature");
static_assert(sizeof(WB_ui_Party_C_SetPopupMode__DelegateSignature) == 0x000001, "Wrong size on WB_ui_Party_C_SetPopupMode__DelegateSignature");
static_assert(offsetof(WB_ui_Party_C_SetPopupMode__DelegateSignature, IsPopup) == 0x000000, "Member 'WB_ui_Party_C_SetPopupMode__DelegateSignature::IsPopup' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.ExecuteUbergraph_WB_ui_Party
// 0x0210 (0x0210 - 0x0000)
struct WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4326[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4327[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4328[0x2];                                     // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4329[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432A[0x3];                                     // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432B[0x2];                                     // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_6;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_index;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432C[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_7;                      // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Party_MemberList_Parts_1_C*      K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1; // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432D[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_6;                      // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_5;                      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Party_MemberList_Parts_1_C*      K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_1; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432E[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Party_MemberList_Parts_1_C*      K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_2; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_432F[0x3];                                     // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_isMouseScroll_1;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_2;                       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4330[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget_4;                      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_isMouseScroll;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_cursor_1;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_3;                      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ui_Party_MemberList_Parts_1_C*      K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_3; // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4331[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Party_MemberList_Parts_1_C*      K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_4; // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4332[0x3];                                     // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4333[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ui_Party_MemberList_Parts_1_C*      CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_7;             // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4334[0x3];                                     // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRedMouseArgument                      K2Node_CustomEvent_argument_1;                     // 0x011C(0x000C)(NoDestructor)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_2;                      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4335[0x3];                                     // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FRedMouseArgument& Argument, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0134(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_5;            // 0x0164(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_cursor;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_CustomEvent_pWidget_1;                      // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_6;            // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4336[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_8;             // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_1;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_2;                     // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URSAtomComponentBase*                   CallFunc_PlaySE_ReturnValue_3;                     // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4337[0x1];                                     // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_9;             // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRedMouseArgument                      K2Node_CustomEvent_argument;                       // 0x01D0(0x000C)(NoDestructor)
	uint8                                         Pad_4338[0x4];                                     // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            K2Node_CustomEvent_pWidget;                        // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_10;           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4339[0x3];                                     // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_10;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_11;           // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_12;           // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433A[0x2];                                     // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_11;            // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_12;            // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_13;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_433B[0x1];                                     // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_13;            // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party) == 0x000008, "Wrong alignment on WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party");
static_assert(sizeof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party) == 0x000210, "Wrong size on WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, EntryPoint) == 0x000000, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000010, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000018, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x00001C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000020, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_Event_IsDesignTime) == 0x000021, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_2) == 0x000024, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000028, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000029, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_3) == 0x00002C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_4) == 0x000030, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_5) == 0x000034, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_Event_State) == 0x000038, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_Event_SubState) == 0x00003C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_Event_DeltaSeconds) == 0x000040, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_5) == 0x000044, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_SwitchInteger_CmpSuccess) == 0x000048, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_6) == 0x000049, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_6) == 0x00004C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_index) == 0x000060, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_7) == 0x000068, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1) == 0x000070, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_6) == 0x000080, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_5) == 0x000088, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_1) == 0x000090, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_2) == 0x0000A0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_isMouseScroll_1) == 0x0000AC, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_cursor_2) == 0x0000B0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_cursor_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_4) == 0x0000B8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_isMouseScroll) == 0x0000C0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_cursor_1) == 0x0000C4, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_cursor_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_3) == 0x0000C8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_3) == 0x0000D0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_bSuccess_3) == 0x0000D8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_4) == 0x0000E0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_AsWB_Ui_Party_Member_List_Parts_1_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_DynamicCast_bSuccess_4) == 0x0000E8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Array_Length_ReturnValue) == 0x0000EC, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000F0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Subtract_IntInt_ReturnValue) == 0x000100, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_7) == 0x000104, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Array_Get_Item) == 0x000108, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_7) == 0x000110, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Array_Length_ReturnValue_1) == 0x000114, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_argument_1) == 0x00011C, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_argument_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_2) == 0x000128, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_2) == 0x000134, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_3) == 0x000144, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_4) == 0x000154, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_5) == 0x000164, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_cursor) == 0x000174, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget_1) == 0x000178, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_6) == 0x000180, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_8) == 0x000190, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_8) == 0x000194, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CreateDelegate_OutputDelegate_7) == 0x000198, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_PlaySE_ReturnValue) == 0x0001A8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_PlaySE_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_PlaySE_ReturnValue_1) == 0x0001B0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_PlaySE_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_PlaySE_ReturnValue_2) == 0x0001B8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_PlaySE_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_PlaySE_ReturnValue_3) == 0x0001C0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_PlaySE_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_GetPlatformType_ReturnValue) == 0x0001C8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_9) == 0x0001C9, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001CA, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_9) == 0x0001CC, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_argument) == 0x0001D0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_argument' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, K2Node_CustomEvent_pWidget) == 0x0001E0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::K2Node_CustomEvent_pWidget' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_10) == 0x0001E8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_10) == 0x0001EC, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_11) == 0x0001F0, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_12) == 0x0001F1, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_11) == 0x0001F4, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_12) == 0x0001F8, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Not_PreBool_ReturnValue) == 0x0001FC, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001FD, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_BooleanAND_ReturnValue) == 0x0001FE, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001FF, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_BooleanAND_ReturnValue_1) == 0x000200, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralByte_ReturnValue_13) == 0x000201, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000202, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_Conv_ByteToInt_ReturnValue_13) == 0x000204, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_Conv_ByteToInt_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party, CallFunc_MakeLiteralInt_ReturnValue) == 0x000208, "Member 'WB_ui_Party_C_ExecuteUbergraph_WB_ui_Party::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.CustomEvent
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Party_C_CustomEvent final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_433C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_CustomEvent) == 0x000008, "Wrong alignment on WB_ui_Party_C_CustomEvent");
static_assert(sizeof(WB_ui_Party_C_CustomEvent) == 0x000018, "Wrong size on WB_ui_Party_C_CustomEvent");
static_assert(offsetof(WB_ui_Party_C_CustomEvent, Argument) == 0x000000, "Member 'WB_ui_Party_C_CustomEvent::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_CustomEvent, PWidget) == 0x000010, "Member 'WB_ui_Party_C_CustomEvent::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.MouseListLeftDown
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Party_C_MouseListLeftDown final
{
public:
	int32                                         Param_Cursor;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_MouseListLeftDown) == 0x000008, "Wrong alignment on WB_ui_Party_C_MouseListLeftDown");
static_assert(sizeof(WB_ui_Party_C_MouseListLeftDown) == 0x000010, "Wrong size on WB_ui_Party_C_MouseListLeftDown");
static_assert(offsetof(WB_ui_Party_C_MouseListLeftDown, Param_Cursor) == 0x000000, "Member 'WB_ui_Party_C_MouseListLeftDown::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_MouseListLeftDown, PWidget) == 0x000008, "Member 'WB_ui_Party_C_MouseListLeftDown::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.á¤óê¹Èxž
// 0x0018 (0x0018 - 0x0000)
struct WB_ui_Party_C_______x_ final
{
public:
	struct FRedMouseArgument                      Argument;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	uint8                                         Pad_433E[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_______x_) == 0x000008, "Wrong alignment on WB_ui_Party_C_______x_");
static_assert(sizeof(WB_ui_Party_C_______x_) == 0x000018, "Wrong size on WB_ui_Party_C_______x_");
static_assert(offsetof(WB_ui_Party_C_______x_, Argument) == 0x000000, "Member 'WB_ui_Party_C_______x_::Argument' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_______x_, PWidget) == 0x000010, "Member 'WB_ui_Party_C_______x_::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.MouseUnFocus
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Party_C_MouseUnFocus final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_MouseUnFocus) == 0x000008, "Wrong alignment on WB_ui_Party_C_MouseUnFocus");
static_assert(sizeof(WB_ui_Party_C_MouseUnFocus) == 0x000010, "Wrong size on WB_ui_Party_C_MouseUnFocus");
static_assert(offsetof(WB_ui_Party_C_MouseUnFocus, IsMouseScroll) == 0x000000, "Member 'WB_ui_Party_C_MouseUnFocus::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_MouseUnFocus, Param_Cursor) == 0x000004, "Member 'WB_ui_Party_C_MouseUnFocus::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_MouseUnFocus, PWidget) == 0x000008, "Member 'WB_ui_Party_C_MouseUnFocus::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.MouseFocus
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Party_C_MouseFocus final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Cursor;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_MouseFocus) == 0x000008, "Wrong alignment on WB_ui_Party_C_MouseFocus");
static_assert(sizeof(WB_ui_Party_C_MouseFocus) == 0x000010, "Wrong size on WB_ui_Party_C_MouseFocus");
static_assert(offsetof(WB_ui_Party_C_MouseFocus, IsMouseScroll) == 0x000000, "Member 'WB_ui_Party_C_MouseFocus::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_MouseFocus, Param_Cursor) == 0x000004, "Member 'WB_ui_Party_C_MouseFocus::Param_Cursor' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_MouseFocus, PWidget) == 0x000008, "Member 'WB_ui_Party_C_MouseFocus::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.EventSubListUnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Party_C_EventSubListUnFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_EventSubListUnFocus) == 0x000008, "Wrong alignment on WB_ui_Party_C_EventSubListUnFocus");
static_assert(sizeof(WB_ui_Party_C_EventSubListUnFocus) == 0x000008, "Wrong size on WB_ui_Party_C_EventSubListUnFocus");
static_assert(offsetof(WB_ui_Party_C_EventSubListUnFocus, PWidget) == 0x000000, "Member 'WB_ui_Party_C_EventSubListUnFocus::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.EventSubListFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_Party_C_EventSubListFocus final
{
public:
	class UUserWidget*                            PWidget;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_EventSubListFocus) == 0x000008, "Wrong alignment on WB_ui_Party_C_EventSubListFocus");
static_assert(sizeof(WB_ui_Party_C_EventSubListFocus) == 0x000008, "Wrong size on WB_ui_Party_C_EventSubListFocus");
static_assert(offsetof(WB_ui_Party_C_EventSubListFocus, PWidget) == 0x000000, "Member 'WB_ui_Party_C_EventSubListFocus::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.EventSubListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_Party_C_EventSubListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_433F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            PWidget;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_EventSubListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_Party_C_EventSubListUpdateElement");
static_assert(sizeof(WB_ui_Party_C_EventSubListUpdateElement) == 0x000010, "Wrong size on WB_ui_Party_C_EventSubListUpdateElement");
static_assert(offsetof(WB_ui_Party_C_EventSubListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_Party_C_EventSubListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_EventSubListUpdateElement, PWidget) == 0x000008, "Member 'WB_ui_Party_C_EventSubListUpdateElement::PWidget' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_Party_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_Party_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_Party_C_UpdateState");
static_assert(sizeof(WB_ui_Party_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_Party_C_UpdateState");
static_assert(offsetof(WB_ui_Party_C_UpdateState, State) == 0x000000, "Member 'WB_ui_Party_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_Party_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_Party_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_Party_C_UpdateState::DeltaSeconds' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ui_Party_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ui_Party_C_PreConstruct) == 0x000001, "Wrong alignment on WB_ui_Party_C_PreConstruct");
static_assert(sizeof(WB_ui_Party_C_PreConstruct) == 0x000001, "Wrong size on WB_ui_Party_C_PreConstruct");
static_assert(offsetof(WB_ui_Party_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_ui_Party_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_ui_Party.WB_ui_Party_C.StateNone
// 0x0038 (0x0038 - 0x0000)
struct WB_ui_Party_C_StateNone final
{
public:
	int32                                         SubState;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   _KeyItemNameDLC2;                                  // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   _KeyItemNameDLC1;                                  // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4340[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
