#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_MissionSimulator_Parts_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BattlePrototype_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ui_MissionSimulator_Parts_1.WB_ui_MissionSimulator_Parts_1_C
// 0x0068 (0x0460 - 0x03F8)
class UWB_ui_MissionSimulator_Parts_1_C final : public UUIVisionSimulatorListIndex
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select_lock_in;                                    // 0x0400(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_lock;                                       // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default_lock;                                      // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select_in;                                         // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Select;                                            // 0x0420(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Default;                                           // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Icon_new;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Rank_s2;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Rank_s2_add;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Rank_Set_s2;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_mission_list_1;                               // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UREDTextBlock*                          Text_mission_list_2;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ui_MissionSimulator_Parts_1(int32 EntryPoint);
	void Construct();
	void UpdateState(int32 State, int32 SubState, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ui_MissionSimulator_Parts_1_C">();
	}
	static class UWB_ui_MissionSimulator_Parts_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ui_MissionSimulator_Parts_1_C>();
	}
};
static_assert(alignof(UWB_ui_MissionSimulator_Parts_1_C) == 0x000008, "Wrong alignment on UWB_ui_MissionSimulator_Parts_1_C");
static_assert(sizeof(UWB_ui_MissionSimulator_Parts_1_C) == 0x000460, "Wrong size on UWB_ui_MissionSimulator_Parts_1_C");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, UberGraphFrame) == 0x0003F8, "Member 'UWB_ui_MissionSimulator_Parts_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Select_lock_in) == 0x000400, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Select_lock_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Select_lock) == 0x000408, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Select_lock' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Default_lock) == 0x000410, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Default_lock' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Select_in) == 0x000418, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Select_in' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Select) == 0x000420, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Select' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Default) == 0x000428, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Default' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Icon_new) == 0x000430, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Icon_new' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Icon_Rank_s2) == 0x000438, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Icon_Rank_s2' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Icon_Rank_s2_add) == 0x000440, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Icon_Rank_s2_add' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Rank_Set_s2) == 0x000448, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Rank_Set_s2' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Text_mission_list_1) == 0x000450, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Text_mission_list_1' has a wrong offset!");
static_assert(offsetof(UWB_ui_MissionSimulator_Parts_1_C, Text_mission_list_2) == 0x000458, "Member 'UWB_ui_MissionSimulator_Parts_1_C::Text_mission_list_2' has a wrong offset!");

}

