#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ui_ShopContents

#include "Basic.hpp"

#include "BattlePrototype_structs.hpp"


namespace SDK::Params
{

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ExecuteUbergraph_WB_ui_ShopContents
// 0x0110 (0x0110 - 0x0000)
struct WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95C0[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_State;                                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_SubState;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Num_Variable_1;                      // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_2;                              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_4;                             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_3;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_2;                             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95C1[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 IsMouseScroll, int32 Cursor, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_95C2[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_ui_ShopContents_Parts_6_C*>  K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll_1;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index_1;                              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget_1;                             // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_isMouseScroll;                        // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_index;                                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_Event_Widget;                               // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlatFormType                                 CallFunc_GetPlatformType_ReturnValue;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95C3[0x2];                                     // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUserWidget* PWidget)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_95C4[0x4];                                     // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array_1;                          // 0x00D8(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Index, class UUserWidget* PWidget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWB_ui_ShopContents_Parts_1_C*>  K2Node_MakeArray_Array_2;                          // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents");
static_assert(sizeof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents) == 0x000110, "Wrong size on WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, EntryPoint) == 0x000000, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Loop_Num_Variable) == 0x000010, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Loop_Num_Variable' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_State) == 0x000018, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_SubState) == 0x00001C, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Loop_Num_Variable_1) == 0x000030, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Loop_Num_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_index_2) == 0x000034, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_index_2' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_Widget_4) == 0x000038, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_Widget_4' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_Widget_3) == 0x000040, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_Widget_3' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_Widget_2) == 0x000048, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_Widget_2' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Less_IntInt_ReturnValue_1) == 0x000054, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_MakeArray_Array) == 0x000080, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_isMouseScroll_1) == 0x000090, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_isMouseScroll_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_index_1) == 0x000094, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_index_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_Widget_1) == 0x000098, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_Widget_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_isMouseScroll) == 0x0000A0, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_isMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_index) == 0x0000A4, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_index' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_Event_Widget) == 0x0000A8, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_Event_Widget' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_GetPlatformType_ReturnValue) == 0x0000B0, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B1, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B4, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000C4, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_MakeArray_Array_1) == 0x0000D8, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000F0, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents, K2Node_MakeArray_Array_2) == 0x000100, "Member 'WB_ui_ShopContents_C_ExecuteUbergraph_WB_ui_ShopContents::K2Node_MakeArray_Array_2' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ListUnFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_ShopContents_C_ListUnFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ListUnFocusMouse) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ListUnFocusMouse");
static_assert(sizeof(WB_ui_ShopContents_C_ListUnFocusMouse) == 0x000010, "Wrong size on WB_ui_ShopContents_C_ListUnFocusMouse");
static_assert(offsetof(WB_ui_ShopContents_C_ListUnFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_ShopContents_C_ListUnFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ListUnFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_ShopContents_C_ListUnFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ListUnFocusMouse, Widget) == 0x000008, "Member 'WB_ui_ShopContents_C_ListUnFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ListFocusMouse
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_ShopContents_C_ListFocusMouse final
{
public:
	int32                                         IsMouseScroll;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ListFocusMouse) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ListFocusMouse");
static_assert(sizeof(WB_ui_ShopContents_C_ListFocusMouse) == 0x000010, "Wrong size on WB_ui_ShopContents_C_ListFocusMouse");
static_assert(offsetof(WB_ui_ShopContents_C_ListFocusMouse, IsMouseScroll) == 0x000000, "Member 'WB_ui_ShopContents_C_ListFocusMouse::IsMouseScroll' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ListFocusMouse, Param_Index) == 0x000004, "Member 'WB_ui_ShopContents_C_ListFocusMouse::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ListFocusMouse, Widget) == 0x000008, "Member 'WB_ui_ShopContents_C_ListFocusMouse::Widget' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ListFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_ShopContents_C_ListFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ListFocus) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ListFocus");
static_assert(sizeof(WB_ui_ShopContents_C_ListFocus) == 0x000008, "Wrong size on WB_ui_ShopContents_C_ListFocus");
static_assert(offsetof(WB_ui_ShopContents_C_ListFocus, Widget) == 0x000000, "Member 'WB_ui_ShopContents_C_ListFocus::Widget' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ListUnFocus
// 0x0008 (0x0008 - 0x0000)
struct WB_ui_ShopContents_C_ListUnFocus final
{
public:
	class UUserWidget*                            Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ListUnFocus) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ListUnFocus");
static_assert(sizeof(WB_ui_ShopContents_C_ListUnFocus) == 0x000008, "Wrong size on WB_ui_ShopContents_C_ListUnFocus");
static_assert(offsetof(WB_ui_ShopContents_C_ListUnFocus, Widget) == 0x000000, "Member 'WB_ui_ShopContents_C_ListUnFocus::Widget' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.ListUpdateElement
// 0x0010 (0x0010 - 0x0000)
struct WB_ui_ShopContents_C_ListUpdateElement final
{
public:
	int32                                         Param_Index;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_ListUpdateElement) == 0x000008, "Wrong alignment on WB_ui_ShopContents_C_ListUpdateElement");
static_assert(sizeof(WB_ui_ShopContents_C_ListUpdateElement) == 0x000010, "Wrong size on WB_ui_ShopContents_C_ListUpdateElement");
static_assert(offsetof(WB_ui_ShopContents_C_ListUpdateElement, Param_Index) == 0x000000, "Member 'WB_ui_ShopContents_C_ListUpdateElement::Param_Index' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_ListUpdateElement, Widget) == 0x000008, "Member 'WB_ui_ShopContents_C_ListUpdateElement::Widget' has a wrong offset!");

// Function WB_ui_ShopContents.WB_ui_ShopContents_C.UpdateState
// 0x000C (0x000C - 0x0000)
struct WB_ui_ShopContents_C_UpdateState final
{
public:
	int32                                         State;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SubState;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ui_ShopContents_C_UpdateState) == 0x000004, "Wrong alignment on WB_ui_ShopContents_C_UpdateState");
static_assert(sizeof(WB_ui_ShopContents_C_UpdateState) == 0x00000C, "Wrong size on WB_ui_ShopContents_C_UpdateState");
static_assert(offsetof(WB_ui_ShopContents_C_UpdateState, State) == 0x000000, "Member 'WB_ui_ShopContents_C_UpdateState::State' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_UpdateState, SubState) == 0x000004, "Member 'WB_ui_ShopContents_C_UpdateState::SubState' has a wrong offset!");
static_assert(offsetof(WB_ui_ShopContents_C_UpdateState, DeltaSeconds) == 0x000008, "Member 'WB_ui_ShopContents_C_UpdateState::DeltaSeconds' has a wrong offset!");

}

