#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeakObjectEntryEnemy

#include "Basic.hpp"

#include "WeakObjectRecommendEnemy_structs.hpp"


namespace SDK
{

// UserDefinedStruct WeakObjectEntryEnemy.WeakObjectEntryEnemy
// 0x0034 (0x0034 - 0x0000)
struct FWeakObjectEntryEnemy final
{
public:
	int32                                         No_12_96C2A90746F50D0C9F33BCAE60BE0A57;            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWeakObjectRecommendEnemy              Recommend_26_88DEC1574FCCF43745DFABB3DB31636C;     // 0x0004(0x002C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Draw_23_9569083549EA3AE486B47CABAF4FF4B6;          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsDraw_28_E80940B34B48F650CA9D3C844F046C80;        // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FWeakObjectEntryEnemy) == 0x000004, "Wrong alignment on FWeakObjectEntryEnemy");
static_assert(sizeof(FWeakObjectEntryEnemy) == 0x000034, "Wrong size on FWeakObjectEntryEnemy");
static_assert(offsetof(FWeakObjectEntryEnemy, No_12_96C2A90746F50D0C9F33BCAE60BE0A57) == 0x000000, "Member 'FWeakObjectEntryEnemy::No_12_96C2A90746F50D0C9F33BCAE60BE0A57' has a wrong offset!");
static_assert(offsetof(FWeakObjectEntryEnemy, Recommend_26_88DEC1574FCCF43745DFABB3DB31636C) == 0x000004, "Member 'FWeakObjectEntryEnemy::Recommend_26_88DEC1574FCCF43745DFABB3DB31636C' has a wrong offset!");
static_assert(offsetof(FWeakObjectEntryEnemy, Draw_23_9569083549EA3AE486B47CABAF4FF4B6) == 0x000030, "Member 'FWeakObjectEntryEnemy::Draw_23_9569083549EA3AE486B47CABAF4FF4B6' has a wrong offset!");
static_assert(offsetof(FWeakObjectEntryEnemy, IsDraw_28_E80940B34B48F650CA9D3C844F046C80) == 0x000031, "Member 'FWeakObjectEntryEnemy::IsDraw_28_E80940B34B48F650CA9D3C844F046C80' has a wrong offset!");

}

