#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeakObjectRecommendEnemy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PsychicGrabButtonType_structs.hpp"


namespace SDK
{

// UserDefinedStruct WeakObjectRecommendEnemy.WeakObjectRecommendEnemy
// 0x002C (0x002C - 0x0000)
struct FWeakObjectRecommendEnemy final
{
public:
	EPsychicGrabButtonType                        ObjectType_10_CE8A4C244BBD8863A7E283AE9E9F68C4;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5046[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Distance_11_4799AB1C47489058BF4D3AB64ED22FBF;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle_12_04A3732546917E43B65CABA903984528;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationZ_13_868638D5487C566F44EF6A9C25F2A3E4;     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset_16_92864CD84EB56482AA494A94F4B10D58;        // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName_19_5D89C8924A7BDB8358E7529684183F1F;      // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   WeakBoneName_24_8F00EA184A72D806BB7F90A0AEF23F5F;  // 0x0024(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWeakObjectRecommendEnemy) == 0x000004, "Wrong alignment on FWeakObjectRecommendEnemy");
static_assert(sizeof(FWeakObjectRecommendEnemy) == 0x00002C, "Wrong size on FWeakObjectRecommendEnemy");
static_assert(offsetof(FWeakObjectRecommendEnemy, ObjectType_10_CE8A4C244BBD8863A7E283AE9E9F68C4) == 0x000000, "Member 'FWeakObjectRecommendEnemy::ObjectType_10_CE8A4C244BBD8863A7E283AE9E9F68C4' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, Distance_11_4799AB1C47489058BF4D3AB64ED22FBF) == 0x000004, "Member 'FWeakObjectRecommendEnemy::Distance_11_4799AB1C47489058BF4D3AB64ED22FBF' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, Angle_12_04A3732546917E43B65CABA903984528) == 0x000008, "Member 'FWeakObjectRecommendEnemy::Angle_12_04A3732546917E43B65CABA903984528' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, RotationZ_13_868638D5487C566F44EF6A9C25F2A3E4) == 0x00000C, "Member 'FWeakObjectRecommendEnemy::RotationZ_13_868638D5487C566F44EF6A9C25F2A3E4' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, Offset_16_92864CD84EB56482AA494A94F4B10D58) == 0x000010, "Member 'FWeakObjectRecommendEnemy::Offset_16_92864CD84EB56482AA494A94F4B10D58' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, BoneName_19_5D89C8924A7BDB8358E7529684183F1F) == 0x00001C, "Member 'FWeakObjectRecommendEnemy::BoneName_19_5D89C8924A7BDB8358E7529684183F1F' has a wrong offset!");
static_assert(offsetof(FWeakObjectRecommendEnemy, WeakBoneName_24_8F00EA184A72D806BB7F90A0AEF23F5F) == 0x000024, "Member 'FWeakObjectRecommendEnemy::WeakBoneName_24_8F00EA184A72D806BB7F90A0AEF23F5F' has a wrong offset!");

}

